{
    "abyssinian": [
        "A pet which has a short, fine, and close-lying coat.",
        "A pet which has a warm reddish-brown base coat color, with darker bands or ticking.",
        "A pet which has almond-shaped eyes that can be gold, green, hazel or copper in color.",
        "A pet which has a muscular and athletic body.",
        "A pet which has a slightly arched back, giving it an appearance of being ready to pounce.",
        "A pet which has large, pointed ears that are set wide apart.",
        "A pet which has a wedge-shaped head with a slight break at the muzzle.",
        "A pet which has long, slender legs with small, oval paws.",
        "A pet which has a long, tapering tail that is broad at the base and narrow at the tip.",
        "A pet which has a distinct M-shaped marking on its forehead.",
        "A pet which has dark lines extending from its eyes and brows.",
        "A pet which has a dark outline around its lips and nose."
    ],
    "american bulldog": [
        "A pet which has a strong, muscular build.",
        "A pet which has a broad chest and a wide-set, sturdy stance.",
        "A pet which has a large head with a square shape.",
        "A pet which has a short, smooth coat that can be any color, but is often white with patches of black or brindle.",
        "A pet which has a distinct furrow between its round eyes.",
        "A pet which has ears that are set high on the head, but are often cropped to stand erect.",
        "A pet which has a thick, powerful neck that slopes down to broad shoulders.",
        "A pet which has a tail that is either straight or screwed, but not curly.",
        "A pet which has a strong jaw with a scissor bite.",
        "A pet which has a confident and alert expression.",
        "A pet which has a height that ranges from 20 to 28 inches at the shoulder.",
        "A pet which has a weight that ranges from 60 to 120 pounds.",
        "A pet which has a lifespan of 10 to 15 years."
    ],
    "american pit bull terrier": [
        "A pet which has a strong, muscular and solid build.",
        "A pet which has a broad, flat head and a wide, powerful jaw.",
        "A pet which has small to medium-sized ears that are high set and may be either cropped or natural.",
        "A pet which has round to almond-shaped eyes that are low down in the skull and set far apart.",
        "A pet which has a short, shiny, and stiff coat that comes in a variety of colors and patterns.",
        "A pet which has a thick, tapered tail that is not overly long.",
        "A pet which has a deep chest and a well-sprung ribcage.",
        "A pet which has a height typically ranging from 17 to 21 inches at the shoulder.",
        "A pet which has a weight that typically ranges from 30 to 85 pounds.",
        "A pet which has a confident and keen expression.",
        "A pet which has a strong neck that is slightly arched and tapering from shoulders to back of skull.",
        "A pet which has a short back and a slightly sloping topline from withers to rump.",
        "A pet which has well-defined and muscular shoulders.",
        "A pet which has straight, strong front legs and very muscular hindquarters."
    ],
    "basset hound": [
        "A pet which has a long, droopy face with sad-looking eyes.",
        "A pet which has a short, stocky body with a deep chest.",
        "A pet which has extremely long ears that hang low.",
        "A pet which has a long tail that is carried high.",
        "A pet which has a coat that is short, dense, and shiny.",
        "A pet which has a skin that is loose and elastic, causing wrinkles on the head and face.",
        "A pet which has a color pattern that is usually a combination of white, black, and brown.",
        "A pet which has a large, dome-shaped skull.",
        "A pet which has a body that is longer than it is tall.",
        "A pet which has a slow, deliberate gait.",
        "A pet which has a prominent dewlap, the loose skin hanging under the neck.",
        "A pet which has a muscular and heavy-boned structure despite its short stature.",
        "A pet which has a slightly curved tail, often with a white tip.",
        "A pet which has a prominent hump over the shoulders.",
        "A pet which has a deep-set, dark eyes with a melancholic expression."
    ],
    "beagle": [
        "A pet which has a medium-sized body, typically weighing between 20-30 pounds.",
        "A pet which has a short, dense coat that is usually tricolor (black, white, and tan) or bicolor (white and tan).",
        "A pet which has a square-shaped muzzle that is straight and medium in length.",
        "A pet which has large, round, and brown or hazel eyes that express a soft, appealing, and slightly pleading look.",
        "A pet which has long, wide, pendant-shaped ears that are set low and far apart on the head.",
        "A pet which has a strong, well-proportioned body with a deep chest and straight back.",
        "A pet which has a medium-length tail that is set high and carried gaily, but not curled over the back.",
        "A pet which has strong, compact, and cat-like feet.",
        "A pet which has a friendly and gentle expression, showing no aggression or timidity.",
        "A pet which has a high energy level and requires regular exercise.",
        "A pet which has a strong sense of smell and a tendency to follow its nose."
    ],
    "bengal": [
        "A pet which has a coat that is short and dense, giving it a plush feel to the touch.",
        "A pet which has a coat that is marked with spots, marbling, or a combination of these.",
        "A pet which has a distinctive \"M\" shape on the forehead.",
        "A pet which has large, round eyes that can be any color, but are usually green or gold.",
        "A pet which has a muscular body with a broad chest and strong, sturdy legs.",
        "A pet which has a tail that is medium to long in length, thick and tapered at the end with a rounded tip.",
        "A pet which has a coat that is highly contrasted, with spots or marbling that are darker than the base coat color.",
        "A pet which has a wild appearance, resembling a leopard or a jaguar.",
        "A pet which has a head that is slightly longer than it is wide, with medium to small ears that are wide at the base and rounded at the tips.",
        "A pet which has a coat that is glossy and richly colored, often with a golden or pearl dusting effect known as glitter."
    ],
    "birman": [
        "A pet which has a medium to large size, not as big as the largest breeds but definitely not a small cat.",
        "A pet which has a strong, muscular body that is surprisingly heavy when picked up.",
        "A pet which has a distinct color point pattern, similar to that of a Siamese, with contrasting darker colors on the ears, face, paws, and tail.",
        "A pet which has deep blue, almost round eyes.",
        "A pet which has a Roman-shaped nose, which is a medium-length nose with a curve at the end.",
        "A pet which has a medium-length coat that is silky to the touch and does not mat easily.",
        "A pet which has a lighter body color, often golden, but the points can be seal, blue, chocolate, lilac, red, cream, tortie, or lynx.",
        "A pet which has white \"gloves\" on each paw, a unique characteristic of this breed.",
        "A pet which has a bushy tail that is darker at the tip.",
        "A pet which has a strong chin and medium-sized ears that are set as much on top of the head as on the side."
    ],
    "bombay": [
        "A pet which has a solid, jet black coat.",
        "A pet which has a muscular and medium-sized body.",
        "A pet which has a round head with full cheeks.",
        "A pet which has large, wide-set, round eyes that are gold to copper in color.",
        "A pet which has a short, glossy, and tight-fitting coat.",
        "A pet which has a straight and medium-length tail.",
        "A pet which has a black nose.",
        "A pet which has medium-sized, wide-set ears that tilt forward slightly.",
        "A pet which has a strong jawline.",
        "A pet which has a slightly arched back.",
        "A pet which has a rounded abdomen.",
        "A pet which has paws that are black in color.",
        "A pet which has a distinctively panther-like appearance."
    ],
    "boxer": [
        "A pet which has a strong, muscular build.",
        "A pet which has a short, shiny, smooth coat.",
        "A pet which has a broad, blunt muzzle and a strong jaw.",
        "A pet which has a square-shaped body, with the length of the body roughly equal to its height.",
        "A pet which has a distinctive square-shaped head.",
        "A pet which has dark brown eyes that are not too small or too large.",
        "A pet which has high-set ears that are either cropped or kept natural.",
        "A pet which has a thick neck without any loose skin.",
        "A pet which has a docked tail or a naturally occurring bobtail.",
        "A pet which has a deep chest and a tightly tucked abdomen.",
        "A pet which has a playful, energetic, and friendly demeanor.",
        "A pet which has a color that is either fawn or brindle, with or without white markings.",
        "A pet which has a black mask around the muzzle."
    ],
    "british shorthair": [
        "A pet which has a dense and plush double coat that gives it a teddy bear-like appearance.",
        "A pet which has a broad chest and short, strong legs.",
        "A pet which has round paws and a thick tail with a rounded tip.",
        "A pet which has a round face with full cheeks.",
        "A pet which has medium-sized ears that are set wide apart.",
        "A pet which has large, round eyes that are usually copper or gold in color.",
        "A pet which has a distinctively chunky body, giving it a robust appearance.",
        "A pet which has a medium to large size, with males typically larger than females.",
        "A pet which has a calm and easygoing temperament, often depicted in its relaxed posture.",
        "A pet which has a blue-gray coat, although other color variations can exist.",
        "A pet which has a strong, muscular body, despite its plush appearance.",
        "A pet which has a relatively large and round head compared to its body size."
    ],
    "chihuahua": [
        "A pet which has a small size, typically weighing no more than 6 pounds.",
        "A pet which has a rounded, apple-shaped head.",
        "A pet which has large, round eyes that are dark or ruby in color.",
        "A pet which has ears that are large and stand erect.",
        "A pet which has a short, pointed muzzle.",
        "A pet which has a body that is slightly longer than it is tall.",
        "A pet which has a tail that is long and either curled over the back or carried in a loop.",
        "A pet which has a coat that can be either short and smooth or long and soft.",
        "A pet which has a variety of coat colors, including fawn, black, white, chocolate, and many others.",
        "A pet which has a fast, prancing gait.",
        "A pet which has a compact muscular body.",
        "A pet which has a soft spot on the top of the skull, known as a 'molera'.",
        "A pet which has a lifespan typically ranging from 14 to 16 years."
    ],
    "egyptian mau": [
        "A pet which has a medium-sized, muscular body with a slightly arched back.",
        "A pet which has a wedge-shaped head with a slight break at the muzzle.",
        "A pet which has large, almond-shaped, gooseberry green eyes.",
        "A pet which has medium to large sized ears that are broad at the base and moderately pointed.",
        "A pet which has a coat that is medium in length and has a silky texture.",
        "A pet which has a coat that is spotted, with the spots being only on the tip of the hairs.",
        "A pet which has a coat that comes in colors such as silver, bronze, smoke (dark gray), black, and blue.",
        "A pet which has a distinctive \"M\" shaped marking on its forehead.",
        "A pet which has a dark dorsal stripe that runs from the head to the tail along the spine.",
        "A pet which has a tail that is medium in length, heavier at the base and tapering towards the end.",
        "A pet which has hind legs that are slightly longer than the front legs.",
        "A pet which has a skin flap extending from the flank to the back knee, providing for greater agility and length of stride.",
        "A pet which has a distinct scarab beetle or \"M\" mark on the forehead.",
        "A pet which has dark mascara lines from the corners of its eyes."
    ],
    "english cocker spaniel": [
        "A pet which has a medium-sized, compact body.",
        "A pet which has a broad and deep muzzle.",
        "A pet which has long, low-set ears that are covered in long silky fur.",
        "A pet which has a dense, wavy or flat coat that comes in a variety of colors including black, liver, red, golden, black and white, liver and white, or any of these colors with tan.",
        "A pet which has a cheerful expression with dark brown or hazel eyes.",
        "A pet which has a strong, slightly arched neck.",
        "A pet which has a tail that is usually docked.",
        "A pet which has a strong, square jaw with a perfect scissor bite.",
        "A pet which has a deep chest and well-sprung ribs.",
        "A pet which has a height at the withers of between 15 to 17 inches.",
        "A pet which has a weight of between 26 to 34 pounds.",
        "A pet which has a strong, muscular back and well-developed hindquarters.",
        "A pet which has a coat that is medium length with feathering on the legs, chest, and belly.",
        "A pet which has a friendly and intelligent expression."
    ],
    "english setter": [
        "A pet which has a medium to large size, typically weighing between 45 to 80 pounds.",
        "A pet which has a long and lean head with a pronounced stop and square muzzle.",
        "A pet which has oval-shaped eyes that are usually dark brown or hazel in color.",
        "A pet which has long, pendant ears that are set low and hang close to the head.",
        "A pet which has a long and muscular neck, leading to a deep chest and well-sprung ribs.",
        "A pet which has a medium-length tail that is straight or slightly curved, and is usually carried level with the back.",
        "A pet which has a flat coat with feathering on the ears, chest, belly, back of the legs, and tail.",
        "A pet which has a coat that can be white with black, lemon, liver or orange markings, either solid, speckled or flecked.",
        "A pet which has a friendly and gentle expression, reflecting its calm and affectionate nature.",
        "A pet which has a graceful and elegant stance, with a well-balanced body."
    ],
    "german shorthaired": [
        "A pet which has a distinctively short and dense coat that feels tough to the touch.",
        "A pet which has a broad, strong muzzle with a well-defined stop.",
        "A pet which has almond-shaped, medium-sized eyes that are dark brown in color.",
        "A pet which has ears that are set high on the head, and when at rest, hang close to the head.",
        "A pet which has a strong, muscular neck that is of moderate length.",
        "A pet which has a body that is slightly longer than it is tall.",
        "A pet which has a tail that is usually docked to approximately 40% of its natural length.",
        "A pet which has a well-sprung, arched rib cage that extends well back.",
        "A pet which has a back that is strong, straight, and muscular.",
        "A pet which has a color pattern that is either solid liver or a combination of liver and white.",
        "A pet which has a strong, powerful, and well-muscled hindquarters.",
        "A pet which has a compact, short, and strong feet with well-arched toes.",
        "A pet which has a gait that is smooth, powerful, and ground-covering.",
        "A pet which has a size that ranges from medium to large, with males typically larger than females.",
        "A pet which has a temperament that is friendly, intelligent, and willing to please."
    ],
    "great pyrenees": [
        "A pet which has a predominantly white coat, sometimes with patches of gray, tan or badger.",
        "A pet which has a large and powerful build, often weighing between 85 and 160 pounds.",
        "A pet which has a thick, weather-resistant double coat that gives it a distinct, fluffy appearance.",
        "A pet which has a strong, wedge-shaped head with a slightly rounded crown.",
        "A pet which has dark brown, almond-shaped eyes that express a calm and intelligent demeanor.",
        "A pet which has V-shaped ears that are set at eye level and hang down close to its head.",
        "A pet which has a plumed tail that it carries low, reaching at least to its hocks and often curling up at the end.",
        "A pet which has a strong, muscular body with a broad, slightly sloping back.",
        "A pet which has a distinct bear-like gait due to its double dewclaws on its rear legs.",
        "A pet which has a confident and gentle demeanor, often appearing somewhat aloof or independent."
    ],
    "havanese": [
        "A pet which has a small, sturdy body, usually between 8.5 to 11.5 inches tall at the shoulder.",
        "A pet which has a long, silky coat that can be straight or wavy.",
        "A pet which has a tail that curls over its back.",
        "A pet which has a broad skull and a slightly flattened face.",
        "A pet which has large, round eyes that are dark brown or black.",
        "A pet which has ears that are medium in size and set high, falling in folds on the side of the head.",
        "A pet which has a double coat that comes in a variety of colors, including white, cream, fawn, chocolate, black, silver, or blue.",
        "A pet which has a lively and playful demeanor, often appearing to be smiling.",
        "A pet which has a slightly longer than tall body, giving it a rectangular appearance.",
        "A pet which has a soft undercoat and a more coarse outer coat.",
        "A pet which has a gait that is unique and springy, which corresponds to the lively temperament of the breed.",
        "A pet which has a lifespan typically between 14 to 16 years.",
        "A pet which has a weight that typically ranges from 7 to 13 pounds."
    ],
    "japanese chin": [
        "A pet which has a distinctively large and broad head in comparison to its body size.",
        "A pet which has a short, upturned muzzle.",
        "A pet which has large, wide-set eyes that are dark in color.",
        "A pet which has ears that are small, V-shaped, and set wide apart.",
        "A pet which has a soft and straight coat that is either black and white, red and white, or black and tan.",
        "A pet which has a plumed tail that curls over its back.",
        "A pet which has a compact and squarely proportioned body.",
        "A pet which has a height that ranges from 8 to 11 inches at the shoulder.",
        "A pet which has a weight that ranges from 7 to 11 pounds.",
        "A pet which has a distinctive oriental expression.",
        "A pet which has a unique gait, appearing to 'trot' when it moves."
    ],
    "keeshond": [
        "A pet which has a thick double coat that is typically silver and black in color.",
        "A pet which has a distinctive 'spectacles' pattern around its eyes.",
        "A pet which has a plume tail that curls over its back.",
        "A pet which has a medium size, typically weighing between 35-45 pounds.",
        "A pet which has a fox-like face with small, erect ears.",
        "A pet which has a sturdy and compact body.",
        "A pet which has a mane of hair around its neck, giving it a lion-like appearance.",
        "A pet which has a well-feathered, straight and off-standing outer coat.",
        "A pet which has a wedge-shaped head with a definite stop.",
        "A pet which has dark, almond-shaped eyes.",
        "A pet which has a black, pointed nose.",
        "A pet which has a strong and straight back.",
        "A pet which has a balanced and harmonious build."
    ],
    "leonberger": [
        "A pet which has a large, muscular, and well-balanced body.",
        "A pet which has a medium to long, water-resistant double coat that comes in lion-yellow, red, red-brown, or sandy colors.",
        "A pet which has a black mask that covers the muzzle and eyes.",
        "A pet which has medium-sized, almond-shaped, and dark brown eyes.",
        "A pet which has ears that are medium-sized, set high, and hang close to the head.",
        "A pet which has a deep chest and a strong, muscular back.",
        "A pet which has a bushy tail that hangs down to the hocks.",
        "A pet which has a broad, rectangular-shaped head.",
        "A pet which has a strong, well-muscled neck.",
        "A pet which has a straight, firm back and strong loins.",
        "A pet which has a friendly and gentle expression.",
        "A pet which has a strong, powerful, and free gait.",
        "A pet which has a height at the shoulder between 26 to 31.5 inches for males and 24.5 to 29.5 inches for females.",
        "A pet which has a weight between 90 to 170 pounds.",
        "A pet which has a thick undercoat and a longer outer coat that can be straight or slightly wavy."
    ],
    "maine coon": [
        "A pet which has a large, muscular body.",
        "A pet which has a broad chest.",
        "A pet which has a long, bushy tail.",
        "A pet which has tufted ears.",
        "A pet which has a square-shaped muzzle.",
        "A pet which has high cheekbones.",
        "A pet which has large, round, wide-set eyes that can be green, gold, or copper in color.",
        "A pet which has a heavy, shaggy coat that is longer on the ruff, stomach, and tail.",
        "A pet which has a coat that comes in a variety of colors and patterns.",
        "A pet which has large paws with tufts of fur between the toes.",
        "A pet which has a size significantly larger than most domestic cats.",
        "A pet which has a distinct \"M\" shaped marking on its forehead.",
        "A pet which has a longer back leg compared to the front, giving it a distinctive physical appearance.",
        "A pet which has a strong, wide chin that aligns with the upper lip and nose in profile."
    ],
    "miniature pinscher": [
        "A pet which has a compact, muscular and sturdy body.",
        "A pet which has a smooth, short and shiny coat.",
        "A pet which has a coat color that is either solid red, stag red, blue stag red, chocolate stag red, fawn stag red, or black with rust-red markings.",
        "A pet which has a distinctive high-set tail, often docked.",
        "A pet which has a wedge-shaped head with a tapered muzzle.",
        "A pet which has dark, oval eyes that are full of energy and intelligence.",
        "A pet which has high-set ears that can be cropped or left natural.",
        "A pet which has a proud, vigorous gait.",
        "A pet which is small in size, typically weighing between 8 to 12 pounds.",
        "A pet which has a height that ranges from 10 to 12.5 inches at the shoulder.",
        "A pet which has a characteristic 'hackney' gait, similar to that of a horse.",
        "A pet which has a strong, slightly arched neck without dewlap.",
        "A pet which has a level or slightly sloping croup.",
        "A pet which has a strong, straight back."
    ],
    "newfoundland": [
        "A pet which has a large, powerful body, well-muscled and heavy boned.",
        "A pet which has a broad, massive head with a slightly arched crown and strongly developed cheeks.",
        "A pet which has small, deep-set, and dark brown eyes.",
        "A pet which has small, triangular ears that are set well back on the head and lie close to the cheeks.",
        "A pet which has a thick, water-resistant double coat that comes in black, brown, gray, or black and white.",
        "A pet which has a broad, deep chest and a strong, muscular back.",
        "A pet which has a tail that is broad at the base and hangs down with a slight curve at the end.",
        "A pet which has webbed feet, which aid in swimming.",
        "A pet which has a sweet-natured and gentle temperament.",
        "A pet which is larger than most other dog breeds, typically weighing between 100 to 150 pounds.",
        "A pet which has a strong, wide muzzle that is as deep as it is long.",
        "A pet which has a gait that is effortless and smooth."
    ],
    "persian": [
        "A pet which has a round face with full cheeks.",
        "A pet which has a short, broad and strong body.",
        "A pet which has a short, cobby neck.",
        "A pet which has large, round eyes that are wide-set and can be either blue, green, or copper in color.",
        "A pet which has small, round-tipped ears that are set wide apart.",
        "A pet which has a short, snub nose with a distinct stop.",
        "A pet which has a full and long coat that is fine in texture and glossy in appearance.",
        "A pet which has a broad chest and a low carriage of the body.",
        "A pet which has a bushy tail that is in proportion to its body.",
        "A pet which has short, strong legs that are set wide apart.",
        "A pet which has large, round and firm paws.",
        "A pet which has a unique \"doll face\" or \"peke-face\" expression.",
        "A pet which has a coat that can come in a variety of colors and patterns."
    ],
    "pomeranian": [
        "A pet which has a small size, typically weighing between 3 to 7 pounds.",
        "A pet which has a thick double coat that stands out from its body.",
        "A pet which has a plume tail that lies flat and straight on its back.",
        "A pet which has a fox-like face with bright, almond-shaped eyes.",
        "A pet which has small, erect ears that are set high on its head.",
        "A pet which has a short, cobby body with a high-set tail.",
        "A pet which has a dense undercoat and a longer outer coat, giving it a fluffy appearance.",
        "A pet which has a lively and playful demeanor.",
        "A pet which has a coat that can come in a variety of colors, including orange, black, white, cream, blue, sable, black and tan, brown, and gray.",
        "A pet which has a distinctive prance-like walk or trot."
    ],
    "pug": [
        "A pet which has a compact, muscular body with a square build.",
        "A pet which has a large, round head with a short, square muzzle.",
        "A pet which has deep wrinkles on its face, especially around the forehead and eyes.",
        "A pet which has large, round, dark eyes that are set wide apart.",
        "A pet which has small, thin ears that are folded with the front edges against the side of the head.",
        "A pet which has a short, double coat that can be fawn, apricot, silver, or black.",
        "A pet which has a curled tail that rests on its back.",
        "A pet which has a distinctive pushed-in nose or \"flat\" face.",
        "A pet which is typically between 10 to 14 inches tall at the shoulder.",
        "A pet which has a characteristic grunting or snorting sound due to its short snout.",
        "A pet which has a slightly undershot jaw, meaning the lower teeth extend slightly beyond the upper teeth.",
        "A pet which has a characteristic waddling gait due to its wide-set, muscular legs."
    ],
    "ragdoll": [
        "A pet which has a large, muscular body with a soft, semi-long coat.",
        "A pet which has a distinct color point pattern, meaning the ears, face, paws, and tail are darker than the body.",
        "A pet which has blue, almond-shaped eyes.",
        "A pet which has a medium-sized head with a sweet expression.",
        "A pet which has a ruff of fur around the neck, giving the appearance of a mane.",
        "A pet which has a bushy tail that is usually darker at the tip.",
        "A pet which has a coat that lightens or darkens depending on the temperature.",
        "A pet which has a color pattern that may be bi-color, van, mitted, or colorpoint.",
        "A pet which has a plush and silky coat that requires regular grooming.",
        "A pet which has a gentle and calm temperament, often going limp when picked up."
    ],
    "russian blue": [
        "A pet which has a short, dense coat that stands out from the body.",
        "A pet which has a uniform, bright blue color with a silver sheen.",
        "A pet which has a medium to large size body with a muscular build.",
        "A pet which has a wedge-shaped head with a flat skull.",
        "A pet which has wide-set, almond-shaped eyes that are vivid green.",
        "A pet which has high-set, large ears that are wide at the base.",
        "A pet which has a long, graceful neck and a straight nose.",
        "A pet which has a broad chest and a long, tapering tail.",
        "A pet which has round paws with knuckles appearing prominently.",
        "A pet which has a double coat with the undercoat being soft and downy.",
        "A pet which has a plush, thick coat that is known for its texture and unique color.",
        "A pet which has a slight upturn to its mouth, giving it a smiling appearance."
    ],
    "saint bernard": [
        "A pet which has a powerful, muscular body.",
        "A pet which has a broad and massive head.",
        "A pet which has medium-sized, dark brown eyes.",
        "A pet which has medium-sized, triangular ears set high on the head.",
        "A pet which has a short, dense and smooth coat.",
        "A pet which has a longer, rough coat around the neck and on the thighs.",
        "A pet which has a bushy tail that is carried low.",
        "A pet which has a white coat with patches of red or brindle.",
        "A pet which has a distinctive marking on the face that resembles a mask.",
        "A pet which has a large size, typically weighing between 120 to 180 pounds.",
        "A pet which has a height ranging from 26 to 30 inches at the shoulder.",
        "A pet which has a black nose and lips.",
        "A pet which has a strong and broad chest.",
        "A pet which has a calm and gentle expression."
    ],
    "samoyed": [
        "A pet which has a thick, all-white coat that's resistant to dirt.",
        "A pet which has a fluffy, curled tail that often rests on its back.",
        "A pet which has a sturdy, muscular body.",
        "A pet which has a wedge-shaped head with a defined stop.",
        "A pet which has medium-sized, almond-shaped eyes that are usually black or brown.",
        "A pet which has erect, triangular ears that are covered with fur.",
        "A pet which has a broad, deep chest.",
        "A pet which has a friendly and gentle expression.",
        "A pet which has a strong, straight back.",
        "A pet which has a medium length muzzle that is in proportion with the rest of its head.",
        "A pet which has a black or brown nose.",
        "A pet which has a strong, muscular neck.",
        "A pet which has a feathered tail that is carried over the back.",
        "A pet which has a double coat with a dense, wooly undercoat and a longer, harsher outer coat.",
        "A pet which has a strong, well-muscled body.",
        "A pet which has a moderate bone structure.",
        "A pet which has a well-balanced, compact body.",
        "A pet which has a friendly and adaptable temperament.",
        "A pet which has a strong, well-feathered legs.",
        "A pet which has a well-cushioned, compact feet."
    ],
    "scottish terrier": [
        "A pet which has a compact and sturdy build.",
        "A pet which has a distinctive beard and eyebrows.",
        "A pet which has a long head in proportion to its size.",
        "A pet which has small, bright eyes that are almond-shaped and dark brown in color.",
        "A pet which has erect and pointed ears.",
        "A pet which has a thick double coat with a hard, wiry outer coat and a soft, dense undercoat.",
        "A pet which has a tail that is typically carried erect and is about 7 inches long.",
        "A pet which has a black coat, although it can also be wheaten (yellow) or brindle.",
        "A pet which has a height of about 10 inches at the shoulder.",
        "A pet which has a weight range between 18 to 22 pounds for males and 18 to 21 pounds for females.",
        "A pet which has a unique gait, driving its movement from its rear legs, giving it a very distinctive way of moving.",
        "A pet which has a muscular neck and shoulders.",
        "A pet which has a short back in relation to its length.",
        "A pet which has a deep chest and ribs that are well sprung out from the spine.",
        "A pet which has front legs that are very straight and strong boned."
    ],
    "shiba inu": [
        "A pet which has a small, muscular body.",
        "A pet which has a double coat that comes in various colors including red, black and tan, or cream.",
        "A pet which has a thick fur around the neck, giving it a 'mane' like appearance.",
        "A pet which has a curly tail that loops over its back.",
        "A pet which has small, triangular ears that stand erect.",
        "A pet which has a fox-like face with deep-set, almond-shaped eyes.",
        "A pet which has a confident, bold, and good-natured expression.",
        "A pet which has a height ranging from 13.5 to 16.5 inches at the shoulder.",
        "A pet which has a weight ranging from 17 to 23 pounds.",
        "A pet which has a black nose.",
        "A pet which has a straight and strong back.",
        "A pet which has well-developed, high-set thighs.",
        "A pet which has a brisk, agile, and powerful gait."
    ],
    "siamese": [
        "A pet which has a short, fine coat.",
        "A pet which has a light-colored body with darker points on the ears, face, paws, and tail.",
        "A pet which has strikingly blue, almond-shaped eyes.",
        "A pet which has a medium-sized, svelte and muscular body.",
        "A pet which has a wedge-shaped head with a straight profile.",
        "A pet which has large ears that are wide at the base and pointed at the tip.",
        "A pet which has a long, thin tail that tapers to a point.",
        "A pet which has a distinctive 'M' shaped mark on the forehead, often referred to as 'mask'.",
        "A pet which has a social, affectionate, and intelligent demeanor, often depicted in photos with humans or other pets.",
        "A pet which has a short and glossy coat that lies close to the body.",
        "A pet which has a long and graceful neck.",
        "A pet which has a tubular body type, being equally proportioned from shoulder to hip.",
        "A pet which has a unique color point pattern, where the body is lighter than the points (the face, ears, paws, and tail)."
    ],
    "sphynx": [
        "A pet which has a hairless, wrinkled skin.",
        "A pet which has a wedge-shaped head and prominent cheekbones.",
        "A pet which has large, lemon-shaped eyes that can be any color.",
        "A pet which has a muscular body with a barrel chest.",
        "A pet which has a potbelly, similar to that of a small kangaroo.",
        "A pet which has large, bat-like ears.",
        "A pet which has a short, whippy tail.",
        "A pet which has a skin color that matches what its fur would be.",
        "A pet which has a thin layer of down on the skin, giving it a soft feel.",
        "A pet which has a distinct lack of whiskers or has very short whiskers.",
        "A pet which has webbed feet.",
        "A pet which has a longer body compared to other cats.",
        "A pet which has a round abdomen.",
        "A pet which has a flat forehead and straight profile.",
        "A pet which has a high level of energy and curiosity."
    ],
    "staffordshire bull terrier": [
        "A pet which has a broad head and a short muzzle.",
        "A pet which has a muscular and robust body.",
        "A pet which has a short and smooth coat.",
        "A pet which has a deep and broad chest.",
        "A pet which has dark round eyes that are set wide apart.",
        "A pet which has a tail that is medium in length and low set.",
        "A pet which has rose or half pricked ears.",
        "A pet which has a strong jaw with a perfect scissor bite.",
        "A pet which has a height of about 14 to 16 inches at the shoulder.",
        "A pet which has a weight of about 24 to 38 pounds.",
        "A pet which has a coat that can be of various colors including black, white, fawn, blue, red, or brindle.",
        "A pet which has a distinctive confident and bold stance.",
        "A pet which has a compact, well-balanced body.",
        "A pet which has a wide front and strong hindquarters.",
        "A pet which has a straight and strong back."
    ],
    "wheaten terrier": [
        "A pet which has a single-layered coat that is soft and silky to touch.",
        "A pet which has a coat color that ranges from pale beige to a stunning gold, resembling the color of wheat.",
        "A pet which has a medium-sized body, typically weighing between 30 to 45 pounds.",
        "A pet which has a rectangular-shaped body, being slightly longer than it is tall.",
        "A pet which has a head that is rectangular in shape, with a strong and defined stop.",
        "A pet which has almond-shaped eyes that are usually a dark hazel color.",
        "A pet which has ears that are medium-sized and break level with the skull, falling forward close to the cheeks.",
        "A pet which has a tail that is usually docked and carried upright.",
        "A pet which has a lively and expressive face, often appearing to be smiling.",
        "A pet which has a dense and wavy coat, but not curly.",
        "A pet which has a coat that does not shed much, often considered hypoallergenic.",
        "A pet which has a compact and muscular build, indicating strength and agility.",
        "A pet which has a black nose regardless of the coat color.",
        "A pet which has a coat that changes color as it matures, with puppies being born dark brown and lightening to the final adult wheaten color by age two."
    ],
    "yorkshire terrier": [
        "A pet which has a small size, typically weighing between 4 to 7 pounds.",
        "A pet which has a compact body with a level back and a medium-sized tail carried slightly higher than the back.",
        "A pet which has a long, silky coat that is usually steel blue on the body and tail, and tan everywhere else.",
        "A pet which has a coat that is parted on the face and from the base of the skull to the end of the tail.",
        "A pet which has a small head with a medium-sized muzzle.",
        "A pet which has V-shaped ears that are set high and either erect or semi-erect.",
        "A pet which has dark, medium-sized, almond-shaped eyes that sparkle with an intelligent expression.",
        "A pet which has a black nose.",
        "A pet which has a well-proportioned body with a short back and overall square appearance.",
        "A pet which has a confident and vigorous demeanor.",
        "A pet which has hair on the head that is so abundant that it is usually tied in a band to keep from going into the dog's food and water.",
        "A pet which has a coat that is hypoallergenic and does not shed."
    ]
}