{
    "Apply Eye Makeup": [
        "An action which involves a person holding a small brush or applicator near their eye.",
        "An action which shows a person looking into a mirror with one eye closed.",
        "An action which displays a person with visible streaks of color or glitter around their eye area.",
        "An action which includes a variety of small, colorful pots or palettes in the vicinity.",
        "An action which involves a person pulling down their lower eyelid or lifting their upper eyelid.",
        "An action which shows a person with one eye appearing differently than the other, indicating makeup has been applied to one and not the other yet.",
        "An action which includes a person using a small, handheld tool near their eye, such as an eyelash curler.",
        "An action which shows a person with a concentrated expression, focusing on a small area of their face.",
        "An action which involves a person with a makeup sponge or beauty blender in their hand.",
        "An action which displays a person with mascara, eyeliner, or eyeshadow visibly in the frame."
    ],
    "Apply Lipstick": [
        "An action which involves a person holding a small cylindrical object near their mouth.",
        "An action which shows a person looking into a mirror or reflective surface.",
        "An action which involves a person making a puckering or stretching movement with their lips.",
        "An action which shows a person with a concentrated or focused facial expression.",
        "An action which involves a person using one hand to pull or stretch their skin around the mouth area.",
        "An action which shows a person with a noticeable color or shine on their lips.",
        "An action which involves a person using a small brush or applicator near their mouth.",
        "An action which shows a person in a makeup or beauty routine context.",
        "An action which involves a person using a compact or handheld mirror.",
        "An action which shows a person with a slight head tilt, often towards a mirror or light source."
    ],
    "Archery": [
        "An action which involves a person holding a long, thin piece of equipment with a string attached at both ends.",
        "An action where the person's one arm is extended straight out in front of them, while the other is pulling back on the string of the equipment.",
        "An action where the person's fingers or a mechanical device is used to pull back the string of the equipment.",
        "An action where the person's body is sideways to the target, with one foot slightly in front of the other.",
        "An action where the person's eyes are focused on a distant target.",
        "An action where a small, pointed object is placed on the string of the equipment, aimed towards a target.",
        "An action where the person is wearing protective gear on their arm and fingers to prevent injury from the string of the equipment.",
        "An action where the person is standing still, often in an outdoor setting, with a clear line of sight to a target.",
        "An action where the person's posture is upright and balanced, with the back straight and shoulders down.",
        "An action where the person's breathing appears controlled and focused."
    ],
    "Baby Crawling": [
        "An action which involves an individual moving on all fours, with both hands and knees touching the ground.",
        "An action where the person's body is close to the ground, typically a few inches above.",
        "An action where the person's back is relatively flat and parallel to the ground.",
        "An action where the person's head is usually looking forward or slightly downward.",
        "An action where the person's arms and legs are bent at the elbows and knees, respectively.",
        "An action where the person's palms and knees are directly supporting the body weight.",
        "An action where the person's buttocks are slightly raised, but not as high as in a yoga 'downward dog' position.",
        "An action where the person's movement is typically slow and cautious, often with alternating hand and knee movements.",
        "An action where the person's belly is not touching the ground, distinguishing it from actions like 'snake crawling'.",
        "An action where the person's feet are usually flexed with toes curled under, ready to push off for forward movement."
    ],
    "Balance Beam": [
        "An action which involves a person standing or moving on a narrow, elevated beam.",
        "An action where the person is performing gymnastic movements on a long, thin piece of equipment.",
        "An action where the person is maintaining balance while moving along a narrow surface.",
        "An action where the person might be doing flips, jumps, or turns on a beam.",
        "An action where the person's arms are often outstretched to help maintain balance.",
        "An action which may involve a person landing on a mat after jumping off a beam.",
        "An action where the person is wearing gymnastic attire, such as a leotard.",
        "An action which takes place in a gymnasium or a similar setting.",
        "An action where the person's focus and concentration are evident.",
        "An action which may involve a person performing a handstand or split on a narrow beam.",
        "An action where the person's body is often in a straight line or a graceful pose.",
        "An action which may involve a person balancing on one foot on a beam.",
        "An action where the person may be surrounded by judges, spectators, or other gymnasts.",
        "An action where the person may be using chalk on their hands or feet for better grip.",
        "An action which may involve a person performing a dismount from a beam."
    ],
    "Band Marching": [
        "An action which involves a group of people moving in a coordinated manner.",
        "An action which includes individuals holding musical instruments.",
        "An action which shows people wearing matching uniforms.",
        "An action which takes place outdoors, often on a field or street.",
        "An action which involves people following a specific formation or pattern.",
        "An action which may include a person or people leading the group, often with a baton.",
        "An action which may show people playing their instruments while moving.",
        "An action which may include flag bearers or color guard members.",
        "An action which may show people marching in step with each other.",
        "An action which may include a drum major or conductor guiding the group.",
        "An action which may show a crowd or audience watching the performance.",
        "An action which may occur during a parade, sporting event, or other public gathering.",
        "An action which may show people carrying large instruments like tubas or drums while marching.",
        "An action which may show people wearing hats or helmets as part of their uniform.",
        "An action which may show people carrying sheet music or lyres attached to their instruments."
    ],
    "Baseball Pitch": [
        "An action which involves a person standing on a mound with one leg raised and the other firmly planted on the ground.",
        "An action which shows a person's arm in a wind-up or follow-through motion.",
        "An action which involves a person holding a small, round object in their hand, presumably a baseball.",
        "An action which shows a person wearing a baseball uniform, often including a cap, cleats, and a glove.",
        "An action which takes place in a baseball field, often identifiable by the diamond shape and the presence of bases.",
        "An action which involves a person's body twisted in a way that suggests they are about to throw something.",
        "An action which shows a person's eyes focused on a distant point, suggesting they are aiming at a target.",
        "An action which involves a person with their fingers positioned in a specific way around the object in their hand, suggesting a particular type of pitch.",
        "An action which may show other players in the background, either in fielding positions or waiting to bat.",
        "An action which may show a catcher in a squatting position behind the person, ready to catch the ball."
    ],
    "Basketball": [
        "An action which involves a person holding or throwing a round, orange ball.",
        "An action which takes place on a court with painted lines and hoops at either end.",
        "An action which involves a person jumping high off the ground with a ball in their hands.",
        "An action which shows a person dribbling a ball on the ground while moving.",
        "An action which involves a person aiming a ball at a hoop with a net.",
        "An action which shows a person wearing athletic clothing, often including basketball shoes and jerseys.",
        "An action which involves multiple people, often in opposing colored uniforms, interacting with one ball.",
        "An action which shows a person performing a slam dunk, i.e., jumping and throwing the ball downwards into the hoop.",
        "An action which involves a person blocking another person's attempt to throw a ball into a hoop.",
        "An action which shows a person passing a ball to another person on the same team.",
        "An action which involves a person standing at a free-throw line, preparing to throw a ball into a hoop.",
        "An action which shows a person bouncing a ball off a backboard into a hoop.",
        "An action which involves a person in a defensive stance, with arms outstretched, attempting to prevent an opponent from passing or shooting.",
        "An action which shows a person running or moving quickly while maintaining control of a ball.",
        "An action which involves a person catching a ball while in motion on the court."
    ],
    "Basketball Dunk": [
        "An action which involves a person leaping in the air towards a basketball hoop.",
        "An action where the person's hand is above the rim of the basketball hoop.",
        "An action where the person is holding a basketball in one or both hands while in mid-air.",
        "An action where the person's body is elevated off the ground, often with legs bent at the knees.",
        "An action where the basketball hoop and backboard are clearly visible in the background.",
        "An action where the person is often seen in an aggressive or powerful posture, indicating a forceful action.",
        "An action where the person's eyes are focused on the basketball hoop.",
        "An action where the person is often surrounded by spectators or other players, indicating a competitive environment.",
        "An action where the person is typically dressed in basketball attire, including basketball shoes, shorts, and a jersey.",
        "An action where the person's arm, holding the basketball, is extended towards the hoop.",
        "An action where the person is often captured at the peak of their jump, just before or after the ball is dunked into the hoop."
    ],
    "Bench Press": [
        "An action which involves a person lying on their back on a flat surface.",
        "An action where the individual's hands are extended outwards, holding a barbell.",
        "An action where the person's feet are firmly planted on the ground on either side of the bench.",
        "An action where the person's arms are bending and straightening in a repetitive motion.",
        "An action where the person's chest muscles are visibly strained or flexed.",
        "An action where the person's eyes are typically focused on the barbell they are lifting.",
        "An action where the individual is usually assisted by a spotter standing behind or beside the bench.",
        "An action where the barbell is typically loaded with weight plates on both ends.",
        "An action where the person's back and buttocks are in contact with the bench throughout the exercise.",
        "An action where the person's hands are gripping the barbell wider than shoulder-width apart."
    ],
    "Biking": [
        "An action which involves a person seated on a two-wheeled vehicle.",
        "An action which shows a person wearing a helmet and other protective gear.",
        "An action which involves a person holding onto handlebars.",
        "An action which shows a person pedaling with their feet.",
        "An action which takes place on a road, trail, or bike path.",
        "An action which involves a person leaning forward or standing on pedals.",
        "An action which shows a person maneuvering a vehicle with two wheels, one behind the other.",
        "An action which may show a person carrying a water bottle or backpack for long rides.",
        "An action which may involve a person wearing tight, aerodynamic clothing.",
        "An action which may show a person using a headlight or taillight if biking at night.",
        "An action which may involve a person wearing sunglasses or goggles for protection.",
        "An action which may show a person using a bike computer or GPS device mounted on the handlebars."
    ],
    "Billiards": [
        "An action which involves a person holding a long, thin stick, known as a cue.",
        "An action which includes a green, rectangular table with six pockets.",
        "An action which involves small, colored balls arranged on a table.",
        "An action which shows a person aiming at a ball with a stick.",
        "An action which includes a white ball being used to hit other balls.",
        "An action which involves a person bending over a table with one hand on the table and the other holding the cue.",
        "An action which shows a person in a stance with their dominant foot slightly back.",
        "An action which may include chalk being applied to the end of a cue stick.",
        "An action which may show a triangle rack used to arrange the balls at the start of the game.",
        "An action which may involve a person wearing a glove on their bridge hand.",
        "An action which may show a person using a bridge stick to extend their reach on the table.",
        "An action which may include a person calculating angles and planning shots.",
        "An action which may show a person using a mechanical bridge, also known as a rest, to support the cue stick.",
        "An action which may show a person making a break shot, where the cue ball is shot at the balls that are racked together.",
        "An action which may show a person performing a jump shot, where the cue ball is made to jump intentionally to clear an obstacle."
    ],
    "Blow Dry Hair": [
        "An action which involves a person holding a handheld electrical device near their head.",
        "An action where the person's hair appears to be in motion or flowing due to air.",
        "An action where the person is looking into a mirror, often with a focused expression.",
        "An action where the person's other hand is using a brush or comb on their hair.",
        "An action which takes place typically in a bathroom or bedroom, near a vanity or sink.",
        "An action where the person's hair appears to be wet or damp at the start and dry at the end.",
        "An action where the person may be sectioning off parts of their hair for more efficient drying.",
        "An action where the person may be using a round brush to create volume or curls while drying.",
        "An action where the electrical cord of the device is visible.",
        "An action where the person may be using protective gear like a heat resistant glove."
    ],
    "Blowing Candles": [
        "An action which involves a person leaning towards a cake or other dessert with lit candles.",
        "An action which shows a person with puffed cheeks, indicating they are blowing air.",
        "An action which features a person in front of a cake with candles that are in the process of being extinguished.",
        "An action which often takes place in a celebratory setting, such as a birthday party.",
        "An action which may show other people around, often clapping or cheering.",
        "An action which may include a person making a wish before performing the action.",
        "An action which often involves a person with a happy or excited facial expression.",
        "An action which may show a slight blur or movement, indicating the motion of blowing.",
        "An action which may show candles with smoke trails, indicating they have just been blown out.",
        "An action which may be accompanied by party decorations or presents in the background."
    ],
    "Body Weight Squats": [
        "An action which involves a person standing with feet shoulder-width apart.",
        "An action where the individual's hips are moved back and down, as if sitting in an imaginary chair.",
        "An action where the person's thighs are parallel to the floor or lower.",
        "An action where the person's knees are directly above their ankles, not pushed out too far.",
        "An action where the person's back is straight and not hunched over.",
        "An action where the person's arms are extended straight out in front for balance.",
        "An action where the person's weight is on their heels, not their toes.",
        "An action where the person's head is facing forward, not looking down.",
        "An action where the person's chest is lifted, not leaning forward.",
        "An action where the person's body forms a \"sitting\" posture in mid-air.",
        "An action where the person's knees do not go beyond their toes while lowering the body.",
        "An action where the person's entire body, from the head to the feet, is involved."
    ],
    "Bowling": [
        "An action which involves a person holding a large, round object with three holes.",
        "An action which takes place in an indoor setting with long, narrow lanes.",
        "An action which shows a person in a throwing or swinging motion, with one arm extended towards the front.",
        "An action which includes pins at the end of a lane, often ten in number, arranged in a triangular formation.",
        "An action which shows a person wearing special shoes, often two-toned or multicolored.",
        "An action which may include a person bending their knee and leaning forward, as if about to release or throw something.",
        "An action which may show a person in a follow-through position, with their arm swung forward and their body slightly off-balance.",
        "An action which may include a person standing on a wooden or synthetic surface, often glossy or polished.",
        "An action which may show a person with a focused or concentrated expression, often looking towards the end of a lane.",
        "An action which may include a person standing near a ball return system, a common feature in bowling alleys.",
        "An action which may show a person in a stance with their feet apart, one slightly ahead of the other, a common bowling stance.",
        "An action which may show a person in the company of others, as bowling is often a social activity."
    ],
    "Boxing Punching Bag": [
        "An action which involves a person standing in front of a punching bag.",
        "An action where the person's fists are clenched and one or both are in contact with the bag.",
        "An action where the person is wearing boxing gloves.",
        "An action where the person's body is positioned in a typical boxing stance, with one foot slightly ahead of the other.",
        "An action where the person's arms are positioned to protect their face or body, a common defensive posture in boxing.",
        "An action where the person's muscles, especially in the arms and shoulders, are visibly tensed.",
        "An action where the punching bag is visibly in motion or deformed from the impact of the punch.",
        "An action where the person is dressed in typical boxing or workout attire.",
        "An action where the person's face shows concentration or exertion.",
        "An action that takes place in a setting that resembles a gym or boxing ring."
    ],
    "Boxing Speed Bag": [
        "An action which involves a person standing in front of a small, teardrop-shaped bag suspended from above.",
        "An action where the person's fists are clenched and are in a position as if hitting the small bag.",
        "An action where the person's stance is similar to a typical boxing stance, with one foot slightly in front of the other.",
        "An action where the person's arms are moving in a rhythmic, rapid motion.",
        "An action where the person's focus is on the small, suspended bag.",
        "An action where the person is wearing boxing gloves or hand wraps.",
        "An action which takes place in a gym or a similar fitness environment.",
        "An action where the person's body, especially the upper body, shows signs of exertion or sweat.",
        "An action where the small bag is in motion, indicating it has been hit.",
        "An action where the person may be bouncing lightly on their toes, a common boxing movement."
    ],
    "Breast Stroke": [
        "An action which involves the person's arms moving in a semicircular motion in front of their body.",
        "An action where the person's legs are performing a frog-like kick, with knees bent and feet turned outwards.",
        "An action where the person's head is seen bobbing in and out of the water.",
        "An action where the person's body is lying flat on the water surface, facing downwards.",
        "An action where the person's arms and legs are spread out wide and then brought back together in a synchronized manner.",
        "An action where the person's body is seen in a streamlined position after each stroke.",
        "An action where the person's arms are seen pushing water backwards, propelling the body forward.",
        "An action where the person's body is seen in a horizontal position in the water.",
        "An action where the person's body is seen moving in a wave-like motion.",
        "An action where the person's head is seen rising above the water surface to breathe in between strokes."
    ],
    "Brushing Teeth": [
        "An action which involves a person holding a toothbrush.",
        "An action where a person has a toothbrush in their mouth.",
        "An action where a person is standing in front of a bathroom mirror.",
        "An action where a person is in a bathroom setting.",
        "An action where a person has toothpaste foam around their mouth.",
        "An action where a person is making back-and-forth motions near their mouth.",
        "An action where a person is holding a tube of toothpaste.",
        "An action where a person is seen spitting into a sink.",
        "An action where a person is rinsing their mouth with water.",
        "An action where a person is using a cup or glass near a sink.",
        "An action where a person is seen with a towel around their neck or nearby.",
        "An action where a person is seen with a toothbrush and toothpaste in the same frame.",
        "An action where a person is seen with a dental floss or mouthwash in the same frame.",
        "An action where a person is seen in a morning or bedtime routine.",
        "An action where a person is seen with a timer or clock, indicating a specific brushing time."
    ],
    "Clean And Jerk": [
        "An action which involves a person lifting a barbell from the ground to a racked position across deltoids and clavicles.",
        "An action where the person's feet are spread apart and hands are gripping a barbell on the ground.",
        "An action where the person is seen in a squatting position with a barbell resting on their shoulders.",
        "An action where the person is seen standing straight with a barbell held above their head with straight arms.",
        "An action where the person's body is seen in two distinct phases: first, pulling the weight from the floor to the shoulders (clean); second, pushing the weight from the shoulders to above the head (jerk).",
        "An action where the person is seen with their elbows pointing out in front, while the barbell is resting on their shoulders.",
        "An action where the person is seen in a lunge or split position with a barbell held overhead.",
        "An action where the person is seen exerting force to lift a heavy weight from the ground to overhead in two movements.",
        "An action where the person is seen with their knees bent and chest up, ready to lift a barbell.",
        "An action where the person is seen in the final position with their body and arms fully extended, holding a barbell overhead."
    ],
    "Cliff Diving": [
        "An action which involves a person jumping off a high cliff or rock formation.",
        "An action which shows a person in mid-air, usually in a diving or jumping position.",
        "An action which includes a body of water, such as a sea, lake, or river, at the bottom of the cliff.",
        "An action which often shows a person with arms extended or tucked in, depending on the stage of the dive.",
        "An action which may show a person wearing swimming attire or wetsuit.",
        "An action which may include a person performing acrobatic maneuvers in mid-air.",
        "An action which may show a splash of water, indicating the point of entry.",
        "An action which may show a person with a focused or intense expression, indicating concentration.",
        "An action which may include safety equipment like a helmet or life jacket, especially in professional cliff diving photos.",
        "An action which may show spectators or a crowd watching from the cliff or from boats, especially in competition settings."
    ],
    "Cricket Bowling": [
        "An action which involves a person standing with one arm extended straight, as if about to throw a ball.",
        "An action which shows a person holding a small, hard ball in one hand.",
        "An action which depicts a person in a cricket uniform, often white, with protective gear such as pads and gloves.",
        "An action which takes place on a cricket pitch, with wickets visible in the background.",
        "An action which shows a person's body in a twisted position, with one foot pointing towards the target and the other foot behind.",
        "An action which shows a person's arm in a circular motion, indicating the unique bowling action in cricket.",
        "An action which shows a person's non-bowling arm pointing towards the batsman or the wickets.",
        "An action which shows a person's eyes focused on the target, usually the batsman or the wickets.",
        "An action which shows a person in the middle of a run-up, indicating the momentum needed for cricket bowling.",
        "An action which shows a person with a bent back, indicating the force exerted during the bowling action."
    ],
    "Cricket Shot": [
        "An action which involves a person holding a flat, rounded bat.",
        "An action where the person is standing in a sideways stance.",
        "An action where the person's eyes are focused on a small, hard ball.",
        "An action where the person is wearing protective gear such as gloves, pads, and a helmet.",
        "An action that takes place on a large, open field with wickets at each end.",
        "An action where the person's body is positioned to either hit the ball or has just hit the ball.",
        "An action where the person's arms are extended, either before or after swinging the bat.",
        "An action where the person is wearing a uniform, often white, indicating they are part of a cricket team.",
        "An action that may show other players in the background, either fielding or waiting to bat.",
        "An action where the person's feet are positioned wide apart for stability.",
        "An action that may show the ball in motion, either coming towards the person or moving away after being hit.",
        "An action where the person's body shows a high level of physical exertion or tension."
    ],
    "Cutting In Kitchen": [
        "An action which involves a person holding a knife.",
        "An action which takes place in a kitchen setting.",
        "An action which involves a cutting board.",
        "An action which includes food items, such as vegetables, fruits, or meat.",
        "An action where the person's hand is in a position that suggests they are slicing or chopping.",
        "An action which may show cut or chopped food items on the cutting board.",
        "An action which may include kitchen utensils like bowls, pots, or pans in the background.",
        "An action where the person is standing or sitting at a kitchen counter.",
        "An action which may show a person wearing an apron or other kitchen attire.",
        "An action which may involve a person looking intently at the food item they are cutting."
    ],
    "Diving": [
        "An action which involves a person in mid-air, typically above a body of water.",
        "An action where the person's body is streamlined, often with hands above the head and legs straight.",
        "An action which shows a person wearing a swimsuit or diving suit.",
        "An action where the person is seen in a position that suggests they are about to enter the water, such as a pike or tuck position.",
        "An action which may show a diving board or platform in the background.",
        "An action where the person's body is angled towards the water.",
        "An action which may show water splashes or ripples, indicating a recent or imminent entry into the water.",
        "An action where the person's face may show concentration or focus.",
        "An action which may show a person wearing diving goggles or a nose clip.",
        "An action which may show a pool, ocean, or other large body of water in the background.",
        "An action where the person's body may be twisted or turned in a way that suggests acrobatic movement.",
        "An action which may show a person in a backward or forward bending position while in the air."
    ],
    "Drumming": [
        "An action which involves holding drumsticks in both hands.",
        "An action which shows a person seated in front of a drum set.",
        "An action which displays a person striking cylindrical objects with sticks.",
        "An action which includes a person with a focused expression, typically associated with concentration on rhythm.",
        "An action which involves a person's hands in a mid-air position, suggesting a striking motion.",
        "An action which shows a person surrounded by various types of drums and cymbals.",
        "An action which includes a person using foot pedals, typically associated with bass drums or hi-hats.",
        "An action which shows a person in a rhythmic motion, often with a dynamic, energetic posture.",
        "An action which involves a person wearing ear protection, often used to protect against loud drumming sounds.",
        "An action which shows a person in a setting with soundproofing materials, often found in music studios.",
        "An action which includes a person with a drumstick making contact with a drum surface.",
        "An action which shows a person with drumsticks raised above their head, often seen in dramatic drumming performances."
    ],
    "Fencing": [
        "An action which involves a person wearing a white, padded uniform.",
        "An action which shows a person wearing a mask with a metal mesh.",
        "An action which includes a person holding a long, thin weapon, such as a foil, epee, or sabre.",
        "An action which displays a person in a lunging or en garde position.",
        "An action which takes place on a long, narrow strip known as a piste.",
        "An action which shows a person with one arm extended straight out towards their opponent.",
        "An action which involves quick, precise movements of the weapon.",
        "An action which may show electronic scoring equipment in the background.",
        "An action which may involve a person wearing a glove on the hand that holds the weapon.",
        "An action which may show a person with their non-weapon hand held up and back, away from their body.",
        "An action which may show a person with their feet positioned one in front of the other, rather than side by side.",
        "An action which may show a person making defensive moves, such as parrying or blocking with their weapon.",
        "An action which may show a person making offensive moves, such as thrusting or lunging with their weapon."
    ],
    "Field Hockey Penalty": [
        "An action which involves a player standing alone with a hockey stick and ball, preparing to strike.",
        "An action which shows a goalkeeper in full protective gear standing in front of the goal post.",
        "An action which depicts a player in a poised position, ready to hit the ball towards the goal.",
        "An action which takes place within a marked semi-circle area in front of the goal post.",
        "An action which shows other players standing outside the semi-circle area, waiting for the penalty to be taken.",
        "An action which shows the player with the hockey stick and ball, both feet planted firmly on the ground, indicating a stationary position.",
        "An action which shows the player's body leaning forward, indicating the preparation for a powerful strike.",
        "An action which shows the player's eyes focused on the goal, indicating concentration.",
        "An action which shows the player's hands positioned at the top and middle of the hockey stick, ready for a swing.",
        "An action which shows the ball on the ground, stationary, waiting to be hit."
    ],
    "Floor Gymnastics": [
        "An action which involves a person performing acrobatic movements on a mat or padded floor.",
        "An action which shows a person in mid-air, possibly during a flip or somersault.",
        "An action which involves a person balancing on one hand or on their head.",
        "An action which shows a person in a pose that requires flexibility, such as a split or a backbend.",
        "An action which involves a person twisting their body in a complex manner.",
        "An action which shows a person using their strength to hold a difficult pose, such as a handstand.",
        "An action which involves a person performing a series of coordinated movements, often to music.",
        "An action which shows a person in athletic attire, typically a leotard or similar outfit.",
        "An action which takes place in a gymnasium or similar setting, often with a large, open floor space.",
        "An action which may show a person with chalk on their hands or feet to improve grip.",
        "An action which may involve a person leaping, jumping, or bounding across the floor.",
        "An action which shows a person executing precise and controlled movements.",
        "An action which may show a person in a pose that requires strength, such as holding their body off the ground with their arms.",
        "An action which may involve a person spinning or rotating their body.",
        "An action which may show a person in a pose that requires balance, such as standing on one leg with the other extended."
    ],
    "Frisbee Catch": [
        "An action which involves a person extending their arms to catch an object.",
        "An action where the object in motion is a flat, round disc.",
        "An action that may take place in an open field or park, often with a casual or recreational setting.",
        "An action where the person's eyes are focused on the object in the air.",
        "An action where the person's body may be in a lunging or jumping position to reach the object.",
        "An action where the person's fingers are spread wide to grasp the incoming object.",
        "An action where the person may be running or moving to align with the trajectory of the object.",
        "An action that may involve other people in the background, either waiting their turn or watching the catch.",
        "An action where the person's body language suggests anticipation or concentration.",
        "An action that may be captured in a freeze-frame or action shot, with the disc clearly in mid-air."
    ],
    "Front Crawl": [
        "An action which involves the person's body being parallel to the water surface.",
        "An action where the person's arms are alternately reaching forward and pulling back through the water.",
        "An action where the person's legs are performing a flutter kick, with one leg kicking down into the water while the other leg recovers upwards.",
        "An action where the person's head is turned to one side with the mouth above the water surface, indicating breathing.",
        "An action where the person's body is streamlined, with the head in line with the body and the eyes looking straight down.",
        "An action where the person's hands are entering the water fingers first, with the palm pitched slightly upwards.",
        "An action where the person's body is rotating along the spine, rolling from side to side.",
        "An action where the person's feet are pointed, not flexed, during the flutter kick.",
        "An action where the person's arm is fully extended in front of the body underwater, while the other arm is exiting the water from the hip.",
        "An action where the person's body is in a continuous motion, with no pauses between strokes."
    ],
    "Golf Swing": [
        "An action which involves a person holding a club-like object with both hands.",
        "An action where the person is standing in a stance with their feet shoulder-width apart.",
        "An action where the person's body is twisted, indicating a swinging motion.",
        "An action where the person is looking in the direction of a small, round object on the ground.",
        "An action where the person is wearing traditional golf attire, such as a polo shirt, trousers, and golf shoes.",
        "An action that takes place in an open, grassy area, often with holes and flags in the background.",
        "An action where the person's back arm is straight and the front arm is bent at the elbow.",
        "An action where the person's body weight appears to be shifting from one foot to the other.",
        "An action where the person's wrists are hinged, indicating the end of a backswing or the start of a downswing.",
        "An action where the person's head is kept still, focusing on the ball.",
        "An action where the person's club is either behind them, indicating a backswing, or in front of them, indicating a follow-through."
    ],
    "Haircut": [
        "An action which involves a person holding a pair of scissors near another person's head.",
        "An action where a person is seen wearing a cape or cloth around their neck.",
        "An action which includes a person holding a comb and running it through another person's hair.",
        "An action where a person is seen sitting in a chair that looks like a barber's chair.",
        "An action which involves a person using a hair clipper near another person's head.",
        "An action where a person is seen with wet hair and another person is standing behind them.",
        "An action which includes a person holding a spray bottle and spraying it on another person's hair.",
        "An action where a person is seen with a mirror in front of them and another person standing behind them.",
        "An action which involves a person using a hairdryer near another person's head.",
        "An action where a person is seen with hair falling around them.",
        "An action which includes a person holding a razor near another person's head.",
        "An action where a person is seen with a towel around their neck and another person standing behind them.",
        "An action which involves a person using a straight razor near another person's head.",
        "An action where a person is seen with a cape or cloth around their neck and hair on the floor around them.",
        "An action which includes a person holding a brush and brushing it through another person's hair."
    ],
    "Hammer Throw": [
        "An action which involves a person holding a heavy ball attached to a wire.",
        "An action where the person is in a spinning or rotating motion.",
        "An action where the person is in a circular cage or netted area for safety.",
        "An action where the person is wearing athletic attire, often including gloves for grip.",
        "An action where the person's body is leaning back, using their strength to swing the object.",
        "An action where the person's feet are firmly planted on the ground, often in a pivoting position.",
        "An action where the person's arms are extended, swinging the object around their body.",
        "An action where the person is focused on a distant point, indicating the direction of the throw.",
        "An action where the person's body shows signs of exertion, such as muscle tension and a concentrated facial expression.",
        "An action where the person is often alone in the frame, due to the dangerous nature of the sport.",
        "An action where the person is in an outdoor setting, typically on a grassy field or athletic track."
    ],
    "Hammering": [
        "An action which involves a person holding a tool with a heavy metal head.",
        "An action where the person's arm is raised, poised to strike.",
        "An action where the person's hand is gripping a handle, typically at the end of the tool.",
        "An action where the person's focus is directed towards a specific point, usually on a flat surface.",
        "An action where there might be a nail or a similar object on a surface, ready to be struck.",
        "An action where the person's body posture suggests a forceful downward motion.",
        "An action where the person is typically standing or kneeling, but not sitting.",
        "An action where the person is often wearing protective gear like gloves or safety glasses.",
        "An action where the person's other hand is often steadying the object to be hammered.",
        "An action where the background often includes a workbench, construction site, or other similar settings.",
        "An action where there might be wood shavings, metal scraps, or other debris around, indicating ongoing work.",
        "An action where the person's facial expression often shows concentration or effort."
    ],
    "Handstand Walking": [
        "An action which involves a person being upside down, supported by their hands.",
        "An action where the person's body is in a vertical position, with their feet pointing upwards.",
        "An action where the person's hands are in contact with the ground, indicating they are supporting their body weight.",
        "An action where the person's legs are together and straight, similar to a gymnastic pose.",
        "An action where the person's arms are straight and shoulder-width apart, showing they are balancing their body.",
        "An action where the person's body is not in contact with any other object or person, suggesting they are moving independently.",
        "An action where the person's head is positioned between their arms, indicating an inverted position.",
        "An action where there might be a slight blur or movement around the hands, suggesting the person is walking on them.",
        "An action where the person's body alignment is straight from the hands to the feet, showing a controlled balance.",
        "An action where the person's gaze is directed towards the ground, indicating focus on balance and movement."
    ],
    "Head Massage": [
        "An action which involves one person's hands placed on another person's head.",
        "An action where the fingers are spread out and appear to be applying pressure on the scalp.",
        "An action that shows a person's facial expression of relaxation or pleasure.",
        "An action where one person is typically seated while another stands or sits behind or beside them.",
        "An action that may take place in a spa, salon, or wellness center setting.",
        "An action that may involve the use of oils or creams, as indicated by a bottle or jar in the picture.",
        "An action where the person receiving the action may have their eyes closed.",
        "An action that may show the person performing the action using a circular motion with their fingers or palms.",
        "An action that may show the person receiving the action with their hair disheveled or moved away from its usual style.",
        "An action that may show the person performing the action focusing on specific areas of the head such as the temples, the back of the head, or the crown."
    ],
    "High Jump": [
        "An action which involves a person leaping off one foot.",
        "An action where the person's body is arched backwards in mid-air.",
        "An action where a person is seen above a horizontal bar.",
        "An action where the person's legs are bent at the knees and tucked towards the chest in mid-air.",
        "An action where a person is seen in a motion of jumping high.",
        "An action where a person is seen in mid-air, parallel to the ground.",
        "An action where a person is seen in a setting with a landing pit or mat.",
        "An action where a person is seen in a sports attire, typically a tracksuit or shorts and a vest.",
        "An action where a person is seen in a stadium or sports field setting.",
        "An action where a person is seen with a focused or concentrated facial expression.",
        "An action where a person is seen in a position that defies normal standing or walking positions.",
        "An action where a person is seen in a position that suggests a high level of physical exertion.",
        "An action where a person is seen in a position that suggests a high level of athletic ability.",
        "An action where a person is seen in a position that suggests a high level of flexibility and agility.",
        "An action where a person is seen in a position that suggests a high level of balance and coordination."
    ],
    "Horse Race": [
        "An action which involves a person mounted on a horse.",
        "An action which shows the horse in a galloping or running motion.",
        "An action which takes place on a racetrack or open field.",
        "An action which includes the presence of other horses and riders in the background or foreground.",
        "An action which shows the person wearing a helmet and other protective gear.",
        "An action which shows the person holding onto reins.",
        "An action which may show a crowd of spectators in the background.",
        "An action which may include racing numbers or identifiers on the horse or rider.",
        "An action which may show the horse wearing a saddle and other racing equipment.",
        "An action which may show the person in a forward-leaning position, indicating speed.",
        "An action which may show the person wearing a colorful, tight-fitting uniform, often known as silks.",
        "An action which may show the horse's hooves off the ground, indicating motion.",
        "An action which may show dust or dirt being kicked up by the horse's hooves.",
        "An action which may show the person using a whip or crop.",
        "An action which may show the person wearing goggles to protect their eyes from dirt and debris."
    ],
    "Horse Riding": [
        "An action which involves a person sitting on an animal with four legs.",
        "An action where the person is wearing a helmet and boots, often specific to equestrian activities.",
        "An action where the person is holding onto reins.",
        "An action where the person is positioned on a saddle.",
        "An action that takes place in an open field, a track, or a specific horse-riding arena.",
        "An action where the person is seen controlling or guiding an animal.",
        "An action where the person's legs are positioned on either side of the animal's body.",
        "An action where the person is wearing protective gear like a vest or gloves.",
        "An action where the person is seen leaning forward, especially during a jump or gallop.",
        "An action where the person and the animal are in sync, indicating a trained movement.",
        "An action where the person is seen in equestrian attire, such as jodhpurs or breeches.",
        "An action where the person is seen jumping over hurdles or obstacles with the animal.",
        "An action where the person is seen performing dressage, a specific form of horse-riding.",
        "An action where the person is seen in a posture of sitting upright and maintaining a steady balance.",
        "An action where the person is seen in a competitive setting, such as a race or a showjumping event."
    ],
    "Hula Hoop": [
        "An action which involves a person standing upright with a large ring around their waist or neck.",
        "An action where the person's body, particularly the hips or neck, is in motion to keep the ring in continuous movement.",
        "An action where the person's hands are either free or slightly raised, but not holding onto anything.",
        "An action where the person's focus is on the ring around their body, indicating concentration.",
        "An action which may be performed individually, without the need for any other person or team.",
        "An action that can be performed both indoors and outdoors, often seen in parks, gyms, or at home.",
        "An action where the person may be smiling or laughing, indicating a fun or recreational activity.",
        "An action where the person may be wearing comfortable or athletic clothing, suitable for physical activity.",
        "An action where the person's feet are firmly planted on the ground, providing balance and stability.",
        "An action where the large ring, often brightly colored, is a prominent feature in the photo."
    ],
    "Ice Dancing": [
        "An action which involves a person or people wearing ice skates.",
        "An action which takes place on an ice rink or a frozen surface.",
        "An action which involves a person or people in a graceful or artistic pose.",
        "An action which may include a person or people wearing costumes often seen in ballet or ballroom dance.",
        "An action which may involve a person or people performing jumps, spins, lifts, or intricate footwork.",
        "An action which may involve a person or people holding hands or in other partnered dance positions.",
        "An action which may involve a person or people moving in time with music, suggested by the presence of speakers or a musical score.",
        "An action which may involve a person or people being watched by an audience or judges, suggested by the presence of spectator seating or scoreboards.",
        "An action which may involve a person or people using props like ribbons or hoops, although this is less common.",
        "An action which may involve a person or people expressing emotion through their facial expressions and body language, similar to a theatrical performance."
    ],
    "Javelin Throw": [
        "An action which involves a person holding a long, thin object, typically a spear-like item.",
        "An action which shows a person in a running or lunging position, as if preparing to launch something.",
        "An action which often takes place in an open field or athletic track, with clear markings or lanes.",
        "An action where the person's body is arched back, with one arm extended behind them, holding the object.",
        "An action where the person's other arm is usually extended forward, for balance and direction.",
        "An action where the person's eyes are focused in the direction they are aiming to throw.",
        "An action where the person's feet are positioned as if they are in mid-stride or about to push off the ground.",
        "An action which may show the person wearing athletic clothing, often a team uniform or professional athletic gear.",
        "An action which may include other athletes or officials in the background, indicating a competitive event.",
        "An action where the person's muscles, particularly in the arm and shoulder, may be visibly strained or tensed.",
        "An action which may show a shadow of the person and the object they are holding, indicating that the object is in the air and not touching the ground."
    ],
    "Juggling Balls": [
        "An action which involves a person manipulating several objects, typically three, in the air at once.",
        "An action which shows a person's hands and arms in motion, often in a circular pattern.",
        "An action which displays a person focusing intently on the objects they are manipulating.",
        "An action which often shows objects suspended in mid-air.",
        "An action which may show a blur or motion trail of the objects being manipulated due to the speed of the movement.",
        "An action which may show a person standing in a stable position, often with legs slightly apart for balance.",
        "An action which may involve brightly colored or distinctively patterned objects for visual effect.",
        "An action which may show a person with a concentrated or playful facial expression.",
        "An action which may be performed in a variety of settings, but often in public spaces or performance areas.",
        "An action which may show a person using their peripheral vision, as they rarely look directly at the objects they are juggling."
    ],
    "Jump Rope": [
        "An action which involves a person holding a rope with both hands.",
        "An action where the rope is seen to be in mid-air, indicating it is being swung.",
        "An action where the person's feet are off the ground, suggesting a jumping motion.",
        "An action where the person's body is in a slightly bent position, indicating the act of jumping.",
        "An action where the person's eyes are focused downwards, possibly watching the rope.",
        "An action where the person's arms are positioned slightly away from the body, allowing the rope to pass.",
        "An action where the rope appears blurred due to fast movement.",
        "An action where the person's hair or clothing might be in motion due to the jumping action.",
        "An action where the person's facial expression might show concentration or exertion.",
        "An action where the person is typically in a clear space, to allow for the rope to swing freely."
    ],
    "Jumping Jack": [
        "An action which involves a person standing with their legs spread wide and arms extended above their head.",
        "An action where the person's body forms an 'X' shape.",
        "An action where the person's feet are wider than shoulder-width apart and hands are raised above the head.",
        "An action where the person is in mid-air with their arms and legs spread out.",
        "An action where the person's body is in a star-like position.",
        "An action where the person's arms and legs are moving simultaneously in an outward and upward motion.",
        "An action where the person's body is off the ground with arms and legs extended.",
        "An action where the person's body is in a symmetrical position with arms and legs spread out.",
        "An action where the person's body is in a dynamic, energetic pose with arms and legs extended.",
        "An action where the person is in a position that suggests they are about to jump or have just landed from a jump with arms raised."
    ],
    "Kayaking": [
        "An action which involves a person sitting in a small, narrow watercraft.",
        "An action which shows a person using a double-bladed paddle.",
        "An action which takes place on a body of water, such as a river, lake, or sea.",
        "An action which involves a person wearing a life jacket or buoyancy aid.",
        "An action which may show a person wearing a helmet, especially if they are in white water or rough conditions.",
        "An action which may show a spray skirt attached to the cockpit of the watercraft, to prevent water from entering.",
        "An action which may show the person in a forward-leaning position, indicative of the paddling motion.",
        "An action which may show the person's body, arms, and paddle forming a sort of 'box' shape, a common kayaking technique.",
        "An action which may show the person navigating through rapids or calm water, depending on the type of kayaking.",
        "An action which may show the person performing a 'roll' or 'brace', maneuvers used to right the kayak if it capsizes."
    ],
    "Knitting": [
        "An action which involves the use of two long, pointed tools, often called knitting needles.",
        "An action where the person is manipulating a strand of yarn or thread with their hands.",
        "An action which shows a growing piece of fabric, often with a distinctive, interlocking pattern, being created.",
        "An action where the person's hands are often close together, manipulating the needles and yarn.",
        "An action which may involve a ball of yarn or thread visible in the photo.",
        "An action which may show the person looking intently at their hands or the growing piece of fabric.",
        "An action which may be performed while sitting, often in a relaxed or comfortable position.",
        "An action which may show loops of yarn being moved from one needle to the other.",
        "An action which may involve the person holding one needle under their arm or against their body for stability.",
        "An action which may show the person using their fingers to guide the yarn and create tension.",
        "An action which may show the person making small, precise movements with their hands and fingers.",
        "An action which may show a pattern or instructions, either printed or on a digital device, near the person."
    ],
    "Long Jump": [
        "An action which involves a person in mid-air, with both feet extended forward.",
        "An action which shows a person with their body stretched out horizontally in the air.",
        "An action which depicts a person above a long, narrow strip of sand or soft ground.",
        "An action which involves a person with their arms extended forward or to the sides for balance.",
        "An action which shows a person in a running pose but suspended in the air.",
        "An action which may include a long jump pit in the background.",
        "An action which may show a person just after takeoff from a small, rectangular board.",
        "An action which may include a crowd or judges watching from the side.",
        "An action which may show a person wearing athletic clothing and spiked shoes.",
        "An action which may include measurement tools or markers nearby."
    ],
    "Lunges": [
        "An action which involves one leg stepping forward with the knee bent at a 90-degree angle, while the other leg is positioned behind.",
        "An action where the person's back is straight and the chest is lifted.",
        "An action where the person's hands are typically on their hips or hanging at their sides.",
        "An action where the person's weight is distributed between the front and back foot.",
        "An action where the person's front knee is aligned with the ankle, not extending past the toes.",
        "An action where the person's back knee is hovering just above the ground.",
        "An action where the person's gaze is straight ahead, maintaining balance.",
        "An action where the person's feet are hip-width apart for stability.",
        "An action where the person's body is lowered into a lunge position, then raised back up.",
        "An action where the person's core is engaged to maintain balance and control during the movement."
    ],
    "Military Parade": [
        "An action which involves a large group of people in uniform marching in unison.",
        "An action which includes individuals carrying flags or banners, often representing a military unit or country.",
        "An action which involves people marching in a straight line or in precise formations.",
        "An action which includes the presence of military vehicles or equipment, such as tanks or artillery.",
        "An action which takes place in a public, often urban, setting with spectators watching.",
        "An action which involves individuals saluting or performing other military gestures.",
        "An action which includes the presence of high-ranking military officials or dignitaries.",
        "An action which involves people wearing medals, ribbons, or other military decorations.",
        "An action which may include a military band playing music.",
        "An action which often takes place on a significant date or event, such as a national holiday or anniversary.",
        "An action which may include flyovers by military aircraft.",
        "An action which involves strict discipline and orderliness."
    ],
    "Mixing": [
        "An action which involves the use of a spoon, whisk, or similar utensil.",
        "An action where the person's hands are positioned as if they are stirring or blending something.",
        "An action which includes a bowl, pot, or other container typically used for mixing ingredients.",
        "An action where the person's focus is directed towards the container they are interacting with.",
        "An action which may show a swirling or circular motion of the hand or utensil.",
        "An action where ingredients such as flour, eggs, or liquids can be seen, suggesting the process of combining them.",
        "An action which may involve the use of kitchen appliances like a mixer or blender.",
        "An action where the person is wearing an apron or other protective clothing, indicating they are involved in a cooking or baking process.",
        "An action which may show a slight blur or motion in the photo, indicating the stirring or mixing movement.",
        "An action where the person's body posture suggests they are applying force downwards, typical of a mixing action.",
        "An action which may show splatters or spills, common when mixing ingredients.",
        "An action which may take place in a kitchen or similar setting, suggesting a cooking or baking activity."
    ],
    "Mopping Floor": [
        "An action which involves a person holding a long stick with a fabric or sponge end.",
        "An action which shows a person pushing or pulling the stick across a flat surface.",
        "An action which typically takes place on a hard, flat surface such as tile, wood, or concrete.",
        "An action which may involve a bucket or container filled with water or cleaning solution nearby.",
        "An action which often shows the person bending slightly at the waist or knees.",
        "An action which may show the person wearing gloves or other protective gear.",
        "An action which may show the floor appearing wet or shiny, indicating it has been recently cleaned.",
        "An action which may show the person in a sweeping or scrubbing motion.",
        "An action which may show the person exerting physical effort, possibly indicated by facial expressions or body language.",
        "An action which may show the person moving in a back-and-forth or side-to-side motion."
    ],
    "Nunchucks": [
        "An action which involves a person holding a weapon composed of two sticks connected by a chain or rope.",
        "An action which shows a person performing a swift, circular motion with their hands.",
        "An action which depicts a person in a martial arts stance, with one arm extended and the other close to the body.",
        "An action which shows a person with a focused, intense expression, indicative of concentration.",
        "An action which involves a blur in the photo, suggesting rapid movement of an object in the person's hands.",
        "An action which shows a person wearing traditional martial arts attire.",
        "An action which may show the person's body in mid-twist or turn, as nunchuck moves often involve full body movements.",
        "An action which may show the person's feet positioned apart for balance, a common stance in martial arts.",
        "An action which may show the person's other hand poised and ready, often used for balance or to prepare for the next move in a nunchuck routine.",
        "An action which may show the person in an outdoor or dojo setting, common places for practicing martial arts."
    ],
    "Parallel Bars": [
        "An action which involves a person suspended between two horizontal bars.",
        "An action where the individual's arms are extended and supporting the body's weight.",
        "An action where the person's body is elevated, with no contact with the ground.",
        "An action where the person's legs may be straight, bent, or in a straddle position.",
        "An action where the person's hands are gripping onto bars.",
        "An action which may involve the person performing swings, balances, or releases.",
        "An action where the person's body may be in a horizontal or vertical position relative to the ground.",
        "An action which typically takes place in a gymnastics setting or competition.",
        "An action where the person's body may be in motion, performing flips or rotations.",
        "An action where the person may be wearing gymnastics attire, such as a leotard or fitted athletic clothing."
    ],
    "Pizza Tossing": [
        "An action which involves a person with a flat, round object in mid-air.",
        "An action where the person's hands are positioned as if they have just thrown or are about to catch something.",
        "An action that typically takes place in a kitchen or a restaurant setting.",
        "An action where the person is often wearing a chef's uniform or apron.",
        "An action where the person is looking upwards, following the trajectory of the object in the air.",
        "An action where the object in the air appears to be dough-like in texture.",
        "An action where the person may have flour on their hands or on the surface around them.",
        "An action where pizza toppings or a pizza box may be visible in the background.",
        "An action where the person's body posture suggests a swift, upward throwing motion.",
        "An action where the person may be surrounded by other kitchen utensils or equipment, such as a pizza oven, pizza cutter, or rolling pin."
    ],
    "Playing Cello": [
        "An action which involves a person sitting down with a large stringed instrument between their legs.",
        "An action which shows a person using a bow to play a large stringed instrument.",
        "An action which involves a person holding a large instrument that has a curved body and a long neck.",
        "An action which shows a person's fingers pressing down on the strings of a large instrument.",
        "An action which involves a person reading sheet music while playing a large stringed instrument.",
        "An action which shows a person using their left hand to press down on strings and their right hand to move a bow across those strings.",
        "An action which involves a person playing an instrument that is resting on the floor, supported by a metal or wooden endpin.",
        "An action which shows a person playing an instrument that is larger than a violin or viola, but smaller than a double bass.",
        "An action which involves a person producing sound by drawing a bow across the strings of a large instrument.",
        "An action which shows a person sitting upright, often with the instrument's body leaning against their chest and shoulder."
    ],
    "Playing Daf": [
        "An action which involves a person holding a circular, frame-like instrument.",
        "An action where the person's hands are striking a flat, drum-like surface.",
        "An action where the person is seated or standing with a musical instrument that has a large, circular surface.",
        "An action where the person's fingers or palms are in contact with a drum-like instrument, indicating a striking or tapping motion.",
        "An action where the person's facial expression or body language suggests concentration or rhythm, common in musical performances.",
        "An action that may show the person in traditional Middle Eastern attire, as the daf is a popular instrument in these regions.",
        "An action that may be accompanied by other musicians or dancers, as the daf is often used in ensemble performances.",
        "An action where the instrument being played has jingles or rings attached to its rim, a unique feature of the daf.",
        "An action that may take place in a musical or cultural event, given the daf's role in traditional music.",
        "An action where the person's posture suggests a rhythmic movement, common in drum playing."
    ],
    "Playing Dhol": [
        "An action which involves a person holding two drumsticks.",
        "An action which shows a person striking a large, barrel-shaped drum.",
        "An action which depicts a person with a drum strapped around their neck or waist.",
        "An action which involves a person standing or sitting while playing a drum.",
        "An action which shows a person playing a drum that has two sides.",
        "An action which involves a person playing a drum typically associated with Punjabi culture.",
        "An action which may show a person in traditional Indian attire.",
        "An action which may be accompanied by other people dancing or celebrating.",
        "An action which may be part of a festival, parade, or celebration.",
        "An action which may show a person in a rhythmic motion, indicating the playing of music."
    ],
    "Playing Flute": [
        "An action which involves a person holding a long, slender instrument horizontally across their body.",
        "An action which shows a person blowing air into a side hole of a musical instrument.",
        "An action which involves a person's fingers pressing down on various keys along a tube-like instrument.",
        "An action which often involves a person standing or sitting upright with their head tilted slightly to one side.",
        "An action which involves a person using their mouth and fingers simultaneously to create music.",
        "An action which may show a person reading sheet music while manipulating an instrument.",
        "An action which may be accompanied by the presence of a music stand or other musical equipment.",
        "An action which may be performed solo or within a group, such as an orchestra or band.",
        "An action which may show a person with a focused or concentrated facial expression.",
        "An action which may be performed in a variety of settings, from a concert hall to a living room."
    ],
    "Playing Guitar": [
        "An action which involves a person holding a stringed instrument with a long neck and a round body.",
        "An action where the person's fingers are positioned on the fretboard of the instrument.",
        "An action where the person's other hand is strumming or plucking the strings of the instrument.",
        "An action where the person is possibly seated or standing with the instrument held close to their body.",
        "An action which may show the person reading sheet music or looking at the instrument while playing.",
        "An action where the person's body posture suggests they are creating music.",
        "An action which may involve the person's foot tapping to keep rhythm.",
        "An action which may show the person using a pick to strum the strings.",
        "An action where the person may be wearing a strap over their shoulder to support the instrument.",
        "An action which may show the person's fingers forming chords on the fretboard.",
        "An action which may involve the person's mouth open as if they are singing along while playing.",
        "An action which may show the person's intense concentration or emotion while playing the instrument."
    ],
    "Playing Piano": [
        "An action which involves an individual sitting in front of a large, rectangular instrument with black and white keys.",
        "An action where the person's hands are positioned over the black and white keys, often in a curved manner.",
        "An action where the individual's fingers are pressing down on the keys of the instrument.",
        "An action which may show sheet music or a music stand in front of the individual.",
        "An action that may involve the use of foot pedals at the base of the instrument.",
        "An action where the individual is often seen concentrating or looking at the keys or sheet music.",
        "An action that may show the lid of the instrument lifted, revealing strings inside.",
        "An action which may involve the individual's body swaying or moving in rhythm with the music.",
        "An action that may show the individual's fingers moving rapidly across the keys.",
        "An action which may be performed either solo or with other musicians playing different instruments."
    ],
    "Playing Sitar": [
        "An action which involves a person sitting on the floor with a large stringed instrument.",
        "An action which shows a person plucking strings on a long-necked instrument.",
        "An action which involves a person using both hands, one for plucking and the other for changing the pitch of the strings.",
        "An action which shows a person playing an instrument that has a gourd-like body at one end.",
        "An action which involves a person playing an instrument with numerous strings, some of which may not be directly plucked.",
        "An action which shows a person holding a long, flat, fretted neck of an instrument, often with a resonating chamber attached.",
        "An action which involves a person in a focused, meditative posture, often associated with traditional Indian music.",
        "An action which may show a person using a metal or glass slide to change the pitch of the strings on the instrument.",
        "An action which may include a person sitting cross-legged or in a half-lotus position while playing the instrument.",
        "An action which may show a person reading from sheet music or playing by ear, indicative of the improvisational nature of sitar music."
    ],
    "Playing Tabla": [
        "An action which involves a person sitting down with two drum-like instruments in front of them.",
        "An action where the person's hands are positioned over the drums, ready to strike.",
        "An action where the person's fingers are spread out, indicating they are playing an instrument.",
        "An action where the person's palms are facing downwards towards the instruments.",
        "An action where the person's facial expression shows concentration or engagement.",
        "An action where the drums in front of the person are of different sizes, typically one smaller and one larger.",
        "An action where the person is possibly in traditional Indian attire, as tabla is a traditional Indian instrument.",
        "An action where the person might be accompanied by other musicians or singers, as tabla is often played in ensemble settings.",
        "An action where the person might be using a special technique like using the heel of the hand or the fingertips to produce different sounds on the tabla.",
        "An action where the person might be in a musical or performance setting, such as a stage or a music room."
    ],
    "Playing Violin": [
        "An action which involves holding a stringed instrument with a curved body and a long neck.",
        "An action which involves the use of a bow, typically made of horsehair, being drawn across the strings of the instrument.",
        "An action which requires the person to hold the instrument between their chin and shoulder.",
        "An action which involves the person's fingers pressing down on the strings of the instrument to change the pitch.",
        "An action which often shows the person in a seated or standing position, with the instrument resting on their shoulder.",
        "An action which may show the person reading sheet music while performing.",
        "An action which may involve intense concentration, often evident on the person's facial expression.",
        "An action which may show the person's body swaying or moving in rhythm with the music they are playing.",
        "An action which may involve the person wearing formal attire, as violin performances are often associated with classical music and formal events.",
        "An action which may show the person in a solo performance or as part of an orchestra."
    ],
    "Pole Vault": [
        "An action which involves a person holding a long, flexible pole.",
        "An action where the person is seen running with a long pole.",
        "An action where the person is seen using the pole to launch themselves over a high bar.",
        "An action where the person is seen in mid-air, above a horizontal bar.",
        "An action where the person is seen falling onto a large, soft mat.",
        "An action where the person is seen wearing athletic clothing, often a singlet and shorts.",
        "An action where the person is seen in a sports field or stadium setting.",
        "An action where the person's body is arched backwards while in mid-air.",
        "An action where the person is seen attempting to clear a bar without knocking it off its supports.",
        "An action where the person's body is seen in a position that suggests they are using their momentum and the flexibility of the pole to propel themselves upwards.",
        "An action where the person is seen in a position that suggests they are trying to invert their body over the bar.",
        "An action where the person is seen in a position that suggests they are trying to land feet-first after clearing the bar.",
        "An action where the person is seen in a position that suggests they are trying to push off the ground with the pole.",
        "An action where the person is seen in a position that suggests they are trying to rotate their body around the pole while in mid-air.",
        "An action where the person is seen in a position that suggests they are trying to maintain balance while in mid-air."
    ],
    "Pommel Horse": [
        "An action which involves a person swinging their legs in a continuous, circular motion around a stationary object.",
        "An action which shows a person supporting their body weight with their hands on two handles.",
        "An action which involves a person performing a gymnastic exercise on a piece of equipment that resembles a horse with two handles.",
        "An action which shows a person's body elevated and parallel to the ground, supported by their hands.",
        "An action which involves a person performing a series of complex movements, including swings, circles, flairs, and scissors.",
        "An action which shows a person using their upper body strength to perform a routine on a piece of gymnastic equipment.",
        "An action which involves a person maintaining a rhythmic motion, with their legs moving in a pendulum-like manner.",
        "An action which shows a person performing a routine on a piece of equipment that is typically covered in leather or a similar material.",
        "An action which involves a person demonstrating flexibility, strength, and balance in a gymnastic routine.",
        "An action which shows a person performing a routine on a piece of equipment that is approximately 1.6 meters in length."
    ],
    "Pull Ups": [
        "An action which involves a person hanging from a bar with their hands.",
        "An action where the individual's hands are gripping a bar above their head.",
        "An action where the person's body is suspended in the air, supported only by their arms.",
        "An action where the person's arms are bent at the elbows, indicating they are pulling themselves up.",
        "An action where the person's chin is level or above the bar they are holding onto.",
        "An action where the person's legs are either straight or bent at the knees, but not touching the ground.",
        "An action where the person's body is generally straight, without any significant arch or bend at the waist.",
        "An action where the person's shoulder muscles, biceps, and forearms are visibly strained or flexed.",
        "An action where the person's back muscles, particularly the latissimus dorsi, are visibly engaged.",
        "An action where the person's grip on the bar is either pronated (overhand) or supinated (underhand)."
    ],
    "Punch": [
        "An action which involves one arm extended forward, with the fist clenched.",
        "An action where the other hand is typically pulled back, ready to strike.",
        "An action where the person's body is slightly turned to the side, aligning with the punching arm.",
        "An action where the person's feet are positioned apart for balance, often with one foot slightly in front of the other.",
        "An action where the person's eyes are focused on a target in front of them.",
        "An action where the person's facial expression shows concentration or aggression.",
        "An action where the person's muscles, especially in the arm and shoulder, are visibly tensed.",
        "An action where the person's body posture suggests forward momentum.",
        "An action where the person's fist is positioned with the thumb wrapped around the fingers, not tucked inside.",
        "An action where the person's knuckles are facing the target, not the palm or the side of the hand."
    ],
    "Push Ups": [
        "An action which involves a person being in a prone position, with their body parallel to the ground.",
        "An action where the person's hands are placed shoulder-width apart on the ground.",
        "An action where the person's toes are the only other part of the body, apart from the hands, touching the ground.",
        "An action where the person's body is kept straight from head to heels.",
        "An action where the person's arms are bent at the elbows, causing the body to be lowered towards the ground.",
        "An action where the person's gaze is directed towards the floor, maintaining a neutral neck.",
        "An action where the person's shoulders are directly above their wrists.",
        "An action where the person's chest is close to the ground, but not touching it.",
        "An action where the person's legs and back maintain a rigid form, without any sagging or arching.",
        "An action where the person's elbows are tucked close to their body, not flared out to the sides."
    ],
    "Rafting": [
        "An action which involves a person or group of people in a small, inflatable boat.",
        "An action which takes place on a body of water, typically a river.",
        "An action where individuals are wearing life jackets and helmets.",
        "An action where people are using paddles to navigate the water.",
        "An action which often involves turbulent or fast-moving water.",
        "An action where the person or people appear to be working together to steer and propel the boat.",
        "An action which may show people reacting to waves, rapids, or obstacles in the water.",
        "An action where the surrounding environment often includes natural elements like rocks, trees, and riverbanks.",
        "An action which may show splashes of water or people being wet.",
        "An action where the boat being used is typically brightly colored and made of durable, flexible material.",
        "An action where people are often seated or kneeling in the boat.",
        "An action which may show people in the act of paddling, bracing for impact, or maneuvering the boat.",
        "An action where safety gear such as ropes, throw bags, or rescue equipment may be visible.",
        "An action which may show people expressing excitement, concentration, or effort."
    ],
    "Rock Climbing Indoor": [
        "An action which involves a person scaling a wall covered in colorful holds and grips.",
        "An action which shows a person wearing a harness and attached to a safety rope.",
        "An action which depicts a person using both their hands and feet to navigate a vertical or near-vertical surface.",
        "An action which takes place in an indoor setting, often with high ceilings and padded floors.",
        "An action which shows a person exerting physical strength, flexibility, and balance.",
        "An action which may show a belayer on the ground, managing the safety rope.",
        "An action which involves a person wearing specialized shoes with a tight fit and sticky rubber sole.",
        "An action which may show chalk on the person's hands to improve grip.",
        "An action which may show a person studying the wall before starting to climb, indicating route planning.",
        "An action which may show other climbers waiting their turn or watching the climber.",
        "An action which may show a person hanging or suspended in the air, indicating a fall or a jump."
    ],
    "Rope Climbing": [
        "An action which involves a person pulling themselves up using a vertical rope.",
        "An action where the person's hands are gripping a rope.",
        "An action where the person's legs are often wrapped around the rope or using it for support.",
        "An action where the person is suspended above the ground.",
        "An action which typically takes place in a gymnasium, outdoor adventure course, or climbing facility.",
        "An action where the person is often wearing athletic clothing and possibly gloves for grip.",
        "An action where the person's body is generally in a vertical position, parallel to the rope.",
        "An action where the person's muscles, particularly in the arms, shoulders, and core, are visibly strained.",
        "An action where safety equipment such as harnesses or mats may be visible.",
        "An action where the person's focus is directed upwards towards the top of the rope."
    ],
    "Rowing": [
        "An action which involves a person sitting with their legs extended forward.",
        "An action where the person's hands are holding onto a long, thin object.",
        "An action where the person's arms are extended forward, parallel to their extended legs.",
        "An action which shows a person pulling or pushing against water.",
        "An action where the person is seated on a sliding seat, moving back and forth.",
        "An action which involves a person in a narrow, long boat or on a rowing machine.",
        "An action where the person's back is leaning slightly backward or forward.",
        "An action which shows a person wearing sportswear, often with gloves for grip.",
        "An action where the person's body is in a cyclic motion - push with legs, lean back, pull with arms, lean forward, extend arms.",
        "An action which may show splashes of water around if it's outdoor rowing.",
        "An action which may show a digital screen in front of the person if it's indoor rowing.",
        "An action where the person's facial expression may show exertion or focus.",
        "An action which may include other people doing the same motion in the background if it's team rowing.",
        "An action which may show a coxswain, a person who steers the boat and coordinates the power and rhythm of the rowers in team rowing."
    ],
    "Salsa Spin": [
        "An action which involves a dancer with one foot planted while the other foot is lifted or in motion.",
        "An action which shows a dancer's body twisted or turned, indicating a spinning motion.",
        "An action which displays a dancer's arms extended or positioned to maintain balance during a spin.",
        "An action which portrays a dancer's body in a poised, upright posture, typical of salsa dancing.",
        "An action which features a dancer with a focused gaze, often directed at their partner or their own moving foot.",
        "An action which shows a dancer's body in a dynamic, fluid motion, indicative of the quick movements in salsa.",
        "An action which may include a partner, as salsa is often a partnered dance.",
        "An action which might show a dancer on the balls of their feet, a common position for executing spins in salsa.",
        "An action which could show a dancer in dance-specific attire, such as dance shoes, which are often worn for salsa dancing.",
        "An action which may show a dancer in a dance setting, such as a dance floor or stage, with music or dance-related elements in the background."
    ],
    "Shaving Beard": [
        "An action which involves a person holding a razor near their face.",
        "An action which shows a person with shaving cream or foam on their face.",
        "An action which takes place typically in a bathroom setting.",
        "An action which may involve a mirror reflecting the person's face.",
        "An action which may show a person with half of their face shaved and the other half not.",
        "An action which may include shaving accessories like a shaving brush, shaving cream, or aftershave lotion in the frame.",
        "An action which may show a person making a concentrated expression while looking at a mirror.",
        "An action which may show a person with a towel around their neck.",
        "An action which may show a person with wet skin or water droplets on their face.",
        "An action which may show discarded hair in a sink or on the razor."
    ],
    "Shotput": [
        "An action which involves a person holding a heavy spherical object close to their neck.",
        "An action where the person's body is twisted, preparing to throw the object.",
        "An action where the person's feet are positioned wide apart for stability.",
        "An action where the person's arm is bent at the elbow, holding the object near their face.",
        "An action where the person's other arm is extended out for balance.",
        "An action where the person is in a circular or semi-circular marked area.",
        "An action where the person is wearing athletic clothing, often with numbers or a team logo.",
        "An action where the person's facial expression shows exertion or focus.",
        "An action where the person's muscles, particularly in the arm, shoulder, and legs, are visibly tensed.",
        "An action where the person's body is leaning back slightly, preparing to use their whole body to propel the object forward.",
        "An action where the person is often surrounded by a field or track, indicating an athletic event.",
        "An action where the person is often observed by judges or spectators, indicating a competitive event.",
        "An action where the person's posture indicates a rapid, explosive movement is about to occur.",
        "An action where the person's body is often captured in mid-motion, indicating a high-speed action."
    ],
    "Skate Boarding": [
        "An action which involves a person standing on a small board with wheels.",
        "An action which often takes place in urban environments, skate parks, or on ramps.",
        "An action which may show the person in mid-air, often indicating a jump or trick.",
        "An action which may involve the person's body being twisted or contorted in a way that suggests movement or balance.",
        "An action which may show the person's arms outstretched for balance.",
        "An action which may show the person holding onto or manipulating the board with their hands.",
        "An action which may show the person wearing specific gear such as a helmet, knee pads, or elbow pads.",
        "An action which may show the person's feet positioned sideways on the board.",
        "An action which may show the person pushing off the ground with one foot while the other remains on the board.",
        "An action which may show the board flipping or spinning, indicating a trick being performed.",
        "An action which may show the person sliding down or along a rail or ledge with the board.",
        "An action which may show the person's body in a crouched position, often used for gaining speed or preparing for a trick."
    ],
    "Skiing": [
        "An action which involves a person standing on two long, narrow pieces of equipment.",
        "An action which shows a person wearing thick, insulated clothing and goggles.",
        "An action which takes place on a snowy, often mountainous, landscape.",
        "An action which may show a person leaning forward with their knees slightly bent.",
        "An action which may involve a person holding and using two poles for balance and propulsion.",
        "An action which may show a person moving downhill at a fast pace.",
        "An action which may show a person making zigzag movements.",
        "An action which may show a person jumping or performing tricks in the air.",
        "An action which may show a person wearing a helmet for safety.",
        "An action which may show a person using a ski lift or cable car.",
        "An action which may show a person with a backpack or other gear attached.",
        "An action which may show a person in a crouched position to increase speed.",
        "An action which may show a person navigating around flags or markers.",
        "An action which may show a person skiing in a group or alone.",
        "An action which may show a person in a snowy environment with ski tracks visible in the snow."
    ],
    "Skijet": [
        "An action which involves a person riding on a small, motorized vehicle on a body of water.",
        "An action which shows a person wearing a life jacket and possibly a wetsuit.",
        "An action which includes a trail of water spray behind the vehicle.",
        "An action which may show the person standing or sitting on the vehicle, often with one hand on the handlebars.",
        "An action which may involve high speeds, indicated by the blurred background or water spray.",
        "An action which may show the person performing jumps or tricks on the water.",
        "An action which may include a body of water, such as a lake, river, or ocean, in the background.",
        "An action which may show the person wearing a helmet for safety.",
        "An action which may show the person leaning into turns, indicating movement and speed.",
        "An action which may show the person holding onto handlebars on the vehicle.",
        "An action which may show the vehicle, often brightly colored, with a distinctive, sleek shape designed for water travel.",
        "An action which may show the person's focused or excited facial expression, indicating the thrill of the activity."
    ],
    "Sky Diving": [
        "An action which involves a person appearing to be in mid-air, often with a backdrop of the sky or clouds.",
        "An action which shows a person wearing a helmet and goggles, often with a jumpsuit.",
        "An action which involves a parachute, either deployed or still packed on the person's back.",
        "An action which shows a person in a free-fall position, with arms and legs spread out.",
        "An action which may show a person performing acrobatic maneuvers in the air.",
        "An action which may include a view of the earth from a high altitude.",
        "An action which may show a person with a look of thrill or excitement on their face.",
        "An action which may show a person attached to another person, indicating a tandem skydive.",
        "An action which may show a person holding onto handles on their parachute harness.",
        "An action which may show a person with a small device on their wrist, indicating an altimeter used in skydiving."
    ],
    "Soccer Juggling": [
        "An action which involves a person using their feet, thighs, or head to keep a soccer ball off the ground.",
        "An action which shows a person in a stance that suggests they are balancing or controlling a ball.",
        "An action which displays a soccer ball in mid-air, close to the person's body.",
        "An action which shows a person looking intently at a soccer ball, indicating concentration.",
        "An action which may show a person using their chest to control a soccer ball.",
        "An action which might show a person in a dynamic, athletic pose, suggesting movement.",
        "An action which could involve a person in a setting like a soccer field, park, or other open space suitable for juggling a soccer ball.",
        "An action which may show a person wearing soccer gear, like cleats, shorts, and jerseys.",
        "An action which might show a person alone, as soccer juggling is typically a solo activity.",
        "An action which could show a person with their knees bent and body slightly leaning forward, a typical posture for soccer juggling."
    ],
    "Soccer Penalty": [
        "An action which involves a single player standing with a soccer ball at a marked spot.",
        "An action which shows a goalkeeper standing in front of a soccer goal, ready to block the ball.",
        "An action which depicts a player about to kick a stationary ball.",
        "An action which takes place within a clearly marked penalty area on a soccer field.",
        "An action which shows other players standing outside the penalty box, observing.",
        "An action which shows a referee observing the player with the ball and the goalkeeper.",
        "An action which shows a player in a poised position, ready to kick the ball.",
        "An action which shows a goalkeeper in a ready stance, often with arms outstretched.",
        "An action which shows a crowd or team members in the background, watching intently.",
        "An action which often shows a sense of tension or anticipation."
    ],
    "Still Rings": [
        "An action which involves a person suspended in the air.",
        "An action where the individual is holding onto two rings.",
        "An action where the person's body is held rigid and parallel to the ground.",
        "An action where the person's arms are fully extended and straight.",
        "An action where the person's legs are together and straight.",
        "An action where the person's body is in a controlled and balanced position.",
        "An action where the person is performing a gymnastic routine.",
        "An action where the person is using upper body strength to maintain a position.",
        "An action where the person is performing in a gymnastics apparatus.",
        "An action where the person's body is in a static hold position.",
        "An action where the person is demonstrating extreme physical strength and balance.",
        "An action where the person is performing a move that requires a high level of concentration.",
        "An action where the person is performing a move that requires a high level of flexibility."
    ],
    "Sumo Wrestling": [
        "An action which involves two individuals in a circular ring.",
        "An action which shows individuals wearing a type of loincloth known as a mawashi.",
        "An action which displays individuals with their bodies in a low stance, legs spread, and hands on or near the ground.",
        "An action which involves individuals attempting to push, slap, or throw each other out of the ring.",
        "An action which shows individuals with topknot hairstyles, a traditional style for sumo wrestlers.",
        "An action which involves individuals with a larger body size, as sumo wrestlers are typically quite heavy.",
        "An action which may show a referee in traditional Japanese clothing, known as a gyoji, in the ring.",
        "An action which may include ceremonial elements, such as salt throwing, which is a purification ritual in sumo wrestling.",
        "An action which may show individuals in a squatting position, preparing to charge at each other.",
        "An action which may show individuals in a forceful contact, with their bodies or hands."
    ],
    "Surfing": [
        "An action which involves a person standing on a board in the water.",
        "An action which shows a person riding on a wave.",
        "An action which depicts a person balancing on a board while moving with the water.",
        "An action which involves a person wearing a wetsuit in a water body.",
        "An action which shows a person using their arms to balance on a moving board.",
        "An action which involves a person leaning forward or backward on a board in the water.",
        "An action which shows a person paddling with their hands while lying on a board.",
        "An action which depicts a person performing tricks or stunts on a wave.",
        "An action which involves a person in the ocean or sea, with waves in the background.",
        "An action which shows a person carrying a surfboard on a beach.",
        "An action which involves a person with a leash attached from their ankle to a board.",
        "An action which depicts a person maneuvering a board on a wave crest.",
        "An action which shows a person in a crouched or kneeling position on a board in the water.",
        "An action which involves a person in a dynamic, athletic pose on a board in the water.",
        "An action which shows a person in the process of falling or wiping out from a board in the water."
    ],
    "Swing": [
        "An action which involves a person holding onto a rope or chain attached at a higher point.",
        "An action which shows a person suspended in the air, with legs either straight out or bent.",
        "An action which depicts a person in a seated position without any ground contact.",
        "An action which shows a person leaning back or forward, indicating motion.",
        "An action which involves a person with a joyful or excited facial expression, often associated with the thrill of swinging.",
        "An action which shows a person's hair or clothing being affected by wind or motion.",
        "An action which may include a background of a playground, park, or open space.",
        "An action which shows a person's body in a rhythmic back-and-forth motion.",
        "An action which may involve a person pushing another person on a swing.",
        "An action which shows a person's body at an angle, not upright, indicating the swing's movement."
    ],
    "Table Tennis Shot": [
        "An action which involves a person holding a small, round paddle.",
        "An action where the person is positioned near a table with a net in the middle.",
        "An action where a small, lightweight ball is in motion or in close proximity to the person.",
        "An action where the person's body is in a stance suggesting quick, reflexive movements.",
        "An action where the person's arm is extended or in motion, indicating a swing or hit.",
        "An action where the person's eyes are focused on a small object, indicating concentration on the ball.",
        "An action where the person is often in a bent posture, ready to move quickly in any direction.",
        "An action where the person may be wearing casual or sporty attire, suitable for a game.",
        "An action where the person's other hand may be free or used for balance.",
        "An action where the background may show an indoor setting, often a sports hall or a recreational room."
    ],
    "Tai Chi": [
        "An action which involves slow, flowing body movements.",
        "An action where the person is maintaining a relaxed posture with a straight back.",
        "An action where the person's movements are coordinated with deep breathing.",
        "An action where the person's hands are open and fingers are extended, often in a 'pushing' or 'holding' position.",
        "An action where the person's feet are flat on the ground, often shoulder-width apart.",
        "An action where the person's knees are slightly bent, as if sitting on an invisible stool.",
        "An action where the person's gaze is focused, often looking straight ahead or at their hands.",
        "An action where the person's movements are continuous, without any abrupt stops.",
        "An action where the person's body is balanced, often shifting weight from one leg to the other.",
        "An action where the person's movements are graceful, as if performing a dance.",
        "An action where the person's body is relaxed, without any visible tension or strain.",
        "An action where the person's movements are performed in a calm and serene environment, often outdoors.",
        "An action where the person's movements are performed in solitude, without any physical contact with others.",
        "An action where the person's movements are performed with a sense of mindfulness and concentration."
    ],
    "Tennis Swing": [
        "An action which involves a person holding a racket.",
        "An action where the person's body is positioned as if they are about to hit or have just hit a ball.",
        "An action where the person is typically wearing sportswear suitable for tennis.",
        "An action where the person is often standing on a tennis court.",
        "An action where the person's arm is extended, either forward or to the side, in a swinging motion.",
        "An action where the person's feet are positioned for stability and quick movement, often one foot slightly in front of the other.",
        "An action where the person's eyes are focused on an object, typically a tennis ball.",
        "An action where the person's body shows signs of dynamic movement, such as hair or clothing in motion.",
        "An action where the person's other hand may be outstretched for balance.",
        "An action where the person's posture is typically bent at the waist, ready to move quickly.",
        "An action where the person's grip on the racket is firm and ready to strike.",
        "An action where the person may be captured in the photo with a tennis ball in the frame, either in contact with the racket or nearby in the air."
    ],
    "Throw Discus": [
        "An action which involves a person standing in a circular area, typically made of concrete.",
        "An action where the person's body is twisted, indicating a rotational movement.",
        "An action where the person is holding a heavy, circular object in one hand.",
        "An action where the person's arm is extended back, preparing to launch the object.",
        "An action where the person's weight is shifted onto the back foot, ready to propel forward.",
        "An action where the person's eyes are focused on a distant point, indicating the direction of the throw.",
        "An action where the person's body is tensed, showing the effort required to throw the object.",
        "An action where the person is wearing athletic clothing, often specific to track and field events.",
        "An action where the person is isolated, with no other competitors in the immediate vicinity.",
        "An action where the person's other arm is extended out for balance.",
        "An action where the person is in an outdoor setting, typically a field or stadium.",
        "An action where the person's feet are positioned in a way that suggests a spinning or turning motion."
    ],
    "Trampoline Jumping": [
        "An action which involves a person being airborne, often with legs and arms extended or tucked.",
        "An action which shows a person performing flips or twists in mid-air.",
        "An action which takes place on a trampoline, a device consisting of a piece of taut, strong fabric stretched between a steel frame using many coiled springs.",
        "An action which shows a person bouncing up and down.",
        "An action which may involve a person performing gymnastic or acrobatic maneuvers.",
        "An action which may show a safety net or padding around the edges of the activity area.",
        "An action which may show a person in a pose that suggests they are in the middle of a jump or fall.",
        "An action which may show a person with a facial expression of concentration, excitement, or joy.",
        "An action which may show a person wearing athletic clothing suitable for jumping and flipping.",
        "An action which may take place in both indoor and outdoor settings, often in a sports facility or backyard."
    ],
    "Typing": [
        "An action which involves a person's fingers positioned on a keyboard.",
        "An action which shows a person's hands hovering over a set of keys.",
        "An action which includes a computer or typewriter in the frame.",
        "An action which displays a person looking at a screen or paper while their hands are busy.",
        "An action which involves a person sitting in front of a desk or table.",
        "An action which shows a person's fingers pressing down on keys.",
        "An action which includes a person's posture being upright or slightly leaning forward.",
        "An action which may show a person's fingers moving rapidly over a set of keys.",
        "An action which might include a person wearing headphones, suggesting they are transcribing or listening while they type.",
        "An action which could show a person's fingers in a specific formation, such as the \"home row\" position on a keyboard.",
        "An action which may show a person's eyes focused on a screen or document, indicating they are reading as they type.",
        "An action which might show a person's wrists resting on a desk or wrist rest, suggesting they are typing for an extended period.",
        "An action which could include a person's fingers stretched out to reach different keys on a keyboard.",
        "An action which may show a person's fingers in motion, suggesting they are typing quickly.",
        "An action which might show a person's hands positioned symmetrically on both sides of a keyboard.",
        "An action which could show a person's fingers tapping on keys in a rhythmic pattern, indicating they are typing."
    ],
    "Uneven Bars": [
        "An action which involves a person swinging between two bars of different heights.",
        "An action which shows a person performing gymnastic maneuvers on two parallel bars.",
        "An action which involves a person maintaining balance and control while moving between two bars.",
        "An action which shows a person executing flips or twists while transitioning between two bars.",
        "An action which involves a person using their upper body strength to perform movements on two bars.",
        "An action which shows a person gripping onto bars while their body is suspended in the air.",
        "An action which involves a person performing a dismount from two bars.",
        "An action which shows a person wearing gymnastic attire while interacting with two bars.",
        "An action which involves a person executing a handstand on one of two bars.",
        "An action which shows a person in a gymnastics arena with mats on the floor for safety."
    ],
    "Volleyball Spiking": [
        "An action which involves a person jumping high in the air with one arm raised above their head.",
        "An action which shows a person's hand in a position as if they are about to hit a ball.",
        "An action which takes place on a sandy beach or indoor court, often with a net visible in the background.",
        "An action which involves a person's body being arched backwards, preparing to strike.",
        "An action which shows a person's eyes focused intently on an object above them.",
        "An action which often involves other players in the background, either watching or preparing to react.",
        "An action which shows a person wearing sportswear suitable for beach or indoor sports, such as shorts, tank tops, or specialized volleyball uniforms.",
        "An action which may show a volleyball in the frame, often in the air near the person.",
        "An action which involves a person's feet off the ground, indicating a jump.",
        "An action which shows a person's other arm extended for balance while they are in the air."
    ],
    "Walking With Dog": [
        "An action which involves a person and a dog in the same frame.",
        "An action where the person and the dog are both in motion.",
        "An action where the person is holding a leash that is attached to the dog.",
        "An action where the person's and the dog's body language suggests forward movement.",
        "An action where the person is dressed in casual or outdoor attire, suitable for a walk.",
        "An action where the surroundings suggest a typical walking area, such as a park, a street, or a trail.",
        "An action where the person's gaze is directed forward, indicating they are leading the way.",
        "An action where the dog's gaze is also directed forward, indicating they are following the person.",
        "An action where the person's other hand may be carrying items related to dog walking, such as a bag for dog waste or a water bottle.",
        "An action where the person's posture is upright, indicating they are walking and not sitting or standing still.",
        "An action where the dog's tail is up and wagging, indicating they are active and engaged."
    ],
    "Wall Pushups": [
        "An action which involves a person standing at an arm's length from a wall.",
        "An action where the person's palms are flat against the wall at shoulder height.",
        "An action where the person's feet are firmly planted on the ground, a few feet away from the wall.",
        "An action where the person's body is leaning towards the wall.",
        "An action where the person's arms are bent at the elbows, similar to a push-up position.",
        "An action where the person's body is in a straight line from head to heels.",
        "An action where the person's head is facing the wall, not looking at the camera.",
        "An action where the person's body is angled towards the wall, not parallel to it.",
        "An action where the person's shoulders, elbows, and wrists are in alignment when viewed from the side.",
        "An action where the person's body is not touching the wall, except for the palms of their hands."
    ],
    "Writing On Board": [
        "An action which involves a person standing in front of a large, flat surface, typically vertical.",
        "An action which shows a person holding a marker, chalk, or any other writing instrument in their hand.",
        "An action which displays a person's arm in a motion that suggests they are writing or drawing.",
        "An action which includes visible text or drawings appearing on the surface in front of the person.",
        "An action which often takes place in a classroom, office, or meeting room setting.",
        "An action which may show the person looking back and forth between the board and a reference material or audience.",
        "An action which may involve the person pointing at the board, indicating something they have written or drawn.",
        "An action which may show the person erasing and rewriting on the board.",
        "An action which may include other people watching or taking notes.",
        "An action which may show the person using different colors or tools to emphasize certain points on the board."
    ],
    "Yo Yo": [
        "An action which involves a person holding a small, round object attached to a string.",
        "An action where the person's hand is in a fist-like position, as if gripping something.",
        "An action where a string is visibly extended from the person's hand towards the ground.",
        "An action where the small, round object is either in mid-air or close to the ground, indicating motion.",
        "An action where the person's arm is extended or slightly bent, suggesting a throwing or pulling motion.",
        "An action where the person's focus is directed towards the small, round object.",
        "An action where the person is standing alone, as yo-yoing is typically a solo activity.",
        "An action where the person's body posture suggests a rhythmic or repetitive motion, characteristic of yo-yoing.",
        "An action where the person is likely in a casual or relaxed environment, as yo-yoing is often a leisure activity.",
        "An action where the person may be demonstrating a trick or specific maneuver with the yo-yo, such as 'walking the dog' or 'around the world'."
    ],
    "Hand Stand Pushups": [
        "An action which involves a person being upside down, with their hands on the ground and feet in the air.",
        "An action where the person's body is vertically aligned, supported by their hands.",
        "An action where the person's head is positioned close to the ground, indicating a downward movement.",
        "An action where the arms of the person are bent at the elbows, suggesting a pushing motion.",
        "An action where the person's legs are straight and together, pointing upwards.",
        "An action where the person's back is straight, indicating a controlled movement.",
        "An action where the person's body weight is supported by their hands and arms.",
        "An action where the person's shoulders are directly above their hands, indicating balance.",
        "An action where the person's face is directed towards the ground.",
        "An action where the person's body, from hands to feet, forms a straight line or a slight curve.",
        "An action where the person's feet are not in contact with any surface, indicating suspension in the air.",
        "An action where the person's body is not in contact with any wall or support, indicating free-standing balance."
    ]
}