{
    "banded": [
        "A texture which displays a pattern of alternating light and dark bands.",
        "A texture which has layers that are parallel and regular.",
        "A texture which shows a clear repetition of lines or stripes.",
        "A texture which has a rhythmic or systematic arrangement of different components.",
        "A texture which has a distinct contrast between the different bands.",
        "A texture which has bands that can be of varying widths.",
        "A texture which may show bands of different colors or shades.",
        "A texture which may have bands that are straight, wavy, or curved.",
        "A texture which may have bands that are continuous or discontinuous.",
        "A texture which may show bands that are uniform or irregular in thickness.",
        "A texture which may have bands that are smooth or rough in texture.",
        "A texture which may show bands that are opaque, translucent, or transparent.",
        "A texture which may have bands that are glossy, matte, or somewhere in between.",
        "A texture which may show bands that are hard, soft, or somewhere in between.",
        "A texture which may have bands that are dense or sparse.",
        "A texture which may show bands that are thick or thin.",
        "A texture which may have bands that are coarse or fine.",
        "A texture which may show bands that are tight or loose.",
        "A texture which may have bands that are rigid or flexible.",
        "A texture which may show bands that are solid or hollow."
    ],
    "blotchy": [
        "A texture which has irregular patches or spots of different colors or shades.",
        "A texture which displays a lack of uniformity or consistency in its pattern.",
        "A texture which has areas of varying intensity or saturation.",
        "A texture which has a mottled or speckled appearance.",
        "A texture which has a non-uniform distribution of elements or features.",
        "A texture which has a seemingly random arrangement of different shapes and sizes.",
        "A texture which has a mix of smooth and rough areas.",
        "A texture which has a combination of light and dark areas.",
        "A texture which has a seemingly chaotic or disordered pattern.",
        "A texture which has a mix of different colors or shades in no particular order or arrangement."
    ],
    "braided": [
        "A texture which displays a pattern of interwoven strands or threads.",
        "A texture which shows a complex structure of three or more segments intertwined in a diagonal manner.",
        "A texture which exhibits a series of overlapping loops, often creating a raised surface.",
        "A texture which has a repetitive pattern that resembles a plait or a twist.",
        "A texture which shows a crisscross arrangement, often seen in ropes, hair, or fabrics.",
        "A texture which has a pattern that alternates between over and under in a consistent manner.",
        "A texture which displays a noticeable contrast between the raised braided areas and the flat background.",
        "A texture which shows a regular and symmetrical pattern, indicative of careful crafting.",
        "A texture which may appear to have a zigzag pattern when viewed from certain angles.",
        "A texture which may have a slightly rough feel due to the overlapping of materials."
    ],
    "bubbly": [
        "A texture which features a series of small, rounded protrusions or indentations.",
        "A texture which has a pattern of repeated, uniform, and often circular shapes.",
        "A texture which appears to have a series of small, inflated or filled areas.",
        "A texture which has a surface that is not smooth, but rather filled with numerous small bumps or cavities.",
        "A texture which has a surface that resembles the appearance of foam or froth.",
        "A texture which has a surface that may resemble the appearance of boiling liquid.",
        "A texture which has a surface that may look similar to a sponge or pumice.",
        "A texture which has a surface that may resemble the appearance of certain types of candy, like Aero chocolate or honeycomb toffee.",
        "A texture which has a surface that may look similar to certain types of coral or sea sponges.",
        "A texture which has a surface that may resemble the appearance of certain types of bread, like ciabatta or sourdough."
    ],
    "bumpy": [
        "A texture which has a series of raised areas or protrusions.",
        "A texture which shows irregularities or unevenness on the surface.",
        "A texture which has a pattern of high and low points.",
        "A texture which appears rough and not smooth to the touch.",
        "A texture which has a series of small, rounded or pointed elevations.",
        "A texture which shows a pattern of ridges or indentations.",
        "A texture which has a non-uniform pattern, with variations in size and shape of the bumps.",
        "A texture which appears to have a 3D effect due to the shadows created by the bumps.",
        "A texture which has a tactile quality, suggesting it would feel uneven or irregular when touched.",
        "A texture which shows a lack of flatness or smoothness, with a series of peaks and valleys.",
        "A texture which has a pattern that is not flat or level, but rather has a series of rises and falls.",
        "A texture which appears to have a surface that is not smooth or flat, but rather has a series of protrusions or indentations."
    ],
    "chequered": [
        "A texture which consists of squares or rectangles in alternating colors.",
        "A texture which displays a pattern that repeats at regular intervals.",
        "A texture which has a clear grid-like structure.",
        "A texture which has a consistent pattern of light and dark squares or rectangles.",
        "A texture which resembles a chess or checkerboard.",
        "A texture which has a two-dimensional geometric pattern.",
        "A texture which has equal-sized squares or rectangles throughout.",
        "A texture which has a high contrast between adjacent squares or rectangles.",
        "A texture which has a pattern that is symmetrical both horizontally and vertically.",
        "A texture which has a pattern that does not change or distort across the surface."
    ],
    "cobwebbed": [
        "A texture which features thin, irregular, interconnected lines or strands.",
        "A texture which appears delicate and fragile.",
        "A texture which has a random, non-uniform pattern.",
        "A texture which may have a dusty or aged appearance.",
        "A texture which has a high level of intricacy and complexity.",
        "A texture which may have a slightly shiny or glistening quality due to the nature of spider silk.",
        "A texture which may have small, trapped particles or insects visible.",
        "A texture which may appear denser in some areas and sparse in others.",
        "A texture which may have a 3D aspect, with strands layered over each other.",
        "A texture which may have a radial or circular pattern, similar to a spider's web."
    ],
    "cracked": [
        "A texture which has irregular lines or patterns that resemble breaks or fractures.",
        "A texture which shows a network of lines or cracks spreading out in various directions.",
        "A texture which has a rough and uneven surface due to the presence of cracks.",
        "A texture which displays a pattern of lines that do not follow a specific direction or pattern.",
        "A texture which has gaps or spaces between the lines, indicating broken or separated areas.",
        "A texture which shows signs of distress or damage, such as chipping or flaking around the cracks.",
        "A texture which has a combination of both large, noticeable cracks and smaller, finer lines.",
        "A texture which may have different shades or colors along the cracks, indicating depth or shadow.",
        "A texture which may show signs of aging or weathering, often associated with cracks.",
        "A texture which may have a three-dimensional appearance due to the depth and shadowing of the cracks."
    ],
    "crosshatched": [
        "A texture which features a series of intersecting lines at an angle to each other.",
        "A texture which displays a pattern of parallel lines crossing another set of parallel lines.",
        "A texture which has a grid-like appearance due to the crossing lines.",
        "A texture which often resembles woven fabric due to the crisscross pattern.",
        "A texture which can appear to have depth or three-dimensionality due to the overlapping lines.",
        "A texture which may have varying line thickness and spacing, creating a sense of density or sparsity.",
        "A texture which can be regular with evenly spaced lines, or irregular with varying line angles and distances.",
        "A texture which may show lines crossing at right angles, or at other angles for a more complex pattern.",
        "A texture which can be created with different mediums, resulting in different visual effects, such as pencil for a softer look or ink for a more bold appearance.",
        "A texture which, despite its complexity, typically maintains a consistent pattern throughout."
    ],
    "crystalline": [
        "A texture which displays a clear, repeating geometric pattern.",
        "A texture which has a shiny or sparkling appearance.",
        "A texture which shows a regular arrangement of its components.",
        "A texture which has sharp, well-defined edges and angles.",
        "A texture which exhibits a high degree of symmetry.",
        "A texture which has a smooth and flat surface on some sides.",
        "A texture which has a three-dimensional, lattice-like structure.",
        "A texture which refracts light in a unique or distinctive way.",
        "A texture which has a rigid and solid structure.",
        "A texture which has a uniform appearance across its surface.",
        "A texture which has a translucent or transparent quality.",
        "A texture which has a cool or cold feel to the touch.",
        "A texture which has a hardness or resistance to scratching.",
        "A texture which has a brittle nature, breaking with a conchoidal fracture.",
        "A texture which has a granular appearance under magnification."
    ],
    "dotted": [
        "A texture which features a pattern of small, round spots.",
        "A texture which has a regular or irregular arrangement of dots.",
        "A texture which displays a contrast between the dots and the background.",
        "A texture which has a uniform or varying size of dots.",
        "A texture which shows a clear separation between each dot.",
        "A texture which may have dots of different colors.",
        "A texture which may have dots that are filled or hollow.",
        "A texture which may have dots that are evenly or randomly spaced.",
        "A texture which may have dots that are geometrically perfect or imperfect.",
        "A texture which may have dots that are raised or flat."
    ],
    "fibrous": [
        "A texture which displays a series of long, thin, and thread-like structures.",
        "A texture which appears to have a woven or interlaced pattern.",
        "A texture which shows a high degree of linear alignment.",
        "A texture which has a rough and uneven surface due to the presence of fibers.",
        "A texture which exhibits a certain degree of flexibility and elasticity.",
        "A texture which has a soft and fluffy appearance.",
        "A texture which shows a visible grain or strand-like pattern.",
        "A texture which has a matte or non-reflective surface.",
        "A texture which has a natural or organic look due to the presence of fibers.",
        "A texture which may have a variety of colors, but the color is consistent within individual fibers.",
        "A texture which may show signs of fraying or loose ends.",
        "A texture which may have a layered or stacked appearance due to the arrangement of fibers."
    ],
    "flecked": [
        "A texture which has small patches or dots scattered randomly across the surface.",
        "A texture which displays a pattern of tiny specks or flakes.",
        "A texture which shows a mix of different colors or shades in small, distinct spots.",
        "A texture which has a speckled appearance, similar to a bird's egg.",
        "A texture which has a non-uniform distribution of small particles or elements.",
        "A texture which has a granular or particulate appearance due to the presence of small flecks.",
        "A texture which has a mottled or variegated appearance due to the presence of small, scattered spots or streaks.",
        "A texture which has a heterogeneous appearance due to the presence of different materials or colors in small, scattered patches.",
        "A texture which has a rough or irregular surface due to the presence of small, scattered particles or elements.",
        "A texture which has a speckled or dappled appearance, similar to the skin of certain fruits or the surface of certain stones."
    ],
    "freckled": [
        "A texture which has small, randomly scattered spots or dots.",
        "A texture which displays a variety of colors or shades within the spots.",
        "A texture which has irregularities in the distribution of the spots.",
        "A texture which shows spots that vary in size.",
        "A texture which has spots that are not uniform in shape.",
        "A texture which has a clear contrast between the spots and the background.",
        "A texture which shows spots that may merge or overlap with each other.",
        "A texture which has spots that are not necessarily round.",
        "A texture which has a non-patterned distribution of spots.",
        "A texture which has spots that are not equally spaced."
    ],
    "frilly": [
        "A texture which has a series of ruffles or decorative edges.",
        "A texture which appears to have multiple layers or tiers.",
        "A texture which has a light, airy, and voluminous appearance.",
        "A texture which has a pattern of pleats or gathers.",
        "A texture which has a soft and fluffy look.",
        "A texture which has a complex surface due to multiple folds or waves.",
        "A texture which has an irregular, yet patterned surface.",
        "A texture which has a resemblance to certain types of fabric like lace or tulle.",
        "A texture which has a playful and whimsical aesthetic.",
        "A texture which has a sense of movement due to its undulating surface."
    ],
    "gauzy": [
        "A texture which appears lightweight and thin.",
        "A texture which has a loose or open weave.",
        "A texture which is semi-transparent or translucent.",
        "A texture which has a slightly rough or grainy feel.",
        "A texture which allows light to pass through it.",
        "A texture which may show visible threads or fibers.",
        "A texture which may have a slightly crinkled or wrinkled appearance.",
        "A texture which may have a delicate or fragile look.",
        "A texture which may have a soft or airy feel to it.",
        "A texture which may have a slightly uneven or irregular surface due to the weave."
    ],
    "grid": [
        "A texture which has a series of intersecting lines forming squares or rectangles.",
        "A texture which displays a regular pattern of horizontal and vertical lines.",
        "A texture which has equal spacing between the lines in both directions.",
        "A texture which has a consistent pattern throughout the entire image.",
        "A texture which has lines that intersect at 90-degree angles.",
        "A texture which may appear as a wireframe or lattice in three-dimensional images.",
        "A texture which may have a raised or indented pattern, depending on the light and shadow in the image.",
        "A texture which may appear in a variety of scales, from fine to coarse, depending on the distance between the lines.",
        "A texture which may have lines of the same or varying thickness.",
        "A texture which may appear in any color or combination of colors, but the grid pattern remains consistent.",
        "A texture which may have a glossy or matte finish, depending on the material and lighting in the image.",
        "A texture which may have a smooth or rough surface, but the grid pattern is still discernible.",
        "A texture which may show signs of wear or distress, but the grid pattern remains intact.",
        "A texture which may have additional patterns or textures within the grid squares, but the overall grid pattern is dominant.",
        "A texture which may have variations in the grid pattern due to perspective or curvature of the surface, but the basic grid structure is still recognizable."
    ],
    "grooved": [
        "A texture which has a pattern of parallel or crisscross lines.",
        "A texture which has a series of ridges or indented lines.",
        "A texture which has a repetitive pattern of raised and lowered areas.",
        "A texture which has a noticeable contrast between the raised and indented areas.",
        "A texture which has a linear pattern that can be felt or seen.",
        "A texture which has a pattern that is consistent and uniform.",
        "A texture which has a pattern that can be visually and physically perceived as grooves.",
        "A texture which has a pattern that may appear similar to the grain of wood or the grooves in a vinyl record.",
        "A texture which has a pattern that may create a sense of direction or movement.",
        "A texture which has a pattern that can create a tactile sensation when touched."
    ],
    "honeycombed": [
        "A texture which features a pattern of hexagonal cells.",
        "A texture which has a repetitive, geometric design.",
        "A texture which has a three-dimensional aspect, with raised and recessed areas.",
        "A texture which has a uniform pattern throughout.",
        "A texture which has cells that are similar in size and shape.",
        "A texture which has a structure similar to that of a beehive.",
        "A texture which has a pattern that interlocks and leaves no gaps.",
        "A texture which has a natural, organic feel.",
        "A texture which has a pattern that is often associated with strength and efficiency in nature.",
        "A texture which has a pattern that can be seen in various scales, from microscopic to architectural."
    ],
    "interlaced": [
        "A texture which displays a crisscross pattern.",
        "A texture which shows a woven or braided appearance.",
        "A texture which has a pattern of alternating lines or strands.",
        "A texture which exhibits a complex arrangement of threads or fibers.",
        "A texture which has a pattern that appears to go over and under other parts of the pattern.",
        "A texture which shows a clear pattern of interconnection or interweaving.",
        "A texture which has a pattern that appears to be made up of multiple layers.",
        "A texture which has a pattern that seems to be made up of intertwined or interlocked elements.",
        "A texture which has a pattern that appears to be made up of a series of loops or knots.",
        "A texture which shows a pattern that seems to be made up of a series of twists or turns.",
        "A texture which has a pattern that appears to be made up of a series of crossings or intersections.",
        "A texture which shows a pattern that seems to be made up of a series of interlaced or interlocked elements.",
        "A texture which has a pattern that appears to be made up of a series of interwoven or interlaced elements.",
        "A texture which shows a pattern that seems to be made up of a series of interlinked or interconnected elements.",
        "A texture which has a pattern that appears to be made up of a series of intermeshed or intermingled elements."
    ],
    "knitted": [
        "A texture which displays a series of interconnected loops.",
        "A texture which shows a pattern of interlocking stitches.",
        "A texture which has a flexible and stretchable characteristic.",
        "A texture which may exhibit a ribbed or cable pattern.",
        "A texture which can have visible rows and columns when stretched.",
        "A texture which may appear fuzzy or fluffy due to the type of yarn used.",
        "A texture which may have a distinct front and back side, with the front displaying the design and the back showing a series of horizontal lines.",
        "A texture which may show a variety of patterns such as stockinette, garter, or seed stitch.",
        "A texture which may have a three-dimensional appearance due to certain knitting techniques.",
        "A texture which may have a warm and cozy feel to it.",
        "A texture which may have a soft or rough feel depending on the type of yarn used.",
        "A texture which may have a thick or thin appearance based on the weight of the yarn used.",
        "A texture which may have a handmade or artisanal look.",
        "A texture which may show irregularities or imperfections if hand-knitted.",
        "A texture which may have a uniform pattern if machine-knitted."
    ],
    "lacelike": [
        "A texture which features intricate, interconnected patterns similar to woven fabric.",
        "A texture which has a delicate and ornate design, often with repeated motifs.",
        "A texture which has a series of holes or gaps, creating a net-like appearance.",
        "A texture which has a complex, detailed structure that can be both symmetrical or asymmetrical.",
        "A texture which has a combination of thin and thick lines, creating a sense of depth and dimension.",
        "A texture which has a light and airy feel due to the presence of open spaces.",
        "A texture which may resemble patterns found in nature, such as leaves, flowers, or snowflakes.",
        "A texture which may have a vintage or antique appearance, reminiscent of old lacework.",
        "A texture which may appear fragile or delicate due to the intricacy of the design.",
        "A texture which may have a three-dimensional quality, depending on the light and shadow effects."
    ],
    "lined": [
        "A texture which has a series of parallel lines.",
        "A texture which exhibits a pattern of repeated straight or curved lines.",
        "A texture which shows a clear directionality due to the alignment of lines.",
        "A texture which may have lines of varying thicknesses.",
        "A texture which may have lines of different colors, creating a contrast.",
        "A texture which may have lines that are evenly spaced or irregularly spaced.",
        "A texture which may have lines that are continuous or broken.",
        "A texture which may have lines that intersect, forming a grid or other geometric patterns.",
        "A texture which may have lines that are smooth or rough, depending on the material.",
        "A texture which may have lines that are raised or indented, creating a tactile dimension.",
        "A texture which may have lines that are straight, wavy, zigzag, or in other forms.",
        "A texture which may have lines that are glossy or matte, depending on the light reflection.",
        "A texture which may have lines that create a sense of movement or rhythm.",
        "A texture which may have lines that are uniform or random in their arrangement.",
        "A texture which may have lines that are fine or coarse, depending on their width and spacing."
    ],
    "marbled": [
        "A texture which displays a pattern of irregular lines and streaks.",
        "A texture which has a mix of two or more colors swirled together.",
        "A texture which resembles the natural veining seen in marble stone.",
        "A texture which has a smooth and polished surface.",
        "A texture which shows a contrast between light and dark areas.",
        "A texture which has a non-uniform, random pattern.",
        "A texture which may have a glossy or matte finish.",
        "A texture which can mimic the appearance of natural elements.",
        "A texture which can have a variety of color combinations.",
        "A texture which can be both dense and sparse in its pattern distribution.",
        "A texture which can be found in both natural and man-made materials.",
        "A texture which can be both visually and physically tactile.",
        "A texture which can have a three-dimensional appearance.",
        "A texture which can have a fluid or wavy pattern.",
        "A texture which can have a fine or coarse granularity."
    ],
    "matted": [
        "A texture which appears tangled or knotted.",
        "A texture which has a flat, dull appearance.",
        "A texture which lacks shine or glossiness.",
        "A texture which has a dense, compact structure.",
        "A texture which seems to have fibers or threads interwoven irregularly.",
        "A texture which appears rough or coarse to the touch.",
        "A texture which lacks smoothness or uniformity.",
        "A texture which has a non-reflective surface.",
        "A texture which seems to absorb light rather than reflect it.",
        "A texture which appears to have a layered or stacked effect.",
        "A texture which seems to have a lack of distinct pattern or directionality.",
        "A texture which appears to have a felt-like quality."
    ],
    "meshed": [
        "A texture which has a pattern of interconnected lines or strands.",
        "A texture which appears to have small, open spaces between the threads or wires.",
        "A texture which has a grid-like or net-like structure.",
        "A texture which has a consistent, repeating pattern throughout.",
        "A texture which has a woven or knitted appearance.",
        "A texture which may have a rough or slightly raised surface due to the interlacing of the strands.",
        "A texture which may appear semi-transparent or translucent due to the open spaces.",
        "A texture which may have a metallic or plastic appearance, depending on the material of the strands.",
        "A texture which may have a flexible or rigid structure, depending on the tightness of the weave.",
        "A texture which may have a glossy or matte finish, depending on the material of the strands."
    ],
    "paisley": [
        "A texture which features intricate, curved teardrop or kidney shapes.",
        "A texture which often includes a combination of floral and abstract patterns.",
        "A texture which has a detailed design that is typically filled with colorful patterns.",
        "A texture which has a Persian origin and is often associated with bohemian style.",
        "A texture which often has a swirling and feather-like pattern.",
        "A texture which is symmetrical and repetitive.",
        "A texture which often includes smaller patterns within the larger teardrop design.",
        "A texture which is often used in fabrics, wallpapers, and ceramics.",
        "A texture which may include additional elements like flowers, leaves, or intricate vines.",
        "A texture which is often rich in color and design, making it visually complex.",
        "A texture which may have a hand-drawn or painted appearance.",
        "A texture which can be both large and small scale, depending on the design.",
        "A texture which often has a vintage or retro feel due to its historical usage.",
        "A texture which can be both bold and subtle, depending on the color palette used.",
        "A texture which often has a sense of movement due to the swirling nature of the design."
    ],
    "perforated": [
        "A texture which has a series of holes or openings in a regular or irregular pattern.",
        "A texture which shows a surface that is not completely solid or smooth, but has visible punctures.",
        "A texture which displays a pattern of voids or gaps, often in a grid or array.",
        "A texture which exhibits a surface where light can pass through certain areas due to openings.",
        "A texture which has a surface that may allow air or liquids to pass through due to its perforations.",
        "A texture which may have a tactile feel of roughness or unevenness due to the presence of holes.",
        "A texture which may show a contrast between the material of the surface and the empty spaces created by the perforations.",
        "A texture which may have a pattern of raised edges around the perforations, depending on the material and the method used to create the holes.",
        "A texture which may show signs of deformation or stress around the perforations, especially if the material is soft or pliable.",
        "A texture which may have a varying degree of transparency or translucency, depending on the size and density of the perforations."
    ],
    "pitted": [
        "A texture which has small, shallow or deep holes scattered across its surface.",
        "A texture which appears uneven or irregular due to the presence of indentations.",
        "A texture which has a rough and bumpy feel due to the presence of pits.",
        "A texture which has a non-uniform pattern with variations in depth and size of the pits.",
        "A texture which may resemble the surface of a sponge, golf ball, or certain types of fruit like an orange or lemon.",
        "A texture which may have a porous appearance due to the presence of multiple pits.",
        "A texture which may appear weathered or eroded, similar to certain types of rock or wood.",
        "A texture which may have a speckled appearance when viewed from a distance due to the distribution of pits.",
        "A texture which may have a matte finish, as the pits can diffuse light rather than reflecting it directly.",
        "A texture which may have a tactile quality, providing a distinct feel under the fingertips due to the pits."
    ],
    "pleated": [
        "A texture which displays a series of folds, often in a regular pattern.",
        "A texture which has a zigzag or accordion-like appearance.",
        "A texture which shows a repeated pattern of ridges and valleys.",
        "A texture which has a three-dimensional quality due to the depth created by the folds.",
        "A texture which may appear to have lines or stripes due to the shadows created by the folds.",
        "A texture which may have a rhythmic or repetitive visual quality.",
        "A texture which may appear more voluminous or full due to the pleating.",
        "A texture which may have a tactile quality, feeling ridged or bumpy to the touch.",
        "A texture which may appear to have a directional flow, with the pleats often running vertically or horizontally.",
        "A texture which may appear more complex and detailed due to the intricacy of the pleats."
    ],
    "polka-dotted": [
        "A texture which features a pattern of small, round dots evenly distributed across the surface.",
        "A texture which has a consistent, repeating pattern of dots.",
        "A texture which has dots that are all of the same size and shape.",
        "A texture which has a clear contrast between the color of the dots and the background.",
        "A texture which has a regular spacing between each dot.",
        "A texture which has a symmetrical pattern.",
        "A texture which has a two-dimensional, flat pattern.",
        "A texture which has a playful, whimsical, or retro feel due to the dot pattern.",
        "A texture which has a uniform pattern, with no variation in the size or placement of the dots.",
        "A texture which has a clean, simple design with no additional embellishments or patterns."
    ],
    "porous": [
        "A texture which has a surface filled with many small holes or pores.",
        "A texture which appears spongy or foam-like due to the presence of numerous tiny openings.",
        "A texture which has a rough and uneven surface due to the presence of voids or gaps.",
        "A texture which shows a network of interconnected cavities or channels.",
        "A texture which may absorb or release fluids or gases due to its permeable nature.",
        "A texture which may appear lighter in weight due to the presence of air-filled spaces.",
        "A texture which may have a rough or gritty feel when touched due to the irregular surface.",
        "A texture which may have a variable color or shade due to the shadows created by the pores.",
        "A texture which may show a pattern of tiny dots or circles representing the openings of the pores.",
        "A texture which may have a variable depth or thickness due to the presence of pores of different sizes."
    ],
    "potholed": [
        "A texture which has irregular, round or oval-shaped indentations.",
        "A texture which displays a rough and uneven surface.",
        "A texture which shows varying depths and sizes of indentations.",
        "A texture which has a pattern of repeated depressions or cavities.",
        "A texture which may have loose fragments or debris within the indentations.",
        "A texture which may show signs of wear and tear or weathering.",
        "A texture which may have cracks or fissures around the indentations.",
        "A texture which may have a darker color inside the indentations due to shadow or accumulated dirt.",
        "A texture which may appear rugged or bumpy to the touch.",
        "A texture which may have a non-uniform pattern due to the random distribution of potholes."
    ],
    "scaly": [
        "A texture which consists of small, hard, flat or slightly raised areas overlapping each other.",
        "A texture which resembles the skin of reptiles, especially snakes.",
        "A texture which has a pattern of repeating, often diamond-shaped or triangular, segments.",
        "A texture which has a rough, irregular surface, not smooth or uniform.",
        "A texture which may have a shiny or glossy appearance due to the overlapping segments.",
        "A texture which may have a dry or coarse feel to the touch.",
        "A texture which may have a layered or tiered appearance, with each layer slightly offset from the one below it.",
        "A texture which may have a gradient of color or tone, with each scale potentially a slightly different shade.",
        "A texture which may have a three-dimensional quality, with each scale casting a small shadow.",
        "A texture which may have a protective or armor-like appearance, suggesting durability or toughness."
    ],
    "smeared": [
        "A texture which appears to have been spread or dragged across a surface.",
        "A texture which lacks a clear, defined pattern or structure.",
        "A texture which exhibits irregularity and randomness in its pattern.",
        "A texture which may show a gradient of color or tone, as if mixed or blended.",
        "A texture which may have areas of varying thickness or density.",
        "A texture which may show streaks or lines, indicating a direction of movement.",
        "A texture which may have a rough or uneven surface due to the smearing process.",
        "A texture which may show signs of layering or overlapping.",
        "A texture which may have areas of transparency or translucency, depending on the material smeared.",
        "A texture which may show signs of pooling or accumulation in certain areas.",
        "A texture which may have a glossy or shiny appearance if a wet or viscous material was smeared.",
        "A texture which may show signs of drying or hardening, if the smeared material has begun to set or cure."
    ],
    "spiralled": [
        "A texture which displays a continuous, circular pattern.",
        "A texture which has a series of concentric circles or curves.",
        "A texture which shows a pattern that appears to move in a clockwise or counterclockwise direction.",
        "A texture which has a pattern that seems to twist or rotate around a central point.",
        "A texture which exhibits a pattern that appears to be drawn out from a central point in a coiling or convoluted manner.",
        "A texture which has a pattern that seems to wind in a continuous and gradually widening (or tightening) path.",
        "A texture which shows a pattern that appears to loop or curl around itself.",
        "A texture which has a pattern that seems to spiral outwards or inwards.",
        "A texture which exhibits a pattern that appears to be a series of arcs or curves radiating from a central point.",
        "A texture which has a pattern that seems to be a sequence of lines or shapes that follow a spiral path."
    ],
    "sprinkled": [
        "A texture which has small, scattered particles of varying colors.",
        "A texture which appears to have tiny dots or specks spread randomly across the surface.",
        "A texture which shows a lack of uniformity or pattern, with elements distributed haphazardly.",
        "A texture which has a rough or uneven surface due to the presence of small particles.",
        "A texture which has a multi-colored appearance due to the different colors of the sprinkles.",
        "A texture which has a 3D effect due to the raised nature of the sprinkles.",
        "A texture which has a shiny or glossy appearance when light reflects off the sprinkles.",
        "A texture which may have a crunchy or gritty feel due to the hard nature of the sprinkles.",
        "A texture which has a high level of contrast between the sprinkles and the background surface.",
        "A texture which may appear to have a sugary or edible quality, especially if the sprinkles are associated with food items."
    ],
    "stained": [
        "A texture which displays irregular color patterns or spots.",
        "A texture which shows discoloration in certain areas.",
        "A texture which has areas of darker or lighter shades compared to the rest.",
        "A texture which exhibits uneven color distribution.",
        "A texture which has patches of different colors.",
        "A texture which shows signs of liquid absorption or spillage.",
        "A texture which has areas that appear to be faded or worn out.",
        "A texture which has marks or lines that do not follow the general pattern.",
        "A texture which has spots that appear to be dried or hardened.",
        "A texture which shows signs of damage or alteration due to external factors.",
        "A texture which has areas that appear to be discolored due to age or exposure.",
        "A texture which exhibits signs of chemical reaction such as rust or oxidation.",
        "A texture which has areas that appear to be soaked or damp.",
        "A texture which shows signs of heat exposure or burn marks.",
        "A texture which has areas that appear to be stained by food, ink, paint, or other substances."
    ],
    "stratified": [
        "A texture which displays a layered appearance.",
        "A texture which shows clear horizontal lines or bands.",
        "A texture which has different materials or colors in each layer.",
        "A texture which has varying thickness in its layers.",
        "A texture which has a pattern that repeats in a regular or irregular manner.",
        "A texture which shows a clear distinction between each layer.",
        "A texture which may have different textures within each layer.",
        "A texture which may show signs of erosion or weathering, indicating different periods of deposition.",
        "A texture which may have layers that are not perfectly horizontal, indicating some form of disturbance or movement.",
        "A texture which may have fossil or mineral inclusions that differ between layers."
    ],
    "striped": [
        "A texture which has a pattern of parallel lines.",
        "A texture which alternates between two or more colors or shades.",
        "A texture which displays a regular pattern of light and dark bands.",
        "A texture which shows a consistent repetition of linear elements.",
        "A texture which has a clear contrast between the different stripes.",
        "A texture which has lines that are evenly spaced apart.",
        "A texture which has lines that may vary in width.",
        "A texture which may have lines running vertically, horizontally, or diagonally.",
        "A texture which may have lines that are straight, wavy, or zigzagged.",
        "A texture which may have stripes of different textures, such as smooth and rough.",
        "A texture which may have stripes that are continuous or broken into segments.",
        "A texture which may have stripes that are uniform or irregular in their pattern."
    ],
    "studded": [
        "A texture which features a series of raised points or bumps.",
        "A texture which has a regular pattern of protrusions.",
        "A texture which has a hard and rough surface due to the presence of studs.",
        "A texture which reflects light unevenly due to the presence of raised elements.",
        "A texture which has a three-dimensional aspect due to the protruding elements.",
        "A texture which may cause a prickly sensation when touched.",
        "A texture which has a consistent pattern of raised elements across the surface.",
        "A texture which may appear shiny or metallic, depending on the material of the studs.",
        "A texture which may create a rhythmic noise when something is dragged across it.",
        "A texture which may have a higher degree of friction due to the presence of studs."
    ],
    "swirly": [
        "A texture which has a pattern that appears to move or twist in a circular motion.",
        "A texture which displays a continuous, flowing, and curving pattern.",
        "A texture which has a pattern that seems to spiral or rotate.",
        "A texture which has a pattern that is not linear or straight.",
        "A texture which has a pattern that appears to be in a state of constant motion.",
        "A texture which has a pattern that is not uniform or regular.",
        "A texture which has a pattern that appears to be random and chaotic, yet maintains a sense of flow and continuity.",
        "A texture which has a pattern that seems to loop back onto itself.",
        "A texture which has a pattern that appears to be intertwined or interlocked.",
        "A texture which has a pattern that seems to be drawn or pulled towards a central point.",
        "A texture which has a pattern that appears to be layered or stacked in a circular or spiral pattern.",
        "A texture which has a pattern that seems to be constantly changing or shifting.",
        "A texture which has a pattern that appears to be complex and intricate.",
        "A texture which has a pattern that seems to be abstract and non-representational.",
        "A texture which has a pattern that appears to be dynamic and energetic."
    ],
    "veined": [
        "A texture which displays a pattern of lines or streaks that are different in color or texture from the main color.",
        "A texture which has a network of lines or streaks crisscrossing each other.",
        "A texture which has a pattern that resembles the branching structure of trees or blood vessels.",
        "A texture which has a pattern that is not uniform or consistent throughout.",
        "A texture which has lines or streaks that are often irregular and can vary in width and length.",
        "A texture which has a pattern that can be both linear and branching.",
        "A texture which has a pattern that can be both subtle and pronounced, depending on the material and lighting.",
        "A texture which has a pattern that can be seen in natural materials like marble, wood, and leaves.",
        "A texture which has a pattern that can also be artificially created in materials like fabric, paper, and digital images.",
        "A texture which has a pattern that can be both two-dimensional (on a flat surface) and three-dimensional (with physical ridges and valleys)."
    ],
    "waffled": [
        "A texture which has a grid-like pattern with raised squares or rectangles.",
        "A texture which features a repeating pattern of indentations and protrusions.",
        "A texture which has a symmetrical, geometric pattern.",
        "A texture which has a pattern that resembles a honeycomb, but with squares or rectangles instead of hexagons.",
        "A texture which has a pattern that is often found on breakfast foods like waffles or on certain types of fabric.",
        "A texture which has a pattern that is created by crossing lines or strips.",
        "A texture which has a pattern that is often used in the design of kitchen utensils like spatulas or oven mitts.",
        "A texture which has a pattern that can be both visually and physically felt.",
        "A texture which has a pattern that is often used in the design of footwear to provide grip.",
        "A texture which has a pattern that is often used in the design of athletic equipment for grip and durability."
    ],
    "woven": [
        "A texture which displays a clear pattern of interlacing threads or fibers.",
        "A texture which shows a crisscross pattern, typically with two sets of threads or fibers at right angles.",
        "A texture which has a regular, repeating pattern that is consistent throughout the material.",
        "A texture which may show visible knots or loops where the threads or fibers intersect.",
        "A texture which may have a raised or bumpy surface due to the weaving process.",
        "A texture which may show variations in the thickness of the threads or fibers used.",
        "A texture which may have a distinct directionality, with the threads or fibers running in specific directions.",
        "A texture which may show signs of wear or fraying along the edges where the weave is exposed.",
        "A texture which may have a certain level of rigidity or stiffness, depending on the tightness of the weave.",
        "A texture which may have a certain level of transparency, depending on the thickness and spacing of the threads or fibers."
    ],
    "wrinkled": [
        "A texture which has irregular, uneven surfaces.",
        "A texture which displays a pattern of creases or folds.",
        "A texture which has a non-uniform, random pattern.",
        "A texture which shows a series of lines, ridges, or grooves.",
        "A texture which lacks smoothness or flatness.",
        "A texture which has a three-dimensional quality due to the presence of raised and lowered areas.",
        "A texture which may resemble crumpled paper or fabric.",
        "A texture which has a tactile quality, appearing as though it would feel rough or bumpy to the touch.",
        "A texture which may have a visual similarity to aged or weathered surfaces.",
        "A texture which may appear to have a lack of firmness or elasticity."
    ],
    "zigzagged": [
        "A texture which features a continuous pattern of sharp turns or angles.",
        "A texture which has a pattern that alternates direction in a regular manner.",
        "A texture which displays a series of straight lines that abruptly change direction.",
        "A texture which has a pattern that resembles a series of 'Z' or 'N' shapes.",
        "A texture which shows a pattern that moves back and forth in a consistent, regular manner.",
        "A texture which has a pattern that could be described as a repeated 'peak' and 'valley'.",
        "A texture which has a pattern that could be likened to the path of a bouncing ball.",
        "A texture which has a pattern that is not smooth or curved, but rather sharp and angular.",
        "A texture which has a pattern that could be described as a series of connected 'V' shapes.",
        "A texture which has a pattern that is repetitive and predictable, with a clear, repeating motif."
    ]
}