{
    "apple pie": [
        "A food with a golden-brown, flaky crust.",
        "A food with a lattice or crisscross pattern on top.",
        "A food with a filling that is visible through the crust, typically a light brown or caramel color.",
        "A food with a round, typically deep-dish shape.",
        "A food with a filling that appears chunky and moist.",
        "A food with visible pieces of fruit, often apple, in the filling.",
        "A food with a glossy or shiny top crust, often due to an egg wash or sugar glaze.",
        "A food with a filling that may bubble over the edges, caramelizing on the crust.",
        "A food with a rustic, homemade appearance.",
        "A food that may be served with a scoop of vanilla ice cream or a dollop of whipped cream on top.",
        "A food that may have a dusting of powdered sugar or cinnamon on top.",
        "A food that may have visible steam or heat coming off of it, indicating it is freshly baked.",
        "A food that may be served in a pie dish or tin.",
        "A food that may be cut into wedge-shaped slices for serving.",
        "A food that may have a slightly irregular shape, as it is often handmade."
    ],
    "baby back ribs": [
        "A food with a curved bone structure visible on one side.",
        "A food with a dark, often reddish-brown, glaze or sauce coating.",
        "A food with a meaty portion that is visibly tender and juicy.",
        "A food with a layer of meat that is noticeably thicker on one side of the bone.",
        "A food with a charred or slightly burnt exterior, indicative of grilling or smoking.",
        "A food with a texture that appears to easily pull away from the bone.",
        "A food with visible grill marks or a smoky appearance.",
        "A food that is typically served in a rack or portions of a rack.",
        "A food with a glossy or shiny surface due to a glaze or sauce.",
        "A food that may be garnished with fresh herbs like parsley or cilantro.",
        "A food that is often served with side dishes like coleslaw, cornbread, or fries.",
        "A food that may have visible fat marbling in the meat.",
        "A food that may show signs of a dry rub, such as a crusty exterior or visible spices.",
        "A food that may be served with a side of barbecue sauce.",
        "A food that may be presented on a wooden board or a large platter."
    ],
    "baklava": [
        "A food with multiple thin, flaky layers.",
        "A food that appears golden brown in color.",
        "A food that is typically cut into square or diamond shapes.",
        "A food that often has a glossy or shiny surface due to a syrup or honey glaze.",
        "A food that may have crushed nuts sprinkled on top.",
        "A food that is often served in small, bite-sized pieces.",
        "A food that may show visible layers when viewed from the side.",
        "A food that may have a sticky texture due to the sweet syrup or honey used.",
        "A food that may have a filling visible between the layers, often a mixture of chopped nuts.",
        "A food that may have a dusting of ground spices, such as cinnamon, on top.",
        "A food that may have a garnish of whole spices, such as cloves, on top.",
        "A food that may be served on a decorative plate or tray, often with a piece of wax or parchment paper underneath each piece."
    ],
    "beef carpaccio": [
        "A food with thin, almost translucent slices of raw meat, typically beef.",
        "A food with a deep red or pink color, indicating the raw state of the meat.",
        "A food with a garnish of capers, lemon wedges, or arugula on top.",
        "A food with a drizzle of olive oil over the meat.",
        "A food with shavings of hard cheese, often Parmesan, scattered on top.",
        "A food with a sprinkling of coarse salt and freshly ground black pepper.",
        "A food with a presentation that often resembles a flower or a spiral due to the arrangement of the meat slices.",
        "A food with a side of toasted bread or croutons, often served separately.",
        "A food with a garnish of thinly sliced onions or radishes occasionally.",
        "A food with a layer of Dijon mustard or a mustard-based sauce, in some variations.",
        "A food with a garnish of thinly sliced truffles, in some upscale versions.",
        "A food with a garnish of pickled mushrooms or pickled vegetables, in some variations.",
        "A food with a garnish of fresh herbs like parsley or basil, in some variations.",
        "A food with a garnish of pine nuts or other nuts, in some variations.",
        "A food with a garnish of sun-dried tomatoes, in some variations.",
        "A food with a garnish of balsamic glaze or reduction, in some variations."
    ],
    "beef tartare": [
        "A food with a mound or patty-like shape, often served on a plate.",
        "A food with a raw, uncooked appearance, typically bright red or pink in color.",
        "A food with a finely chopped or minced texture.",
        "A food often garnished with ingredients like capers, onions, or parsley on top.",
        "A food that may be served with a raw egg yolk either on top or on the side.",
        "A food that is often accompanied by slices of bread or toast.",
        "A food that may be presented with a side of pickles or other pickled vegetables.",
        "A food that may have a drizzle of olive oil on top.",
        "A food that may be served with a side of mustard or other condiments.",
        "A food that may be garnished with freshly ground black pepper or sea salt.",
        "A food that may be served with a lemon wedge on the side.",
        "A food that may be presented in a ring mold shape.",
        "A food that may have a shiny or glossy appearance due to the raw nature of the meat."
    ],
    "beet salad": [
        "A food with a vibrant, deep red or purple color.",
        "A food with chunks or slices that have a circular or semi-circular shape.",
        "A food with a glossy, moist appearance, indicating it has been dressed or marinated.",
        "A food with a combination of other ingredients such as feta cheese, walnuts, or oranges.",
        "A food with leafy greens like arugula or spinach, often used as a base in beet salads.",
        "A food with a sprinkling of crumbled cheese on top.",
        "A food with a drizzle of dressing, often a vinaigrette, visible on top.",
        "A food with a garnish of fresh herbs, such as dill or parsley.",
        "A food with visible layers or sections of different ingredients, common in composed beet salads.",
        "A food with a mix of colors, including the deep red or purple of the beets, the green of the salad leaves, and the white or orange of any additional ingredients.",
        "A food with a texture that appears to be a mix of crunchy and soft elements.",
        "A food with small, diced pieces of red onion or other vegetables mixed in.",
        "A food with visible grains, such as quinoa or farro, often added to beet salads for extra texture and nutrition.",
        "A food with a presentation that is typically rustic, with ingredients loosely tossed together, or more composed, with ingredients carefully arranged."
    ],
    "beignets": [
        "A food with a square or rectangular shape.",
        "A food that is golden-brown in color.",
        "A food that appears to be deep-fried.",
        "A food with a soft and fluffy interior texture.",
        "A food with a slightly crispy exterior.",
        "A food that is heavily dusted with powdered sugar.",
        "A food that is typically served in a pile or stack.",
        "A food that is often accompanied by a cup of coffee in photos.",
        "A food that is typically served on a plate or in a basket with a napkin.",
        "A food that is often served in sets of three or more.",
        "A food that appears to be light and airy.",
        "A food that does not have any visible filling or topping other than powdered sugar.",
        "A food that is typically larger than a typical doughnut hole but smaller than a full-sized doughnut.",
        "A food that does not have any glaze or icing.",
        "A food that does not have any holes in the middle."
    ],
    "bibimbap": [
        "A food with a colorful assortment of vegetables arranged on top of a bed of white rice.",
        "A food with a raw or fried egg placed in the center of the dish.",
        "A food with thinly sliced meat, usually beef, arranged on top of the vegetables.",
        "A food with a bright red, spicy sauce (gochujang) often served on the side or drizzled on top.",
        "A food with ingredients that are often separated in the bowl, not mixed together until ready to eat.",
        "A food with common toppings including julienned cucumber, mushrooms, zucchini, radish, and bean sprouts.",
        "A food with a presentation that is often in a circular pattern, with each ingredient in its own section.",
        "A food with a serving style that can be in a regular bowl or a hot stone bowl (dolsot bibimbap).",
        "A food with a garnish of sesame seeds and/or a drizzle of sesame oil.",
        "A food with a base that is almost always a layer of steamed white rice.",
        "A food with a variety of textures, from the softness of the cooked rice to the crunchiness of the fresh vegetables.",
        "A food with a mix of both cooked and raw ingredients.",
        "A food with a balance of different colors, representing the balance of different food groups and nutrients."
    ],
    "bread pudding": [
        "A food with a moist, dense texture.",
        "A food with a golden-brown or dark brown top layer.",
        "A food that appears to be made from chunks or slices of bread.",
        "A food that may have visible raisins, nuts, or other add-ins.",
        "A food that may have a caramelized or glossy surface.",
        "A food that is typically served in squares or rectangles.",
        "A food that may be served with a sauce, often vanilla or caramel.",
        "A food that may have a slightly uneven, lumpy surface.",
        "A food that may show signs of being baked, such as a crusty edge.",
        "A food that may have a custard-like consistency visible in the interior.",
        "A food that may have a sprinkling of powdered sugar on top.",
        "A food that may have a slightly spongy texture when pressed.",
        "A food that may have a layered appearance, especially if made with sliced bread.",
        "A food that may have a shiny or glazed top, especially if a sweet syrup has been applied after baking.",
        "A food that may have a slightly cracked surface, especially if it has been baked until firm."
    ],
    "breakfast burrito": [
        "A food with a soft, flour tortilla exterior.",
        "A food that is typically cylindrical in shape.",
        "A food that is often cut in half, revealing a cross-section of ingredients.",
        "A food with a variety of fillings visible, such as scrambled eggs, cheese, and meats.",
        "A food with ingredients like potatoes, beans, or peppers visible inside.",
        "A food that may have salsa, sour cream, or guacamole served on the side or on top.",
        "A food that is often served wrapped in foil or parchment paper.",
        "A food that may have grill marks on the tortilla.",
        "A food that is typically handheld and portable.",
        "A food that may have a slightly toasted or browned exterior.",
        "A food that may have a side of hash browns, fruit, or other breakfast items in the photo.",
        "A food that may be served with a side of hot sauce or salsa.",
        "A food that may have a garnish of fresh herbs like cilantro or parsley.",
        "A food that may have a side of avocado slices or guacamole.",
        "A food that may have a side of refried beans or rice.",
        "A food that may have a side of Mexican-style breakfast potatoes."
    ],
    "bruschetta": [
        "A food with a base of grilled or toasted bread.",
        "A food topped with fresh diced tomatoes.",
        "A food that often includes chopped garlic on top.",
        "A food that is garnished with fresh basil leaves.",
        "A food that is drizzled with olive oil.",
        "A food that may have a sprinkle of salt and pepper on top.",
        "A food that sometimes includes a balsamic glaze or vinegar.",
        "A food that may have shavings of Parmesan cheese on top.",
        "A food that is typically served as an appetizer or snack.",
        "A food that is often cut into rectangular or diagonal slices.",
        "A food that has a vibrant red, green, and white color scheme due to its toppings.",
        "A food that may have a slightly charred or browned surface on the bread.",
        "A food that is typically served cold or at room temperature.",
        "A food that is often presented on a platter, with multiple pieces served together.",
        "A food that has a rustic, homemade appearance."
    ],
    "caesar salad": [
        "A food with romaine lettuce as the primary ingredient.",
        "A food with croutons scattered throughout.",
        "A food with shavings of Parmesan cheese on top.",
        "A food with a creamy, white dressing.",
        "A food with pieces of grilled or roasted chicken, although this is optional.",
        "A food with a garnish of lemon wedges.",
        "A food with a dressing that appears to be made from garlic, egg yolks, and anchovies.",
        "A food with a presentation that often includes whole or halved hard-boiled eggs.",
        "A food with a possible addition of bacon bits.",
        "A food that is typically served in a large, shallow bowl.",
        "A food that may have anchovy fillets on top.",
        "A food that may include a sprinkle of freshly ground black pepper.",
        "A food that may have a side of garlic bread."
    ],
    "cannoli": [
        "A food with a cylindrical, tube-like shape.",
        "A food with a crispy, fried, golden-brown exterior.",
        "A food with a creamy, white filling that often protrudes from both ends.",
        "A food with ends that are often garnished with powdered sugar, chocolate chips, or chopped nuts.",
        "A food with a filling that may contain small pieces of candied fruit.",
        "A food with a size that typically ranges from mini bite-sized pieces to larger, hand-held portions.",
        "A food with a texture contrast between the crunchy shell and the soft, creamy filling.",
        "A food with a filling that is typically made from ricotta cheese or mascarpone.",
        "A food that may have chocolate drizzles or dusted powdered sugar on top.",
        "A food that is often served as a dessert item.",
        "A food that is traditionally associated with Italian cuisine.",
        "A food that may sometimes have a slightly curved shape, rather than being perfectly straight.",
        "A food that may have decorative patterns on the shell, created during the frying process.",
        "A food that may sometimes be dipped in chocolate at one or both ends."
    ],
    "caprese salad": [
        "A food with alternating slices of fresh mozzarella and ripe tomatoes.",
        "A food with fresh basil leaves interspersed between the slices.",
        "A food with a drizzle of olive oil over the top.",
        "A food with a sprinkling of salt and pepper.",
        "A food with a drizzle of balsamic reduction or glaze.",
        "A food with the colors of the Italian flag: green, white, and red.",
        "A food that is typically served cold or at room temperature.",
        "A food that is often arranged in a circular or line pattern on a plate.",
        "A food that is not cooked or heated.",
        "A food that does not contain any meat or fish.",
        "A food that is often served as an appetizer or a side dish.",
        "A food that is simple and has a minimal number of ingredients.",
        "A food with a fresh and light appearance.",
        "A food that is often served on a flat plate rather than in a bowl.",
        "A food that is typically not mixed or tossed like a traditional salad."
    ],
    "carrot cake": [
        "A food with a light brown or orange color.",
        "A food with a dense, moist texture visible in the cross-section.",
        "A food with visible pieces of grated carrot in the cross-section.",
        "A food with a layer of white, creamy frosting, often cream cheese-based.",
        "A food with a square or rectangular shape when cut, indicating it's a type of cake.",
        "A food with a crumbly texture, typical of cakes.",
        "A food with occasional specks of nuts or raisins in the cross-section.",
        "A food with a layer of frosting between two or more layers of cake.",
        "A food with a garnish of crushed nuts, usually walnuts or pecans, on top of the frosting.",
        "A food with decorative elements like piped cream cheese frosting or small fondant carrots on top.",
        "A food with a slightly uneven surface, typical of baked goods.",
        "A food with a rich, deep color, indicating the use of spices like cinnamon or nutmeg."
    ],
    "ceviche": [
        "A food with a mixture of raw seafood, typically including fish such as sea bass, halibut, or shrimp.",
        "A food that appears to have been marinated or \"cooked\" in citrus juices, usually lime or lemon.",
        "A food with visible chunks of red onion.",
        "A food with small pieces of tomatoes, cilantro, and possibly other fresh herbs.",
        "A food that is often garnished with slices of avocado or corn kernels.",
        "A food that is typically served cold, often in a glass dish or on a lettuce leaf.",
        "A food that is often accompanied by side dishes such as sweet potatoes or corn-on-the-cob.",
        "A food that is typically served in a clear or light-colored sauce, which is the citrus marinade.",
        "A food that may have a slightly translucent appearance due to the acid \"cooking\" process.",
        "A food that may include slices of hot peppers, such as jalapenos or habaneros, for added spice.",
        "A food that is often presented in a layered or mixed manner, rather than neatly arranged.",
        "A food that may have a slightly pink or orange hue, depending on the type of seafood used and the other ingredients.",
        "A food that may be garnished with slices of lime or lemon on the side."
    ],
    "cheese plate": [
        "A food with a variety of different colored and textured items arranged on a flat surface.",
        "A food with small, individual portions that can be picked up and eaten without utensils.",
        "A food with a combination of hard and soft textures, often including both creamy and crumbly elements.",
        "A food with a range of colors, from pale yellows and whites to deep oranges and blues.",
        "A food with items that may have visible rinds, holes, or veins.",
        "A food with accompaniments such as fruits, nuts, and bread or crackers.",
        "A food with items that may be sliced, cubed, or served in wedges.",
        "A food with items that may have a glossy, matte, or dusty appearance.",
        "A food with items that may be arranged in a circular pattern or scattered randomly.",
        "A food with items that may be served on a wooden board, a slate, or a ceramic plate.",
        "A food with items that may be paired with small bowls or jars of condiments like honey, jam, or mustard.",
        "A food with items that may be labeled with small signs or markers.",
        "A food with items that may be wrapped in paper or left unwrapped.",
        "A food with items that may be served with a cheese knife or other specialized utensils.",
        "A food with items that may be served at room temperature or slightly chilled.",
        "A food with items that may have a strong aroma, although this cannot be determined from a photo.",
        "A food with items that may be served alongside a glass of wine, although this is not always the case."
    ],
    "cheesecake": [
        "A food with a dense, creamy texture visible in the cross-section.",
        "A food with a crumbly or graham cracker crust at the bottom.",
        "A food with a smooth, slightly shiny top surface.",
        "A food that is typically round and flat, similar to a pie.",
        "A food that may have a layer of fruit, chocolate, or other toppings on the surface.",
        "A food that is often sliced into triangular pieces for serving.",
        "A food that may have a slightly browned edge.",
        "A food that may show cracks on the top surface.",
        "A food that may have a white or light yellow color, depending on the flavor.",
        "A food that may be served with a dollop of whipped cream on top.",
        "A food that may have a layer of sour cream on top.",
        "A food that may be presented in individual serving sizes, similar to a muffin.",
        "A food that may be served chilled or at room temperature.",
        "A food that may have a glossy or jelly-like layer if a fruit topping is used.",
        "A food that may have a dusting of powdered sugar on top."
    ],
    "chicken curry": [
        "A food with a thick, creamy, and often yellow or red sauce.",
        "A food with chunks of white meat, which could be chicken.",
        "A food with visible spices, such as turmeric, cumin, or coriander.",
        "A food with pieces of vegetables like onions, bell peppers, or tomatoes.",
        "A food that is often served with a side of rice or naan bread.",
        "A food with a glossy or oily surface, indicating the presence of fats or oils.",
        "A food with a sauce that has a slightly grainy texture, indicating ground spices.",
        "A food with visible herbs, such as cilantro or mint, used as garnish.",
        "A food that appears to have a rich, deep flavor, indicated by the dark and vibrant color of the sauce.",
        "A food with a sauce that may have a slightly chunky texture due to the presence of onions or other vegetables.",
        "A food that may have visible pieces of chili, indicating a spicy flavor.",
        "A food that may have visible pieces of coconut or a creamy texture, indicating the use of coconut milk.",
        "A food that may have visible seeds or pods, such as cardamom or mustard seeds.",
        "A food that may have a layer of oil or ghee on top, indicating the use of these ingredients in cooking.",
        "A food that may be served in a bowl or deep dish, typical of curry dishes."
    ],
    "chicken quesadilla": [
        "A food with a tortilla folded over and grilled.",
        "A food with visible melted cheese inside when cut or bitten into.",
        "A food with small, cooked pieces of chicken inside.",
        "A food with a golden-brown, slightly crispy exterior.",
        "A food that is typically cut into triangular or rectangular pieces.",
        "A food that may have visible grill marks on the exterior.",
        "A food that may be served with sides of sour cream, guacamole, or salsa.",
        "A food that may contain additional fillings such as peppers, onions, or tomatoes.",
        "A food that is typically flat, not stacked or layered.",
        "A food that may have a slightly greasy appearance due to the grilling process.",
        "A food that is typically handheld, not requiring utensils to eat.",
        "A food that may have a slightly bubbly surface due to the melted cheese inside.",
        "A food that may have a slightly uneven shape due to the folding and grilling process.",
        "A food that may have a slightly charred or toasted edge.",
        "A food that may have a slightly puffy appearance due to the air trapped inside during grilling."
    ],
    "chicken wings": [
        "A food with a small, elongated shape, typically a few inches long.",
        "A food with a bone running through the center, often visible at one or both ends.",
        "A food with skin that can be crispy or soft, depending on preparation.",
        "A food with a texture that can range from juicy to dry, depending on how it's cooked.",
        "A food that can be coated in a variety of sauces, such as barbecue, buffalo, or teriyaki.",
        "A food that is often served with side dips like blue cheese or ranch dressing.",
        "A food that can be seen in two main parts: the 'drumette' and the 'flat'.",
        "A food that can be prepared in a variety of ways, including baked, fried, grilled, or smoked.",
        "A food that can be served either hot or cold.",
        "A food that can be garnished with celery sticks, carrot sticks, or other vegetables.",
        "A food that can be seen in a variety of colors, from golden brown to deep red or orange, depending on the sauce.",
        "A food that can be served in a pile or stacked, often in a basket or on a plate.",
        "A food that can have a greasy or shiny appearance, especially if fried or coated in sauce.",
        "A food that can have visible grill marks or char, especially if barbecued or grilled.",
        "A food that can have a flaky or crumbly coating if breaded and fried."
    ],
    "chocolate cake": [
        "A food with a dark brown, almost black color, indicating the presence of cocoa or chocolate.",
        "A food with a moist, dense texture visible in the cross-section.",
        "A food with a smooth, glossy chocolate ganache or frosting on top.",
        "A food with layers separated by a creamy or fudgy filling, often the same color as the cake itself.",
        "A food with crumbs that appear to be slightly sticky or fudgy, indicating a high moisture content.",
        "A food with a round, square, or rectangular shape, typical of most cakes.",
        "A food with a uniform texture and color throughout, with no visible chunks or pieces of other ingredients.",
        "A food that may have a dusting of powdered sugar or cocoa on top.",
        "A food that may be garnished with chocolate shavings, chocolate chips, or other chocolate decorations.",
        "A food that may be served with a side of whipped cream or a scoop of ice cream.",
        "A food that may have a slice removed, revealing a rich, dark interior.",
        "A food that may be presented on a cake stand or plate, often with a cake server or knife nearby.",
        "A food that may have a shiny, slightly cracked top, indicating a baked surface.",
        "A food that may have a slightly domed top, typical of baked cakes.",
        "A food that may have a slightly sunken center, a characteristic of some types of chocolate cake like flourless chocolate cake."
    ],
    "chocolate mousse": [
        "A food with a smooth, creamy texture.",
        "A food that is typically a rich, dark brown color.",
        "A food that is often served in a glass or small bowl.",
        "A food that may have a layer of whipped cream on top.",
        "A food that may be garnished with chocolate shavings or cocoa powder.",
        "A food that appears light and fluffy in texture.",
        "A food that may have a glossy or shiny surface.",
        "A food that may be layered with different shades of brown, indicating different chocolate intensities.",
        "A food that may be served with a small spoon, indicating its richness and density.",
        "A food that may be presented with fruit garnishes like strawberries or raspberries.",
        "A food that may have a small portion size due to its richness.",
        "A food that may show air bubbles when viewed closely, indicating it has been whipped or aerated.",
        "A food that may be served chilled, as indicated by condensation on the serving glass or bowl.",
        "A food that may be served in individual portions, rather than a large shared dish.",
        "A food that may have a uniform consistency, without chunks or pieces of other ingredients."
    ],
    "churros": [
        "A food with a long, cylindrical shape.",
        "A food with a ridged or grooved surface.",
        "A food with a golden-brown color.",
        "A food that appears to be deep-fried.",
        "A food with a dusting of granulated sugar on its surface.",
        "A food that may be served with a side of chocolate dipping sauce.",
        "A food that may be curved or looped, but typically maintains a straight form.",
        "A food that may have a filling, often cream or chocolate, visible at one end.",
        "A food that may be seen in a spiral or knot-like shape in some regional variations.",
        "A food that may have a slightly crunchy exterior and a soft interior.",
        "A food that may be seen in a variety of lengths, from short to very long.",
        "A food that may occasionally be sprinkled with cinnamon."
    ],
    "clam chowder": [
        "A food with a creamy, often white or off-white, soup base.",
        "A food with visible chunks of clams or pieces of seafood.",
        "A food with small diced potatoes visible in the mixture.",
        "A food with bits of onions and celery, often finely chopped.",
        "A food that may have specks of herbs such as thyme or parsley.",
        "A food that may contain pieces of bacon or ham.",
        "A food that is often served with oyster crackers on top or on the side.",
        "A food that may have a slightly thick consistency due to the use of flour or another thickening agent.",
        "A food that is typically served hot, often in a bowl or a bread bowl.",
        "A food that may have a slightly glossy appearance due to the cream or milk base.",
        "A food that may have a sprinkle of black pepper or paprika on top for garnish."
    ],
    "club sandwich": [
        "A food with three layers of bread, typically toasted.",
        "A food with a filling of sliced chicken or turkey.",
        "A food with a layer of lettuce and tomato.",
        "A food with a layer of bacon.",
        "A food with a layer of mayonnaise or other similar spread.",
        "A food that is cut into quarters and often held together with toothpicks.",
        "A food with a side of chips or a pickle.",
        "A food that is typically served cold, except for the toasted bread and bacon.",
        "A food that is often served on white, wheat, or rye bread.",
        "A food with a layer of cheese, typically American or Swiss.",
        "A food that is stacked high and has a distinct layered appearance.",
        "A food that is often served on a plate with a side salad.",
        "A food that is sometimes served with a hard-boiled egg or olives on top.",
        "A food that is often cut diagonally and arranged in a circle on the plate.",
        "A food that is sometimes served with a side of coleslaw."
    ],
    "crab cakes": [
        "A food with a round or patty-like shape.",
        "A food with a golden-brown, crispy exterior.",
        "A food with a flaky, moist interior visible when cut open.",
        "A food with visible chunks or shreds of white meat inside.",
        "A food that is typically served with a side of tartar sauce or a lemon wedge.",
        "A food that may be garnished with fresh herbs like parsley.",
        "A food that is often served on a bed of lettuce or coleslaw.",
        "A food that may have a breadcrumb or cracker crumb coating.",
        "A food that is typically 2-3 inches in diameter.",
        "A food that may be served as an appetizer or main course.",
        "A food that may be served with a side of fries or mashed potatoes.",
        "A food that may be served on a bun as a sandwich.",
        "A food that may be served with a side of remoulade sauce.",
        "A food that may be served in a seafood or coastal cuisine context.",
        "A food that may be served in a Maryland or Southern U.S. cuisine context."
    ],
    "creme brulee": [
        "A food with a smooth, creamy, custard-like base.",
        "A food with a caramelized sugar topping that is hard and crackly.",
        "A food that is typically served in a small, round, shallow dish.",
        "A food with a contrasting color between the light yellow custard and the dark brown or amber sugar topping.",
        "A food with a glossy, reflective surface on the top layer due to the caramelized sugar.",
        "A food that may have a spoon or a small hammer nearby, used for cracking the sugar topping.",
        "A food that may show a cracked sugar surface, revealing the creamy custard beneath.",
        "A food that may be garnished with fruits like berries or mint leaves on the side.",
        "A food that may have a dusting of powdered sugar on top.",
        "A food that may show signs of being torched or broiled, such as slightly burnt sugar spots on the top layer.",
        "A food that is typically served cold, which may be indicated by condensation on the dish.",
        "A food that may be served with a side of whipped cream or a scoop of ice cream.",
        "A food that may have a vanilla bean or its specks visible in the custard."
    ],
    "croque madame": [
        "A food with a fried or poached egg on top.",
        "A food with a layer of melted cheese over the top.",
        "A food that appears to be a sandwich with a golden-brown toasted exterior.",
        "A food with a filling that includes ham or other similar meat.",
        "A food that is typically cut in half to reveal the interior layers.",
        "A food with a creamy white sauce, possibly bechamel, visible either inside or on top.",
        "A food that is often served on a plate with a knife and fork, indicating it is not typically eaten with hands.",
        "A food that may have a side of fries or salad on the plate.",
        "A food that is generally square or rectangular in shape due to the use of sliced bread.",
        "A food with a rich, golden color, indicating it has been grilled or broiled.",
        "A food that appears to be a hearty, substantial meal, rather than a light snack or dessert.",
        "A food that may show signs of butter or oil, indicating it has been fried or toasted.",
        "A food that may have a garnish of fresh herbs, such as parsley, on the plate."
    ],
    "cup cakes": [
        "A food with a small, individual serving size, typically enough for one person.",
        "A food with a rounded, dome-like top.",
        "A food with a flat bottom, often encased in a paper or foil cup.",
        "A food with a fluffy, sponge-like texture visible in any cross-section or bite marks.",
        "A food with frosting or icing on top, often piped in decorative patterns.",
        "A food with sprinkles, nuts, or other toppings on the icing.",
        "A food with a small size, typically handheld and not requiring utensils to eat.",
        "A food with a variety of colors, often due to different flavors or decorative elements.",
        "A food with a moist and crumbly texture, visible when broken apart.",
        "A food with layers or fillings inside, such as cream, fruit, or chocolate, visible in a cross-section.",
        "A food with a sweet taste, often associated with dessert or snack items.",
        "A food with a uniform shape and size, often due to being baked in a mold or tin.",
        "A food with a baked and slightly browned surface, indicating it's been cooked in an oven.",
        "A food with a decorative wrapper or liner, often used to hold the food together and for presentation purposes.",
        "A food with a light and airy texture, often due to the use of leavening agents like baking powder or soda."
    ],
    "deviled eggs": [
        "A food with a halved, hard-boiled egg structure.",
        "A food with a creamy, often yellowish filling in the center of the egg halves.",
        "A food with a filling that is typically piped into the egg white halves, often creating a decorative, swirled appearance.",
        "A food with a garnish on top of the filling, commonly paprika, chives, or a small piece of parsley.",
        "A food with a smooth, shiny surface on the egg white part.",
        "A food with a filling that may have a slightly rough texture due to ingredients like mustard, mayonnaise, or pickles.",
        "A food that is often served cold and arranged on a platter.",
        "A food with a size that is typically small and bite-sized, easy to eat in one or two bites.",
        "A food with a color contrast between the white of the egg and the yellow of the filling.",
        "A food with a round shape on one side (bottom) and a flat shape on the other side (top where the filling is).",
        "A food that may sometimes have small pieces of ingredients like bacon, olives, or pickles on top of the filling as a garnish."
    ],
    "donuts": [
        "A food with a round shape and a hole in the middle.",
        "A food with a glazed or frosted surface.",
        "A food with a variety of toppings such as sprinkles, nuts, or coconut shavings.",
        "A food with a soft and fluffy texture visible in a cross-section view.",
        "A food with a shiny or glossy appearance due to a sugar glaze.",
        "A food with a cream or jelly filling visible in a cross-section view.",
        "A food with a dusting of powdered sugar on top.",
        "A food with a chocolate coating or frosting.",
        "A food with a uniform, golden-brown color.",
        "A food with a size that fits comfortably in one hand.",
        "A food with a visible yeast-raised dough if it's a yeast donut.",
        "A food with a cake-like texture visible in a cross-section view if it's a cake donut.",
        "A food with a twisted or braided shape if it's a cruller donut.",
        "A food with a rectangular shape with no hole if it's a long john donut.",
        "A food with a green, red, or other brightly colored frosting for festive occasions.",
        "A food with a heart shape or other novelty shapes for special occasions.",
        "A food with a cinnamon or sugar coating.",
        "A food with a visible layer of apple, cherry, or other fruit fillings if it's a filled donut.",
        "A food with a visible bacon topping if it's a bacon donut.",
        "A food with a visible layer of custard or cream if it's a Boston cream donut."
    ],
    "dumplings": [
        "A food with a small, rounded shape, often similar to a half-moon or a small pouch.",
        "A food with a thin, doughy exterior that is either smooth or pleated.",
        "A food that appears to be stuffed with a variety of fillings, which may include meat, vegetables, or cheese.",
        "A food that is often served with a side of dipping sauce.",
        "A food that can be either steamed, boiled, fried, or baked, but still retains its shape.",
        "A food that is often served in a bamboo steamer or on a small plate.",
        "A food that may have a glossy or matte finish, depending on the cooking method.",
        "A food that may have visible pleats or crimps, especially around the edges.",
        "A food that may be translucent if made with certain types of dough.",
        "A food that may be served in soup or broth.",
        "A food that may have a slightly curved shape, especially if it is a potsticker or gyoza.",
        "A food that may be served in a group, often arranged in a circular pattern.",
        "A food that may have a variety of colors, depending on the type of dough and filling used.",
        "A food that may have a bite or piece taken out of it, revealing the filling inside.",
        "A food that may be garnished with fresh herbs or sesame seeds."
    ],
    "edamame": [
        "A food with bright green, plump pods.",
        "A food with a slightly fuzzy exterior on the pods.",
        "A food with small, round, green beans inside the pods.",
        "A food with a size similar to snap peas or green beans.",
        "A food that is often served in a bowl or on a plate, with the pods still intact.",
        "A food with a slightly curved, cylindrical shape.",
        "A food with a smooth texture on the beans inside the pods.",
        "A food with a visible seam running along the length of the pod.",
        "A food with a slightly pointed end on the pods.",
        "A food with a fresh, vibrant color indicating it's typically consumed when immature or young.",
        "A food that is often served with a sprinkling of salt on the pods.",
        "A food that is typically boiled or steamed before serving.",
        "A food with a size of the beans inside the pods similar to peas.",
        "A food that is often served as a snack or appetizer in East Asian cuisine.",
        "A food with a slightly sweet and nutty flavor, although this may not be visible in a photo."
    ],
    "eggs benedict": [
        "A food with two halves of an English muffin as the base.",
        "A food with a layer of ham or bacon on top of the muffin.",
        "A food with a poached egg placed on each half of the muffin.",
        "A food with a creamy, yellowish sauce drizzled over the top.",
        "A food with a garnish of chopped parsley or chives on top.",
        "A food with a side of hash browns or potatoes in some variations.",
        "A food with the egg whites cooked but the yolk still runny.",
        "A food with the sauce, known as Hollandaise, made from egg yolk, butter, and lemon juice.",
        "A food with a slightly toasted muffin base.",
        "A food with the sauce often having a smooth and velvety texture.",
        "A food with the egg, when cut into, releasing a runny yolk.",
        "A food with the meat layer often lightly browned or seared.",
        "A food with the overall presentation being stacked or layered.",
        "A food with the sauce often covering the entire top layer and dripping down the sides.",
        "A food with the egg typically having a shape of a dome due to the poaching process."
    ],
    "escargots": [
        "A food with small, round, and brownish items, often served in a specialized dish with round indentations.",
        "A food with a glossy and slightly wrinkled texture, similar to that of a cooked mushroom.",
        "A food typically served in a buttery, garlicky sauce, often with visible herbs such as parsley.",
        "A food that is often presented with a special fork and tongs, indicating the need for a specific eating method.",
        "A food that may be served in its original shell, which is spiral-shaped and brown.",
        "A food that is usually served as an appetizer, often in high-end or French cuisine restaurants.",
        "A food that may appear slightly greenish due to the common addition of parsley or other herbs in the sauce.",
        "A food that is small in size, typically bite-sized, and uniform in shape.",
        "A food that may be served with slices of baguette or other types of bread on the side.",
        "A food that, when served in its shell, is often accompanied by a shell holder."
    ],
    "falafel": [
        "A food with small, round, and deep-fried balls or patties.",
        "A food with a golden-brown or dark brown exterior.",
        "A food with a crumbly, moist interior that is greenish or beige in color.",
        "A food that is often served in a pita or flatbread.",
        "A food that is typically accompanied by tahini sauce, salad, or pickles.",
        "A food with a texture that is crunchy on the outside and soft on the inside.",
        "A food that is commonly found in Middle Eastern cuisine.",
        "A food that is made from ground chickpeas or fava beans.",
        "A food that may have visible herbs or spices in its interior.",
        "A food that is often served as part of a mezze platter.",
        "A food that is typically vegetarian or vegan.",
        "A food that is often used as a meat substitute in vegetarian diets.",
        "A food that is high in protein and fiber.",
        "A food that is commonly served in street food stalls or fast food outlets in the Middle East.",
        "A food that is often garnished with sesame seeds."
    ],
    "filet mignon": [
        "A food with a small, cylindrical shape.",
        "A food with a smooth, lean texture.",
        "A food with a light to deep pink color when raw.",
        "A food with a browned or charred exterior when cooked.",
        "A food with a tender, soft texture when cooked.",
        "A food that is typically served in thick cuts.",
        "A food that is often tied with a string to maintain its shape during cooking.",
        "A food that is usually cooked to a range of doneness from rare to well-done.",
        "A food that may be served with a variety of sauces, such as a red wine reduction or béarnaise.",
        "A food that is often served as a standalone piece, not mixed with other ingredients.",
        "A food that is typically high-end and considered a delicacy.",
        "A food that is often served in fine dining restaurants.",
        "A food that may be wrapped in bacon for additional flavor.",
        "A food that is typically boneless.",
        "A food that is cut from the smaller end of the tenderloin, a muscle that runs along the spine."
    ],
    "fish and chips": [
        "A food with a large piece of battered and deep-fried white fish.",
        "A food with thick-cut fries, often softer and chunkier than typical American-style fries.",
        "A food with a side of tartar sauce, often used for dipping the fish.",
        "A food with a side of mushy peas, a common accompaniment in the UK.",
        "A food with a slice of lemon, often served with the fish for added flavor.",
        "A food with a side of malt vinegar, a traditional condiment for the chips.",
        "A food with a side of pickled onions or gherkins, common in some regions.",
        "A food typically served in a paper wrapping, a traditional way of serving in British fish and chip shops.",
        "A food with a golden-brown color, indicative of the deep-frying process.",
        "A food with a crispy exterior, especially noticeable on the battered fish.",
        "A food with a flaky interior, particularly in the case of the fish.",
        "A food with a side of baked beans, another common accompaniment in the UK.",
        "A food with a side of curry sauce, a popular addition in some regions.",
        "A food with a side of gravy, another possible condiment for the chips.",
        "A food with a side of coleslaw, occasionally served as an accompaniment.",
        "A food with a side of bread and butter, sometimes served as part of a \"fish supper\"."
    ],
    "foie gras": [
        "A food with a smooth and creamy texture.",
        "A food that is typically a light beige to golden brown color.",
        "A food that is often presented in a loaf or block shape.",
        "A food that may have a shiny or glossy surface.",
        "A food that is often served in thin slices.",
        "A food that may be served with a fruit compote or sauce on the side.",
        "A food that may have a slightly marbled appearance.",
        "A food that is often served on a small, elegant dish.",
        "A food that may be served with a piece of toasted bread.",
        "A food that may be served as a pâté or terrine.",
        "A food that may be served in a small jar or tin if it's a pâté.",
        "A food that may be served with a garnish of fresh herbs.",
        "A food that may be served with a drizzle of sauce or glaze.",
        "A food that may be served as part of a gourmet or fine dining meal.",
        "A food that may be served with a glass of sweet wine or dessert wine."
    ],
    "french fries": [
        "A food with long, thin, and rectangular shapes.",
        "A food with a golden-brown color.",
        "A food with a crispy exterior texture.",
        "A food with a soft and fluffy interior when bitten into.",
        "A food that is typically served in a pile or heap.",
        "A food that is often accompanied by ketchup or mayonnaise.",
        "A food that may have salt sprinkled over it.",
        "A food that may be served in a paper cone or a small basket.",
        "A food that may have a greasy or oily appearance.",
        "A food that may have variations like crinkle-cut, waffle, or curly shapes.",
        "A food that may be served alongside burgers or other fast food items.",
        "A food that may have a uniform size and shape if it is commercially produced.",
        "A food that may have irregular shapes and sizes if it is homemade.",
        "A food that may have a slightly curved shape.",
        "A food that may have small brown spots or blemishes due to frying.",
        "A food that may have a slight sheen or gloss due to oil.",
        "A food that may be garnished with herbs like parsley for presentation.",
        "A food that may be served with a side of dipping sauce.",
        "A food that may be served in a fast food or restaurant setting.",
        "A food that may be served as a side dish or a snack."
    ],
    "french onion soup": [
        "A food with a clear or slightly brownish broth.",
        "A food with visible, caramelized onions floating in the broth.",
        "A food with a layer of melted cheese on top.",
        "A food with a piece of toasted bread or crouton submerged under the cheese layer.",
        "A food served in a ceramic or stoneware bowl with handles.",
        "A food with the cheese often browned and bubbly, sometimes overflowing the sides of the bowl.",
        "A food with a rich, savory aroma.",
        "A food with a glossy appearance due to the melted cheese and broth.",
        "A food with a stringy texture when a spoonful is lifted, due to the melted cheese.",
        "A food with a layer of cheese that completely covers the top of the bowl.",
        "A food with a thick consistency due to the presence of onions and cheese.",
        "A food with a golden-brown color on top due to the broiled cheese.",
        "A food with a visible layering of ingredients - broth, onions, bread, and cheese from bottom to top.",
        "A food with a rustic appearance, often served in a traditional French onion soup bowl.",
        "A food with a hearty and comforting appearance."
    ],
    "french toast": [
        "A food with a golden-brown crust on the outside.",
        "A food that is typically rectangular or square in shape.",
        "A food that appears to have a moist, soft interior.",
        "A food that may have a dusting of powdered sugar on top.",
        "A food that may be served with syrup, which could be seen pooling on the plate.",
        "A food that may have visible signs of egg wash on the surface.",
        "A food that may be garnished with fresh fruits like strawberries or blueberries.",
        "A food that may have a slightly uneven surface due to the bread soaking up the egg mixture.",
        "A food that may be served in stacks or single slices.",
        "A food that may have a butter pat on top.",
        "A food that may show signs of griddle marks.",
        "A food that may be cut diagonally, revealing a soft, custard-like interior.",
        "A food that may be served on a breakfast or brunch setting.",
        "A food that may be accompanied by bacon, sausages, or other breakfast items on the plate.",
        "A food that may have a sprinkle of cinnamon or nutmeg on top."
    ],
    "fried calamari": [
        "A food with small, ring-shaped pieces.",
        "A food with a golden-brown, crispy exterior.",
        "A food that appears to have been deep-fried.",
        "A food with a texture that appears to be slightly chewy or rubbery.",
        "A food that is often served with a side of marinara sauce or aioli.",
        "A food that is typically served as an appetizer.",
        "A food that may have small tentacle pieces mixed in with the rings.",
        "A food that is often garnished with lemon wedges.",
        "A food that may be sprinkled with a dusting of finely chopped parsley.",
        "A food that may have a light dusting of grated Parmesan cheese.",
        "A food that may be served on a bed of lettuce or other greens.",
        "A food that may be accompanied by a side of coleslaw or fries.",
        "A food that may have a light coating of flour or batter before being fried.",
        "A food that may have a slightly translucent appearance when bitten into.",
        "A food that may be served in a basket or on a platter."
    ],
    "fried rice": [
        "A food with small, individual grains that are often a light brown or yellow color.",
        "A food with a variety of small, colorful ingredients mixed in, such as peas, carrots, or scrambled eggs.",
        "A food with small pieces of meat or tofu scattered throughout.",
        "A food with a slightly glossy or oily appearance due to the cooking process.",
        "A food with visible pieces of onion or garlic.",
        "A food that is often served in a bowl or on a plate as a mound.",
        "A food with small, chopped green onions sprinkled on top.",
        "A food with small pieces of scrambled egg distributed throughout.",
        "A food that may have small shrimp or pieces of chicken mixed in.",
        "A food that may have small, thin slices of cooked ham or pork.",
        "A food that may be garnished with sesame seeds or cilantro.",
        "A food that may be served with soy sauce or a side of chili sauce.",
        "A food that may have small cubes of cooked vegetables like bell peppers or corn.",
        "A food that may be accompanied by a side of pickled vegetables or a small salad.",
        "A food that may be served with chopsticks or a spoon.",
        "A food that may have a slightly charred or toasted appearance due to high-heat cooking.",
        "A food that may have a few pieces of pineapple or cashews for a sweet and savory version.",
        "A food that may be served in a pineapple shell or a clay pot for presentation.",
        "A food that may have a few pieces of baby corn or water chestnuts for a crunchy texture.",
        "A food that may have a few pieces of green peas or edamame for a pop of green color."
    ],
    "frozen yogurt": [
        "A food with a smooth, creamy texture.",
        "A food that appears semi-solid and can hold its shape.",
        "A food that is often served in a cup or cone.",
        "A food that can be seen in a variety of colors, often pastel, depending on the flavor.",
        "A food that may have visible mix-ins such as fruit, nuts, or candy.",
        "A food that is often swirled or piled high in the serving container.",
        "A food that may have a glossy sheen when freshly served.",
        "A food that may appear slightly frosted or icy if it has been in a freezer.",
        "A food that may be topped with a variety of garnishes like sprinkles, sauces, or whipped cream.",
        "A food that may be served with a small, flat spoon, often plastic.",
        "A food that may be seen in self-serve machines with a handle for dispensing.",
        "A food that may be seen in a variety of flavors, indicated by different colors and textures.",
        "A food that may appear less dense and lighter than traditional ice cream.",
        "A food that may be seen in a swirl pattern when dispensed from a machine.",
        "A food that may be seen in a layered pattern if different flavors or toppings have been added."
    ],
    "garlic bread": [
        "A food with a long, narrow, and oval shape.",
        "A food with a golden-brown crust on the top.",
        "A food with a soft, light-colored interior visible from the sides or when sliced.",
        "A food with visible pieces or granules of garlic on its surface.",
        "A food with a shiny, buttery surface.",
        "A food with a rough texture on the crust but a soft texture inside.",
        "A food with visible herbs, such as parsley or oregano, sprinkled on top.",
        "A food that is typically sliced diagonally into individual pieces.",
        "A food with a slightly cracked surface due to baking.",
        "A food that may have melted cheese on top, indicating it is a cheesy variant.",
        "A food that may be served in a basket or on a wooden board, often seen in restaurant settings.",
        "A food that may be accompanied by a dipping sauce, such as marinara sauce.",
        "A food that may have a slightly irregular shape, indicating it is homemade or artisanal.",
        "A food that may be wrapped in foil, especially if it is store-bought or takeaway.",
        "A food that may be served alongside pasta or other Italian dishes."
    ],
    "gnocchi": [
        "A food with small, soft, and plump dumpling-like shapes.",
        "A food with a texture that appears slightly ridged or grooved.",
        "A food that is typically white or off-white in color, but can also be seen in other colors if made with ingredients like spinach or sweet potato.",
        "A food that is often served with a sauce, commonly a tomato-based or butter and sage sauce.",
        "A food that may have an indented or thumbprint-like impression on one side.",
        "A food that is typically not uniform in shape, with each piece looking slightly different.",
        "A food that is often seen in Italian cuisine, particularly in photos of traditional Italian dishes.",
        "A food that is usually served in a bowl or on a plate, often as a side dish or main course.",
        "A food that can be seen in both boiled and pan-fried versions, with the pan-fried version having a slightly golden or crispy exterior.",
        "A food that may be seen in photos alongside ingredients like cheese, herbs, or vegetables.",
        "A food that is typically smaller than a golf ball but larger than a marble in size.",
        "A food that, when cut open, reveals a uniform, dough-like interior without any filling."
    ],
    "greek salad": [
        "A food with large chunks of fresh tomatoes.",
        "A food with sliced or cubed cucumbers.",
        "A food with sliced red onions.",
        "A food with green bell peppers cut into rings or chunks.",
        "A food with Kalamata olives, which are dark purple, almond-shaped, and often pitted.",
        "A food with a generous amount of feta cheese, usually in large blocks or crumbled.",
        "A food with a dressing made of olive oil, red wine vinegar, and dried herbs like oregano and dill.",
        "A food with no lettuce, unlike many other salads.",
        "A food with a garnish of fresh herbs, typically oregano or parsley.",
        "A food that is not typically mixed together, but rather, the ingredients are arranged separately on the plate.",
        "A food with capers, small green buds that add a tangy flavor, sometimes included.",
        "A food that may occasionally include stuffed grape leaves as an additional ingredient.",
        "A food that is typically served cold or at room temperature.",
        "A food that is often served in a shallow dish or plate, rather than a deep salad bowl."
    ],
    "grilled cheese sandwich": [
        "A food with two slices of bread, typically toasted to a golden brown.",
        "A food with a layer of melted cheese between the slices of bread.",
        "A food with a crispy, slightly charred exterior, indicative of grilling or toasting.",
        "A food with a soft, gooey interior, indicative of melted cheese.",
        "A food that may have visible grill marks on the surface of the bread.",
        "A food that is typically cut diagonally into two triangular halves.",
        "A food with a simple composition, usually not containing many ingredients beyond bread and cheese.",
        "A food that may have a slightly greasy or buttery exterior, indicative of the cooking process.",
        "A food that is typically served warm, as indicated by the melted cheese.",
        "A food that may be served with a side of tomato soup or chips, though these are not part of the sandwich itself.",
        "A food that may have variations with additions like ham, bacon, or tomato slices, but the basic version is just cheese and bread.",
        "A food that is usually flat, not stacked high like some other types of sandwiches.",
        "A food that may have a golden-brown crust, indicative of the toasting or grilling process.",
        "A food that may have cheese oozing out from the sides, indicative of the melting process during cooking.",
        "A food that is typically rectangular or square in shape, depending on the type of bread used."
    ],
    "grilled salmon": [
        "A food with a slightly charred or browned surface due to grilling.",
        "A food with a pinkish-orange to light pink interior when cut open.",
        "A food with a flaky texture visible in the photo.",
        "A food with a distinct shape, typically oval or oblong, often with a tapering end.",
        "A food with visible grill marks or lines on the surface.",
        "A food that may be served with a slice of lemon or a sprig of dill on the side.",
        "A food that may be presented on a bed of vegetables or rice.",
        "A food with a glossy or moist appearance, indicating it's been recently cooked or glazed.",
        "A food that may have a skin on one side that appears darker and slightly crispy.",
        "A food that may be garnished with herbs or spices, such as parsley or black pepper.",
        "A food that may be served with a side of sauce, often a creamy or buttery one.",
        "A food that may be served on a wooden plank, a common method for grilling salmon.",
        "A food that may be served with a wedge of lemon, a common accompaniment to fish dishes.",
        "A food that may be served as a fillet, a common way to prepare salmon."
    ],
    "guacamole": [
        "A food with a smooth, creamy texture.",
        "A food that is primarily green in color.",
        "A food that may have visible chunks of red tomatoes.",
        "A food that may contain small, white diced onions.",
        "A food that may have small pieces of cilantro mixed in.",
        "A food that may have a slightly uneven texture due to mashed avocados.",
        "A food that may be served in a bowl or as a side dish.",
        "A food that may be garnished with a lime or lemon wedge.",
        "A food that may be served with tortilla chips.",
        "A food that may have a slightly glossy appearance due to the natural oils in avocados.",
        "A food that may have small, black specks from ground pepper or spices.",
        "A food that may have a slightly yellow hue from added citrus juice.",
        "A food that may have a layer of liquid on top if it has been sitting out for a while.",
        "A food that may have visible chunks of jalapeno or other peppers.",
        "A food that may be served in a traditional molcajete (Mexican mortar and pestle).",
        "A food that may have a slightly brown color if it has been exposed to air for too long."
    ],
    "gyoza": [
        "A food with a half-moon or crescent shape.",
        "A food with a pleated edge on one side.",
        "A food with a smooth, slightly curved surface on the other side.",
        "A food with a size typically ranging from 1 to 2 inches in length.",
        "A food with a thin, translucent wrapper that reveals the filling inside.",
        "A food with a filling that typically consists of minced meat and vegetables.",
        "A food that appears to be pan-fried, resulting in a golden-brown, crispy bottom.",
        "A food that is often served with a dipping sauce, typically soy-based.",
        "A food that is usually arranged in a circular pattern on a plate or in a steamer.",
        "A food that may have a glossy appearance if it's been steamed or boiled.",
        "A food that may have a slightly charred or crispy appearance if it's been pan-fried.",
        "A food that is typically served in groups of six or more.",
        "A food that is often served with garnishes like chopped green onions or sesame seeds."
    ],
    "hamburger": [
        "A food with a round, flat patty typically made from ground meat.",
        "A food with a bun, usually round and often cut in half.",
        "A food with layers, typically including a meat patty, vegetables, and condiments.",
        "A food with condiments such as ketchup, mustard, mayonnaise, or special sauces.",
        "A food with toppings like lettuce, tomatoes, onions, pickles, and cheese.",
        "A food that is often served with side dishes like fries or coleslaw.",
        "A food that is typically handheld and eaten without utensils.",
        "A food that is often wrapped in paper or served on a small tray for easy handling.",
        "A food with a bun that may be toasted or grilled.",
        "A food with a patty that can be grilled, fried, or broiled.",
        "A food that may have variations including double or triple layers of meat and cheese.",
        "A food that may have variations with different types of meat like chicken, turkey, or vegetarian patties.",
        "A food that may have regional variations, like a Hawaiian version with pineapple or a southwestern version with jalapenos and pepper jack cheese.",
        "A food that may be garnished with a toothpick or small flag for stability and presentation.",
        "A food that may have cheese melted on top of the meat patty.",
        "A food that may have bacon strips added to the layers.",
        "A food that may have a sesame seed or plain bun.",
        "A food that may have a special sauce unique to the restaurant or region.",
        "A food that may have variations in size, from sliders to jumbo burgers.",
        "A food that may have a unique presentation, like a gourmet burger served on a wooden board."
    ],
    "hot and sour soup": [
        "A food with a dark reddish-brown or dark brown broth.",
        "A food with visible tofu cubes floating in the soup.",
        "A food with thin strips of bamboo shoots and wood ear mushrooms.",
        "A food with small pieces of pork or chicken.",
        "A food with beaten eggs creating a ribbon-like pattern in the soup.",
        "A food with green onions or cilantro sprinkled on top.",
        "A food with a glossy and slightly thick consistency due to the addition of cornstarch.",
        "A food with a spicy and sour flavor profile, indicated by the presence of red chili oil and vinegar.",
        "A food typically served in a bowl with a ladle.",
        "A food that is often accompanied by a side of white or fried rice in the photo.",
        "A food that may have visible white pepper specks.",
        "A food that may contain small shrimp or other seafood.",
        "A food that may have sesame oil floating on top, giving it a shiny appearance.",
        "A food that may have visible pieces of red chili peppers.",
        "A food that is typically served hot, indicated by steam rising from the bowl in the photo."
    ],
    "hot dog": [
        "A food with a soft, elongated bun, typically light brown or yellowish in color.",
        "A food with a sausage or frankfurter placed within the bun.",
        "A food that may have condiments such as mustard, ketchup, onions, mayonnaise, relish, sauerkraut, coleslaw, cheese, chili, or jalapenos on top of the sausage.",
        "A food where the sausage or frankfurter is typically made from pork, beef, chicken, or turkey.",
        "A food that is often served warm or hot.",
        "A food that is typically handheld and easy to eat on the go.",
        "A food that is often served with sides like fries, chips, or pickles.",
        "A food that is commonly found at sporting events, barbecues, picnics, and fast food restaurants.",
        "A food that may have regional variations, such as the Chicago-style hot dog with a poppy seed bun, or the New York-style hot dog with sauerkraut and spicy brown mustard.",
        "A food that is often wrapped in foil or paper, or served in a small cardboard tray when bought from a street vendor or at a stadium.",
        "A food that is typically longer than it is wide, due to the shape of the bun and sausage.",
        "A food where the sausage or frankfurter is usually visible at both ends of the bun.",
        "A food that may have grill marks on the sausage or frankfurter if it has been cooked on a grill.",
        "A food that is often served with a soft drink or beer.",
        "A food that is commonly associated with American cuisine, but can be found in various forms worldwide."
    ],
    "huevos rancheros": [
        "A food with a base of corn tortillas.",
        "A food with fried or poached eggs on top.",
        "A food with a layer of refried beans spread on the tortillas.",
        "A food with a topping of tomato-chili sauce.",
        "A food with garnishes of sliced avocado or guacamole.",
        "A food with sprinkles of crumbled cheese, typically Mexican queso fresco.",
        "A food with sides of Mexican-style rice and refried beans.",
        "A food with additional toppings of sour cream or cilantro.",
        "A food with optional meat additions, such as chorizo or shredded chicken.",
        "A food with a colorful presentation, typically red from the tomato-chili sauce, white from the eggs and cheese, and green from the avocado or cilantro.",
        "A food that is typically served on a plate, not in a bowl or a sandwich.",
        "A food that is often served as a breakfast or brunch dish.",
        "A food with a rustic and hearty appearance."
    ],
    "hummus": [
        "A food with a smooth, creamy texture.",
        "A food that is typically beige or light brown in color.",
        "A food that is often served in a bowl or dish, sometimes with a well in the center.",
        "A food that may have a drizzle of olive oil on top.",
        "A food that may be garnished with whole chickpeas, parsley, or paprika.",
        "A food that is often served with pita bread or vegetables for dipping.",
        "A food that may have a slightly glossy appearance due to the presence of tahini.",
        "A food that is typically spreadable and holds its shape.",
        "A food that may have a slightly grainy appearance up close due to the ground chickpeas.",
        "A food that is often served as a dip or spread, rather than a main dish.",
        "A food that is typically not cooked or heated before serving.",
        "A food that may appear in a variety of shades of beige or brown, depending on the specific ingredients used.",
        "A food that may have a slightly swirled or patterned surface if it has been stirred or spread with a spoon.",
        "A food that may have a slightly uneven surface, with small peaks and valleys.",
        "A food that may be served in a variety of containers, from plastic tubs to ceramic bowls."
    ],
    "ice cream": [
        "A food with a creamy and smooth texture.",
        "A food that appears to be cold or frozen in the image.",
        "A food that is often served in a cone or a bowl.",
        "A food that can be seen melting at room temperature.",
        "A food that comes in a variety of colors, often pastel or bright.",
        "A food that is often topped with items like sprinkles, chocolate syrup, nuts, or a cherry.",
        "A food that is often served with a small, round scoop.",
        "A food that can be seen in different shapes, such as balls or swirls.",
        "A food that is often served on a stick, known as an ice cream bar.",
        "A food that can be seen in layers or stripes of different colors or flavors.",
        "A food that may have visible chunks of fruit, chocolate, or nuts mixed in.",
        "A food that is often served alongside pieces of cake or pie.",
        "A food that can be seen sandwiched between two cookies or wafers.",
        "A food that is often served in a tall glass with a long spoon, known as a sundae.",
        "A food that can be seen in a rectangular shape, known as an ice cream sandwich.",
        "A food that is often served in a plastic wrapper or a cardboard box for individual servings.",
        "A food that can be seen in a large tub or carton, especially in a supermarket setting.",
        "A food that is often served with a wafer or a flake, especially in the UK.",
        "A food that can be seen in a rolled form, known as rolled ice cream.",
        "A food that can be seen in a soft-serve form, with a swirly peak on top."
    ],
    "lasagna": [
        "A food with multiple layers visible from the side.",
        "A food with a golden-brown, slightly crispy top layer.",
        "A food with alternating layers of pasta, cheese, and sauce.",
        "A food with a visible layer of melted cheese on top.",
        "A food with a red tomato-based sauce visible between layers.",
        "A food with a rectangular or square shape when cut.",
        "A food with a thick, hearty appearance.",
        "A food with visible pieces of ground meat or vegetables between layers.",
        "A food with a creamy white layer, indicating the presence of bechamel sauce or ricotta cheese.",
        "A food with a slightly uneven surface due to the baking process.",
        "A food with a moist and juicy texture visible in the layers.",
        "A food with a dense and heavy appearance, indicating a substantial meal.",
        "A food with a glossy sheen on top, indicating it has been baked or broiled.",
        "A food with edges that may appear slightly burnt or crispy.",
        "A food with a rich, deep color palette, primarily red, white, and golden brown.",
        "A food typically served in a deep dish or casserole.",
        "A food that is often cut into individual servings before being photographed."
    ],
    "lobster bisque": [
        "A food with a smooth, creamy texture.",
        "A food with a rich orange or pinkish color.",
        "A food that may have small chunks of lobster meat visible.",
        "A food that is typically served in a bowl or a cup.",
        "A food that may be garnished with fresh herbs, such as parsley or dill.",
        "A food that may have a dollop of cream or a drizzle of sherry on top.",
        "A food that may be accompanied by a slice of bread or a cracker.",
        "A food that may show traces of spices like paprika or cayenne pepper on top.",
        "A food that may have a spoon in or next to the bowl, indicating it is a soup.",
        "A food that may be served with a lemon wedge on the side.",
        "A food that may have a rich, glossy sheen, indicating the presence of butter or cream.",
        "A food that may show signs of being pureed or blended to achieve a smooth consistency."
    ],
    "lobster roll sandwich": [
        "A food with a split-top bun, often toasted or grilled.",
        "A food with a filling that prominently features large chunks of lobster meat.",
        "A food that may have a light coating of mayonnaise or butter on the lobster meat.",
        "A food that often includes a sprinkle of chives or parsley on top.",
        "A food that may have a side of potato chips, pickles, or coleslaw.",
        "A food that is typically served cold, but can also be served warm in some variations.",
        "A food that may have a slight drizzle of lemon juice or a lemon wedge on the side.",
        "A food that is often served in a paper-lined basket or on a small plate.",
        "A food that may have a slight garnish of celery or lettuce.",
        "A food that is typically associated with New England, especially Maine, in the United States.",
        "A food that is often served at seafood restaurants or food trucks.",
        "A food that is typically easy to eat with hands, similar to a hot dog or burger.",
        "A food that has a rich, creamy, and slightly sweet taste due to the lobster."
    ],
    "macaroni and cheese": [
        "A food with small, tube-shaped pasta pieces.",
        "A food with a creamy, often yellow or orange sauce.",
        "A food with a cheese-based sauce that may appear slightly stringy or gooey.",
        "A food that may have a baked, golden-brown crust on top.",
        "A food that may have breadcrumbs sprinkled on top.",
        "A food that may be served in a casserole dish or individual ramekins.",
        "A food that may have additional ingredients such as bacon, vegetables, or other types of cheese mixed in.",
        "A food that may be served as a side dish or a main course.",
        "A food that is often associated with comfort food or American cuisine.",
        "A food that may appear in a variety of textures, from creamy to firm, depending on preparation methods.",
        "A food that may have a glossy appearance due to the cheese sauce.",
        "A food that may be served hot, with steam visible in the photo.",
        "A food that may be served in a portion size suitable for one person or for sharing.",
        "A food that may be served with a spoon or fork, indicating its soft texture.",
        "A food that may be presented with garnishes such as fresh herbs or extra cheese on top."
    ],
    "macarons": [
        "A food with a small, round, and flat shape.",
        "A food with a smooth, shiny, and domed top.",
        "A food with a \"foot\" or ruffled circumference.",
        "A food with a filling sandwiched between two cookies.",
        "A food that comes in a variety of bright and pastel colors.",
        "A food with a slightly cracked surface.",
        "A food that is typically about 1.5-2 inches in diameter.",
        "A food with a texture that is crisp on the outside and soft on the inside.",
        "A food with a filling that can be cream, ganache, or jam.",
        "A food that is often displayed in a variety of flavors and colors together.",
        "A food that is typically made from almond flour, sugar, and egg whites.",
        "A food that is often associated with French cuisine.",
        "A food that is often served at high tea or as a dessert.",
        "A food that is often packaged in a box or a tray due to its delicate nature.",
        "A food that is often decorated with sprinkles, edible glitter, or other garnishes."
    ],
    "miso soup": [
        "A food with a clear or slightly cloudy broth.",
        "A food with small tofu cubes floating in the broth.",
        "A food with small pieces of seaweed or green onions scattered throughout.",
        "A food that is typically served in a small, round bowl.",
        "A food with a light brown or yellowish color.",
        "A food that may contain small, white, round objects, which are miso paste balls.",
        "A food that may have thin slices of mushrooms or other vegetables.",
        "A food that is often served with a lid to keep it warm.",
        "A food that is typically served with a small spoon or is drunk directly from the bowl.",
        "A food that may have a few small clams or pieces of fish.",
        "A food that may contain thin, white, circular objects, which are sliced radishes.",
        "A food that may have a slightly oily sheen on the surface of the broth.",
        "A food that may contain small, green, leafy vegetables, which are spinach or chard.",
        "A food that may have small, white, rectangular objects, which are silken tofu.",
        "A food that may contain small, brown, thin objects, which are dried wakame seaweed rehydrated."
    ],
    "mussels": [
        "A food with a small, elongated, oval shape.",
        "A food with a dark, typically black or brown, hard outer shell.",
        "A food with a shell that is smooth and shiny on the outside.",
        "A food with a shell that is slightly asymmetrical, with one side being more rounded and the other more pointed.",
        "A food with a shell that opens to reveal a soft, moist interior.",
        "A food with an interior that is typically orange or yellow in color when cooked.",
        "A food with a shell that is typically served open, often in a bowl or on a plate.",
        "A food with a texture that is soft and slightly chewy when cooked.",
        "A food that is often served in a sauce or broth, such as a white wine sauce or a tomato-based sauce.",
        "A food that is often served with a side of bread or fries, particularly in European cuisine.",
        "A food that is often served as part of a seafood platter or dish.",
        "A food that is often served in a large quantity, due to its small size.",
        "A food that is often cooked and served in its own shell.",
        "A food that is often found in coastal or marine-themed dishes or restaurants.",
        "A food that is often associated with Belgian, French, or Mediterranean cuisine."
    ],
    "nachos": [
        "A food with a base layer of tortilla chips.",
        "A food with melted cheese or cheese sauce drizzled over it.",
        "A food with toppings such as jalapenos, olives, or diced tomatoes.",
        "A food with a layer of refried beans or ground meat.",
        "A food with dollops of sour cream or guacamole on top.",
        "A food with a sprinkling of chopped green onions or cilantro.",
        "A food with a side of salsa or pico de gallo.",
        "A food that appears to be layered and stacked.",
        "A food with a colorful and varied appearance due to different toppings.",
        "A food that is typically served on a large platter or tray.",
        "A food that is often served as a shared appetizer or snack.",
        "A food that may have a side of queso dip.",
        "A food that may have a side of chili con carne.",
        "A food that may have a garnish of lime wedges.",
        "A food that may have a topping of shredded lettuce."
    ],
    "omelette": [
        "A food with a flat, round or semi-circular shape.",
        "A food with a yellow or golden-brown color, indicating the presence of eggs.",
        "A food with a fluffy or slightly puffed texture, indicating the eggs have been beaten and cooked.",
        "A food with visible fillings such as cheese, vegetables, or meats peeking out from the edges or center.",
        "A food with a smooth or slightly wrinkled surface, indicating it has been pan-fried.",
        "A food with a glossy or slightly greasy appearance, suggesting it has been cooked with butter or oil.",
        "A food with a folded or rolled presentation, typical of some omelette styles.",
        "A food with small brown spots or patches, indicating it has been cooked on high heat.",
        "A food with a size typically large enough to cover a good portion of a plate.",
        "A food with a uniform thickness, indicating it has been evenly cooked.",
        "A food with a soft and slightly runny interior when cut open, indicating it is not overcooked.",
        "A food with a slightly crispy or firm edge, indicating it has been cooked until set.",
        "A food with a layered appearance when cut, indicating the presence of multiple ingredients.",
        "A food with a light and airy texture, indicating the eggs have been whisked well before cooking."
    ],
    "onion rings": [
        "A food with a circular or ring-like shape.",
        "A food with a golden-brown, crispy exterior.",
        "A food with a visible, white, and slightly translucent interior when broken apart.",
        "A food with a layered structure visible on the inside.",
        "A food that appears to have been deep-fried.",
        "A food with a smooth, uniform coating on the exterior.",
        "A food that is typically served in a stack or pile.",
        "A food that is often accompanied by a dipping sauce.",
        "A food with a size that can range from small to large, but is typically big enough to fit around a finger.",
        "A food that may have a slightly greasy appearance due to the frying process.",
        "A food that may have a dusting of additional seasoning on the exterior.",
        "A food that, when cut open, reveals a soft, cooked vegetable inside.",
        "A food that may be served on a plate or in a basket, often with a paper liner.",
        "A food that may have a slightly irregular shape, as it is made from a natural, not processed, ingredient."
    ],
    "oysters": [
        "A food with a hard, rough, irregularly shaped outer shell.",
        "A food with a smooth, shiny, and often pearlescent interior shell.",
        "A food with a soft, greyish body inside the shell.",
        "A food with a small, round, and often slightly wrinkled appearance when removed from the shell.",
        "A food with a briny, salty smell, similar to the sea.",
        "A food that is often served on a bed of crushed ice or seaweed.",
        "A food that is typically served with lemon wedges, hot sauce, or mignonette sauce.",
        "A food that is often eaten raw, but can also be cooked or smoked.",
        "A food that is commonly found in seafood platters or raw bars.",
        "A food that is often shucked, or opened, with a special knife before eating.",
        "A food that can be small and sweet or large and briny, depending on its variety.",
        "A food that is often served in its own shell, which can be deep or shallow, depending on the type.",
        "A food that is often associated with luxury or special occasions.",
        "A food that is often paired with champagne or white wine.",
        "A food that is a popular choice for appetizers or hors d'oeuvres.",
        "A food that is a rich source of zinc, iron, calcium, and selenium, as well as vitamin A and vitamin B12."
    ],
    "pad thai": [
        "A food with thin, flat rice noodles.",
        "A food with a mix of proteins, commonly shrimp, chicken, or tofu.",
        "A food with scrambled eggs mixed in.",
        "A food with bean sprouts and chopped peanuts on top.",
        "A food with a garnish of fresh lime wedges and cilantro.",
        "A food with a reddish-brown color from tamarind paste.",
        "A food with a slightly sweet, sour, and salty flavor profile.",
        "A food with small, firm tofu cubes.",
        "A food with a stir-fried presentation.",
        "A food with visible pieces of crushed red pepper.",
        "A food with green onions or chives mixed in.",
        "A food with a glossy appearance due to the sauce.",
        "A food typically served on a plate or in a shallow bowl.",
        "A food with a texture that is both soft (from the noodles) and crunchy (from the peanuts).",
        "A food with a slightly oily appearance."
    ],
    "paella": [
        "A food with a wide, shallow, flat pan.",
        "A food with a variety of colorful ingredients spread evenly across the surface.",
        "A food with a yellowish color, typically from saffron or turmeric.",
        "A food with visible grains of short to medium-grain rice.",
        "A food with a mix of seafood, such as shrimp, mussels, and clams.",
        "A food with pieces of chicken or rabbit meat.",
        "A food with green vegetables like bell peppers and peas.",
        "A food with a slightly crusty bottom layer of rice, known as 'socarrat'.",
        "A food with wedges of lemon as garnish.",
        "A food with a rustic, slightly uneven texture, not smooth or pureed.",
        "A food that is typically served straight from the pan it was cooked in.",
        "A food with a mix of ingredients but without a heavy sauce or gravy.",
        "A food with visible pieces of tomato.",
        "A food that is not typically layered or stacked, but spread out in the pan.",
        "A food that is often garnished with sprigs of rosemary or parsley."
    ],
    "pancakes": [
        "A food with a round and flat shape.",
        "A food with a light brown or golden color on the surface.",
        "A food with a fluffy and soft texture visible from the sides.",
        "A food that is often stacked on top of each other.",
        "A food with visible small holes or pores on the surface.",
        "A food that is often served with syrup, butter, or fruit toppings in the photo.",
        "A food that appears slightly glossy or shiny due to the butter or oil used in cooking.",
        "A food with a slightly uneven surface, showing signs of bubbles that have popped during cooking.",
        "A food that may have a wedge cut out of it, revealing a soft, spongy interior.",
        "A food that is typically photographed on a breakfast setting.",
        "A food that may have a dusting of powdered sugar on top.",
        "A food that may be shown with a slice being lifted, showing its flexibility and softness.",
        "A food that may have a pat of butter melting on top.",
        "A food that may be served on a plate with bacon, eggs, or other breakfast items.",
        "A food that may be shown in a close-up shot, revealing its porous and fluffy texture."
    ],
    "panna cotta": [
        "A food with a smooth, creamy texture.",
        "A food that is typically white or off-white in color.",
        "A food that is often served in a small, round shape, similar to a pudding or custard.",
        "A food that is typically served chilled.",
        "A food that is often garnished with fruits, berries, or a sweet sauce on top.",
        "A food that appears to be slightly jiggly or wobbly when moved.",
        "A food that is often served in a glass or a small bowl.",
        "A food that may have a layer of fruit or caramel sauce at the bottom.",
        "A food that is typically served as a dessert.",
        "A food that may have a glossy or shiny surface.",
        "A food that may be served unmolded, retaining its shape on a plate.",
        "A food that may have a layer of gelatin on top.",
        "A food that may be presented in a variety of shapes, such as hearts, stars, or squares, when molded.",
        "A food that may be layered with different flavors or colors."
    ],
    "peking duck": [
        "A food with a glossy, dark brown, crispy skin.",
        "A food that is often presented whole before being sliced.",
        "A food with thin, almost translucent slices.",
        "A food that is typically served with thin pancakes, spring onions, and sweet bean sauce.",
        "A food that is often garnished with cucumber sticks.",
        "A food that is traditionally roasted in a closed or hung oven.",
        "A food that is often served on a large platter, showcasing its full body.",
        "A food that is typically associated with Chinese cuisine.",
        "A food that is often served with the skin, meat, and fat clearly separated in the slices.",
        "A food that is typically served in a specific sequence: skin first, then slices of meat.",
        "A food that is often seen in a wrapping or rolling process at the table.",
        "A food that is often accompanied by a small dish of dark, thick sauce.",
        "A food that is typically carved in front of the diner in high-end restaurants.",
        "A food that is often served with a side of stir-fried vegetables or noodles.",
        "A food that is typically associated with festive occasions or celebrations."
    ],
    "pho": [
        "A food with thin, flat rice noodles submerged in a clear broth.",
        "A food with slices of beef or chicken floating on top of the broth.",
        "A food with a side plate of fresh herbs such as basil, cilantro, and mint.",
        "A food with a side of bean sprouts, lime wedges, and jalapeno slices.",
        "A food with a garnish of chopped green onions and cilantro on top of the broth.",
        "A food with a side of hoisin sauce and sriracha for added flavor.",
        "A food with a clear, aromatic broth that may contain star anise, cloves, cinnamon, and cardamom.",
        "A food with a side of chopsticks and a soup spoon, indicating it's meant to be eaten by alternating between the two utensils.",
        "A food typically served in a large, deep bowl.",
        "A food where the broth is typically a light brown or amber color, indicating a long simmering process.",
        "A food with thinly sliced onions floating in the broth.",
        "A food where the meat is often raw when served and cooks in the hot broth."
    ],
    "pizza": [
        "A food with a round, flat base made from wheat-based dough.",
        "A food with a topping of tomato sauce spread on the base.",
        "A food with a layer of melted cheese, typically mozzarella, on top.",
        "A food with various toppings such as vegetables, meats, and seafood scattered on the cheese layer.",
        "A food with a crust around the edges that is typically golden brown and slightly puffed up.",
        "A food that is usually cut into triangular slices for serving.",
        "A food with a greasy or shiny surface due to the melted cheese and oils from the toppings.",
        "A food with a baked appearance, showing signs of browning or charring on the cheese and crust.",
        "A food with additional garnishes like fresh basil leaves, oregano, or chili flakes sprinkled on top.",
        "A food with a thin to medium thickness, although some variations may have a thick, bread-like base.",
        "A food that may have visible bubbles or blisters on the crust due to the baking process.",
        "A food that may have a slightly charred or blackened bottom, especially if it's cooked in a wood-fired oven.",
        "A food that may have a dusting of flour or cornmeal on the bottom, used to prevent sticking during the baking process.",
        "A food that may have a drizzle of olive oil or a swirl of sauce on top for added flavor.",
        "A food that may have a stuffed crust, filled with cheese or other ingredients."
    ],
    "pork chop": [
        "A food with a bone running along one side or sometimes in the middle.",
        "A food with a light pink to white color when raw.",
        "A food with a browned, slightly charred surface when cooked.",
        "A food with a thick, often marbled, meaty portion.",
        "A food with a texture that appears fibrous and dense.",
        "A food that may have a layer of fat along one edge.",
        "A food that is typically served in a thick, rectangular or oval cut.",
        "A food that may be seen with grill marks if it has been barbecued or grilled.",
        "A food that may be breaded or glazed in some preparations.",
        "A food that may be accompanied by apple sauce, mashed potatoes, or vegetables in a traditional serving.",
        "A food that may have a moist and shiny appearance if it's cooked with a sauce or gravy.",
        "A food that may appear dry and slightly tough if overcooked.",
        "A food that may be seen with a herb garnish, such as rosemary or thyme.",
        "A food that may be seen in a pan-seared preparation, with a golden-brown crust.",
        "A food that may be seen in a boneless presentation, looking more like a steak."
    ],
    "poutine": [
        "A food with thick-cut, golden-brown French fries.",
        "A food with a generous topping of cheese curds.",
        "A food with a dark, rich gravy poured over the top.",
        "A food with the cheese curds partially melted from the heat of the fries and gravy.",
        "A food with a layered structure, with fries at the bottom, cheese curds in the middle, and gravy on top.",
        "A food with a gooey and slightly messy appearance due to the melted cheese and gravy.",
        "A food with a savory and hearty presentation, often served in a bowl or a plate.",
        "A food with a glossy sheen on the surface due to the gravy.",
        "A food with a contrast of colors - the yellow of the fries, the white of the cheese curds, and the brown of the gravy.",
        "A food with a texture that appears both crispy (from the fries) and soft (from the cheese curds and gravy).",
        "A food that is typically served hot, as indicated by steam rising from the dish in the photo.",
        "A food that may occasionally be garnished with fresh herbs like parsley or chives."
    ],
    "prime rib": [
        "A food with a large, bone-in cut.",
        "A food with a rich marbling of fat throughout the meat.",
        "A food with a dark, crispy outer layer.",
        "A food with a pink, juicy interior when cooked medium-rare.",
        "A food with a thick layer of fat on one side.",
        "A food that is typically served in thick slices.",
        "A food with a robust, beefy flavor.",
        "A food that is often served with a side of au jus or horseradish sauce.",
        "A food that is typically roasted in the oven.",
        "A food that is often presented as a large, whole roast before being sliced.",
        "A food that is usually cooked on the bone for added flavor.",
        "A food that is often served as a centerpiece dish for special occasions.",
        "A food that is typically more expensive than other cuts of beef.",
        "A food that is often served with traditional sides like mashed potatoes or vegetables.",
        "A food that is often garnished with fresh herbs like rosemary or thyme."
    ],
    "pulled pork sandwich": [
        "A food with shredded or 'pulled' meat, typically pork, as the main ingredient.",
        "A food with a soft, often toasted, bun or roll as the outer layer.",
        "A food with a moist and juicy texture, often due to the use of a sauce or marinade.",
        "A food with a smoky or barbecued flavor, indicative of the common cooking method for the pork.",
        "A food with a tangy or sweet sauce, often barbecue or vinegar-based, mixed in with the meat or drizzled on top.",
        "A food with additional toppings such as coleslaw, pickles, or onions, often placed on top of the meat.",
        "A food with a hearty and filling appearance, due to the substantial amount of meat used.",
        "A food with a generally messy appearance, as the sauce and toppings often spill out from the bun.",
        "A food with a brownish color, due to the cooked pork and sauce used.",
        "A food that is typically served with sides such as fries, baked beans, or cornbread, often visible in the photo.",
        "A food that is often served on a paper plate or with a paper napkin, indicative of its popularity at casual dining establishments and outdoor events."
    ],
    "ramen": [
        "A food with thin, long, and slightly curly noodles.",
        "A food with a broth that can be clear, milky, or soy-based.",
        "A food with toppings such as sliced pork, green onions, and boiled eggs.",
        "A food with a slice of seaweed (nori) or corn as garnish.",
        "A food with a serving of bamboo shoots (menma).",
        "A food with a small pile of bean sprouts.",
        "A food with a dollop of spicy red paste or a pat of butter on top.",
        "A food with a serving of fish cake (narutomaki) with a pink swirl.",
        "A food with a serving of chopped leeks or onions.",
        "A food with a serving of mushrooms, typically shiitake or wood ear.",
        "A food with a serving of spinach or bok choy.",
        "A food with a serving of tempura, typically shrimp or vegetable.",
        "A food with a serving of kamaboko (a type of cured surimi).",
        "A food with a serving of chicken, beef, or seafood, typically in slices.",
        "A food with a serving of tofu or other vegetarian protein options.",
        "A food with a serving of sesame seeds sprinkled on top.",
        "A food with a serving of chili oil or other spicy condiments on the side.",
        "A food typically served in a large, deep bowl.",
        "A food with a serving of pickled ginger or pickled vegetables.",
        "A food with a serving of roasted garlic or garlic oil."
    ],
    "ravioli": [
        "A food with a square or circular shape.",
        "A food with a sealed edge around the perimeter.",
        "A food with a smooth or ridged texture on the surface.",
        "A food with a size typically ranging from one to two inches in diameter.",
        "A food that appears to be stuffed, often visible at the edges where the pasta is sealed.",
        "A food that is typically served with a sauce, often tomato-based or cream-based.",
        "A food that may have visible herbs or spices on top.",
        "A food that may be served in a soup or broth.",
        "A food that may be fried or boiled, with a slightly glossy or matte finish.",
        "A food that may have a slightly yellow or off-white color, depending on the type of pasta used.",
        "A food that may have a green, red, or orange hue if the pasta is flavored with spinach, beet, or tomato.",
        "A food that may have a browned or crispy surface if it is baked or fried.",
        "A food that may be served alongside other Italian dishes, such as spaghetti or lasagna.",
        "A food that may be garnished with grated cheese, such as Parmesan.",
        "A food that may have a meat, cheese, or vegetable filling, visible if the ravioli is cut open."
    ],
    "red velvet cake": [
        "A food with a deep red or bright red color.",
        "A food with a layered structure, often separated by white or cream-colored frosting.",
        "A food with a smooth, creamy frosting that is typically cream cheese-based.",
        "A food with a crumbly texture visible on the sides or in a cross-section.",
        "A food that is typically round in shape, although it can also be found in square or rectangular forms.",
        "A food that may have a dusting of red crumbs or sprinkles on top.",
        "A food that may have a decorative pattern or design made with frosting on top.",
        "A food that is typically served in slices, revealing its layered structure.",
        "A food that may have a slightly glossy appearance due to the moisture content in the cake.",
        "A food that may have a slightly domed top, especially if it is a homemade version.",
        "A food that may have a thin layer of frosting on the sides, revealing the color and texture of the cake underneath.",
        "A food that may have a slightly denser texture compared to other types of cakes, visible in a close-up photo.",
        "A food that may have a moist appearance, indicating the use of buttermilk or vinegar in the recipe.",
        "A food that may have a slightly browned edge, especially if it is a homemade version.",
        "A food that may have a slightly uneven surface, especially if it is a homemade version."
    ],
    "risotto": [
        "A food with a creamy, slightly loose consistency.",
        "A food that appears to be a type of rice dish.",
        "A food with grains that are often short, plump, and slightly translucent.",
        "A food that may contain visible ingredients such as mushrooms, peas, seafood, or cheese.",
        "A food that is often served in a shallow dish or bowl.",
        "A food that may have a glossy sheen, indicating the presence of butter or cheese.",
        "A food that may have a light to deep yellow color, depending on the ingredients used.",
        "A food that may have a sprinkling of herbs or grated cheese on top.",
        "A food that may have a slightly uneven texture due to the mix of rice and other ingredients.",
        "A food that may show signs of being stirred frequently during cooking, such as a slightly wavy or rippled surface.",
        "A food that may have a slightly sticky appearance due to the starch released by the rice during cooking.",
        "A food that may have small pieces of meat or vegetables mixed in with the rice.",
        "A food that may have a slightly saucy appearance, but not as liquid as a soup.",
        "A food that may have a slightly toasted or browned top, if it has been finished in the oven.",
        "A food that may have a garnish of fresh herbs, such as parsley or basil, on top."
    ],
    "samosa": [
        "A food with a triangular or cone shape.",
        "A food with a golden-brown, crispy exterior.",
        "A food with visible folds or pleats on its surface.",
        "A food with a fried or baked outer layer.",
        "A food with a filling that can be seen when it's broken or bitten into.",
        "A food with a savory filling, often consisting of spiced potatoes, onions, peas, lentils, and sometimes meat.",
        "A food that is typically small enough to be eaten in a few bites.",
        "A food that is often served with a side of chutney or sauce.",
        "A food that is commonly found in Indian cuisine.",
        "A food with a flaky or crumbly texture on the outside.",
        "A food that is typically served as an appetizer or snack.",
        "A food that can be seen in both sweet and savory versions, though the savory version is more common.",
        "A food that may have seeds like sesame or nigella sprinkled on top.",
        "A food that may have a slightly greasy appearance due to being deep-fried.",
        "A food that may have a green or red filling, indicating the presence of peas or meat respectively."
    ],
    "sashimi": [
        "A food with thin, raw slices of seafood, often served over a garnish.",
        "A food with a vibrant, fresh color, indicating the freshness of the seafood.",
        "A food with a smooth, glossy texture, which is a characteristic of raw fish.",
        "A food with a variety of seafood types, including but not limited to tuna, salmon, octopus, and shrimp.",
        "A food with no visible cooking or grilling marks, as the seafood is served raw.",
        "A food often served with soy sauce, wasabi, and pickled ginger on the side.",
        "A food that is typically not garnished with heavy sauces or spices, to preserve the natural flavor of the seafood.",
        "A food that is often presented in a minimalist, elegant style, reflecting its Japanese origins.",
        "A food that may be served on a bed of shredded daikon radish, which is a common garnish for sashimi.",
        "A food that may include thin slices of vegetables for added color and texture.",
        "A food that is typically served chilled, which can be inferred from the presence of ice or a chilled plate in the photo.",
        "A food that may include slices of different seafood in one serving, indicating a sashimi platter.",
        "A food that may be served on a wooden sushi board or a ceramic dish, which are traditional ways of serving sashimi.",
        "A food that may include edible flowers or leaves as garnish, adding to the aesthetic presentation of the dish.",
        "A food that may include a small mound of wasabi, a green, spicy Japanese horseradish used as a condiment for sashimi."
    ],
    "scallops": [
        "A food with a round, flat shape.",
        "A food with a white, slightly translucent color.",
        "A food with a firm, slightly springy texture.",
        "A food with a size typically ranging from 1.5 to 2 inches in diameter.",
        "A food that may have a slight orange or pink hue, especially in the case of sea scallops.",
        "A food that is often presented in a shell, which is fan-shaped and ridged.",
        "A food that may have a slightly wet or glossy appearance, especially when fresh.",
        "A food that is typically served in multiples due to its small size.",
        "A food that may have a slightly caramelized or seared surface if cooked.",
        "A food that is often seen in seafood dishes, especially in fine dining.",
        "A food that may be seen raw in sushi or sashimi dishes.",
        "A food that may be seen in a creamy sauce or alongside pasta in a photograph.",
        "A food that may be seen skewered or grilled in some cuisines.",
        "A food that may be seen alongside other seafood such as shrimp or lobster in a seafood platter.",
        "A food that may be seen in a soup or stew, especially in Asian cuisines."
    ],
    "seaweed salad": [
        "A food with a vibrant green color.",
        "A food with a wet, glossy, and slightly translucent appearance.",
        "A food with thin, stringy, and sometimes curly or wavy textures.",
        "A food that may contain small sesame seeds scattered throughout.",
        "A food that may be served in a small mound or pile, rather than spread out or layered.",
        "A food that may have small pieces of red pepper or other colorful vegetables mixed in for contrast.",
        "A food that may be served on a small plate or in a bowl, often as a side dish.",
        "A food that may appear in a variety of shades of green, from bright lime to deep forest, depending on the type of seaweed used.",
        "A food that may have a slightly slimy or slippery appearance due to the marinade or dressing.",
        "A food that may be garnished with a sprinkle of white or black sesame seeds on top.",
        "A food that may have a slightly uneven, rough texture due to the natural form of the seaweed.",
        "A food that may be served cold, as indicated by condensation on the serving dish or a cool color palette in the photo.",
        "A food that may be served alongside sushi or other Japanese dishes, indicating its cultural origin.",
        "A food that may have small, thin strips of carrot or other vegetables mixed in for added color and texture.",
        "A food that may have a slightly crinkled or wrinkled appearance, depending on the type of seaweed used."
    ],
    "shrimp and grits": [
        "A food with small, pink, curved seafood pieces, which are shrimps.",
        "A food with a creamy, white or yellowish base, which is the grits.",
        "A food with a texture that appears grainy and thick, characteristic of grits.",
        "A food with garnishes such as chopped green onions or parsley on top.",
        "A food with visible pieces of bacon or sausage, often included in shrimp and grits.",
        "A food with a sauce that is often reddish or brownish, typically made from the shrimp's cooking juices.",
        "A food with cheese melted into the base, as cheese is often mixed into the grits.",
        "A food with a side of bread or toast, often served with shrimp and grits.",
        "A food with a presentation that is typically layered, with grits at the bottom and shrimp on top.",
        "A food with a portion size that is typically individual, as shrimp and grits is often served as a single dish.",
        "A food with a combination of seafood and grain, a unique characteristic of shrimp and grits.",
        "A food with a color palette that is primarily pink (shrimp), white or yellow (grits), and green (garnish).",
        "A food with a glossy appearance on the seafood, indicating the shrimp has been cooked and glazed.",
        "A food with a creamy and slightly lumpy texture, indicative of the grits.",
        "A food with a serving style that is often in a bowl or deep dish to accommodate the grits."
    ],
    "spaghetti bolognese": [
        "A food with long, thin, cylindrical pasta strands.",
        "A food with a rich, red, meat-based sauce.",
        "A food where the sauce often contains finely chopped or minced beef.",
        "A food with visible pieces of tomato or tomato sauce.",
        "A food that may have visible pieces of onion, celery, and carrot.",
        "A food that may be garnished with grated hard cheese, such as Parmesan.",
        "A food where the pasta and sauce are typically mixed together before serving.",
        "A food that may be served with a side of bread.",
        "A food that may have a sprinkling of herbs, such as basil or oregano, on top.",
        "A food that is typically served on a plate or in a shallow bowl.",
        "A food that may have a glossy appearance due to the oil or fat in the sauce.",
        "A food where the pasta is typically cooked until it is al dente, or firm to the bite.",
        "A food where the sauce is typically simmered for a long time, resulting in a deep, complex flavor.",
        "A food that is typically served hot.",
        "A food that is a staple of Italian cuisine, but is popular worldwide."
    ],
    "spaghetti carbonara": [
        "A food with long, thin, cylindrical pasta strands.",
        "A food with a creamy, off-white to light yellow sauce.",
        "A food with visible pieces of cooked pancetta or guanciale (Italian cured pork cheek).",
        "A food with a slightly glossy or shiny appearance due to the egg-based sauce.",
        "A food with specks of black pepper scattered throughout.",
        "A food with grated cheese, typically Pecorino Romano or Parmigiano-Reggiano, sprinkled on top.",
        "A food that may be garnished with a sprinkle of fresh chopped parsley.",
        "A food that may have a slightly yellow hue if egg yolks are used in the sauce.",
        "A food that is typically served in a deep dish or bowl.",
        "A food that may have a slightly runny or liquid sauce if it is freshly made and not overcooked.",
        "A food that may have a slightly crispy texture in parts where the pancetta or guanciale has been fried before being added to the dish.",
        "A food that may have a slightly stringy appearance when lifted with a fork due to the cheese in the sauce.",
        "A food that may have a slightly uneven distribution of sauce, with some parts of the pasta having more sauce than others.",
        "A food that may have a slightly lumpy texture in parts where the cheese has melted into the sauce.",
        "A food that may have a slightly greasy appearance due to the use of olive oil or the fat rendered from the pancetta or guanciale."
    ],
    "spring rolls": [
        "A food with a cylindrical shape.",
        "A food with a light golden-brown, crispy exterior when fried.",
        "A food with a translucent, soft, and slightly sticky exterior when fresh.",
        "A food with visible, thinly sliced vegetables and/or meat through the translucent wrapper when fresh.",
        "A food with a size typically ranging from 2 to 4 inches in length.",
        "A food with a thin, paper-like wrapper made from rice or wheat.",
        "A food with a filling that may include ingredients like shrimp, pork, chicken, or a variety of vegetables.",
        "A food that is often served with a side of dipping sauce.",
        "A food that can be seen cut in half, revealing a colorful interior of various ingredients.",
        "A food that is typically served in multiples, often arranged in a pile or side by side.",
        "A food that may be seen deep-fried, steamed, or served fresh and uncooked.",
        "A food that is commonly found in Asian cuisine, particularly Vietnamese and Chinese.",
        "A food that may be served as an appetizer, snack, or part of a main meal.",
        "A food that may be seen in a takeout container, especially from Asian restaurants.",
        "A food that may be seen wrapped in lettuce leaves or served with fresh herbs on the side in some Vietnamese versions."
    ],
    "steak": [
        "A food with a thick, hearty appearance, often rectangular or oblong in shape.",
        "A food with a rich, brown exterior that can range from light to dark depending on the level of cooking.",
        "A food with a pink to red interior if it's cooked to rare or medium-rare.",
        "A food with a white, grey, or brown interior if it's cooked to medium, medium-well, or well-done.",
        "A food with visible grill marks or a seared crust.",
        "A food with a juicy, moist texture visible in the photo.",
        "A food with a fibrous texture, indicating the presence of muscle fibers.",
        "A food that is often served on a plate with sides like vegetables, potatoes, or sauces.",
        "A food with a marbled appearance, indicating the presence of fat within the muscle tissue.",
        "A food that may have a bone attached or visible, such as in a T-bone or ribeye steak.",
        "A food that may be garnished with herbs, butter, or a sauce.",
        "A food that may be cut into slices, revealing the interior doneness and texture.",
        "A food that may have a shiny or glossy exterior due to oil or butter used in cooking.",
        "A food that may have a slightly charred or caramelized exterior.",
        "A food that may be served on a wooden board or a sizzling hot plate in some restaurants."
    ],
    "strawberry shortcake": [
        "A food with a layer of sweet biscuits or sponge cake at the bottom.",
        "A food with a layer of fresh, red strawberries on top of the biscuit or sponge cake.",
        "A food with a generous dollop of whipped cream on top of the strawberries.",
        "A food with a bright red and white color scheme, due to the strawberries and whipped cream.",
        "A food with a moist appearance, as the juice from the strawberries often soaks into the biscuit or sponge cake.",
        "A food with a layered structure, typically biscuit or sponge cake, strawberries, and whipped cream.",
        "A food with a round or square shape, depending on how the biscuit or sponge cake is cut.",
        "A food with a soft texture visible in the sponge cake or biscuit, contrasting with the juicy strawberries.",
        "A food with a glossy appearance on the strawberry layer due to the natural juice or added glaze.",
        "A food with a fluffy and light appearance of the whipped cream on top.",
        "A food with occasional garnishes such as mint leaves or additional fruits.",
        "A food with strawberries that may be sliced, halved, or whole, depending on the style of the shortcake.",
        "A food with potential variations in color and texture, depending on whether the strawberries are fresh or cooked."
    ],
    "sushi": [
        "A food with small, bite-sized portions.",
        "A food with a combination of rice, fish, and vegetables.",
        "A food with a cylindrical shape, often wrapped in seaweed.",
        "A food with raw or cooked seafood.",
        "A food with a variety of colors, often from the use of different types of fish and vegetables.",
        "A food with a side of soy sauce, wasabi, and pickled ginger.",
        "A food with a presentation on a wooden platter or a sushi boat.",
        "A food with rice that appears slightly shiny due to the use of vinegar.",
        "A food with thin slices of raw fish laid over a mound of vinegared rice, known as nigiri.",
        "A food with a roll of rice, fish, and vegetables wrapped in a thin, flat piece of seaweed, known as maki.",
        "A food with a hand-formed ball of rice with a topping or filling, known as temaki.",
        "A food with a small clump of rice with a slice of raw fish on top, secured with a thin band of seaweed, known as sashimi.",
        "A food with a variety of textures, from the softness of the fish to the slight crunch of the vegetables.",
        "A food with a garnish of thinly sliced radish, carrot, or cucumber.",
        "A food with a topping or filling of fish roe.",
        "A food with a topping or filling of egg omelette.",
        "A food with a topping or filling of pickled vegetables.",
        "A food with a topping or filling of cream cheese or avocado.",
        "A food with a topping or filling of tempura shrimp or vegetables.",
        "A food with a topping or filling of eel or other types of seafood."
    ],
    "tacos": [
        "A food with a folded or rolled tortilla shell.",
        "A food with a variety of fillings including meats, beans, cheese, and vegetables.",
        "A food with toppings such as salsa, guacamole, sour cream, or cilantro.",
        "A food with a hard or soft shell, often made from corn or flour.",
        "A food with a shape that is typically round or oval and can be held in one hand.",
        "A food with a colorful presentation due to the variety of ingredients used.",
        "A food with a layered structure, where fillings are visible between the folds of the tortilla.",
        "A food that is often served with lime wedges or other citrus fruits on the side.",
        "A food that may have a sprinkling of shredded cheese on top.",
        "A food that may be garnished with fresh herbs, typically cilantro.",
        "A food that may have a side of refried beans or rice in the photo.",
        "A food that may be served with a side of salsa or hot sauce.",
        "A food that may be served in a metal taco stand or holder.",
        "A food that may be served on a flat surface, as it does not stand up on its own when the tortilla is soft.",
        "A food that may be served in a group, as tacos are often eaten in multiples.",
        "A food that may have a visible layer of lettuce or other greens.",
        "A food that may have a visible layer of diced tomatoes or onions.",
        "A food that may have a visible layer of grilled or sautéed peppers.",
        "A food that may have a visible layer of shredded or ground meat, such as beef, chicken, or pork.",
        "A food that may have a visible layer of fish or seafood, in the case of fish or shrimp tacos."
    ],
    "takoyaki": [
        "A food with small, round shapes, similar to golf balls.",
        "A food with a glossy, slightly crispy exterior.",
        "A food with a soft, creamy interior visible when cut open.",
        "A food with small pieces of octopus visible inside when cut open.",
        "A food typically topped with a dark, sweet sauce.",
        "A food often garnished with green seaweed flakes.",
        "A food that is frequently sprinkled with bonito flakes.",
        "A food that is usually served in a boat-shaped container or on a plate in groups.",
        "A food that is commonly served with a toothpick or skewer for eating.",
        "A food that is often accompanied by mayonnaise as a topping.",
        "A food that is typically brown or dark in color due to the sauce.",
        "A food that is traditionally associated with Japanese cuisine.",
        "A food that is often seen in street food markets or festivals.",
        "A food that has a slightly uneven surface due to the cooking process.",
        "A food that is cooked in a special molded pan to achieve its round shape."
    ],
    "tiramisu": [
        "A food with layers of cream and sponge cake or ladyfingers.",
        "A food with a dusting of cocoa powder on top.",
        "A food with a creamy, light brown to beige color.",
        "A food with a moist texture, indicating the presence of coffee or liquor.",
        "A food that is typically served in a square or rectangular shape.",
        "A food that may show signs of mascarpone cheese in its creamy layers.",
        "A food that may have a layer of chocolate shavings on top.",
        "A food that is often served in a glass dish, showcasing its layers.",
        "A food that may have a slightly uneven top due to the dusting of cocoa powder.",
        "A food that may show signs of soaked ladyfingers when cut.",
        "A food that may have a glossy appearance due to the presence of coffee or liquor.",
        "A food that is typically served chilled, which may be indicated by condensation on the serving dish.",
        "A food that may have a dark bottom layer, indicating soaked ladyfingers or sponge cake.",
        "A food that may have a slightly wavy texture on the surface due to the use of a fork or spoon in its preparation.",
        "A food that may have a rich, creamy consistency visible in its layers."
    ],
    "tuna tartare": [
        "A food with finely chopped or minced raw tuna.",
        "A food with a bright, fresh red or pink color indicative of raw tuna.",
        "A food often presented in a stacked or molded form.",
        "A food typically garnished with sesame seeds, chives, or other herbs.",
        "A food that may be served with a side of thinly sliced avocado or cucumber.",
        "A food that may be accompanied by a soy-based or citrus-based sauce.",
        "A food that may be presented on a bed of greens or with a side of crispy wonton chips.",
        "A food that may have a layer of diced mango, avocado, or cucumber mixed in.",
        "A food that may be garnished with caviar or roe on top.",
        "A food that may be served with a side of ginger or wasabi.",
        "A food that may be presented with a drizzle of sesame oil or olive oil on top.",
        "A food that may be served in a martini glass or other unique serving dish for aesthetic appeal.",
        "A food that may have a slightly glossy appearance due to the freshness of the raw tuna.",
        "A food that may be served with a side of toasted bread or crackers.",
        "A food that may have a sprinkle of sea salt or black pepper on top."
    ],
    "waffles": [
        "A food with a grid-like pattern on both sides.",
        "A food that is typically round or square in shape.",
        "A food that is golden-brown in color.",
        "A food that often has a fluffy interior and a crispy exterior.",
        "A food that is commonly served with toppings such as syrup, fruit, or whipped cream.",
        "A food that may have deep pockets or indentations.",
        "A food that is typically larger than a typical slice of bread.",
        "A food that may appear in a stack in some photos.",
        "A food that may be served with a side of bacon or eggs in some photos.",
        "A food that may be cut into quarters or other fractions.",
        "A food that may have a slightly uneven surface due to the cooking process.",
        "A food that may have a butter pat on top in some photos.",
        "A food that may be dusted with powdered sugar in some photos.",
        "A food that may be served on a plate with a fork and knife.",
        "A food that may be served in a restaurant setting or at a breakfast table.",
        "A food that may be served with a cup of coffee or a glass of orange juice in some photos.",
        "A food that may be served with a side of fresh fruit in some photos.",
        "A food that may be served with a side of sausage links in some photos.",
        "A food that may be served with a side of hash browns in some photos.",
        "A food that may be served with a side of maple syrup in some photos."
    ]
}