{
    "1991 Volkswagen Golf Hatchback": [
        "A car with a compact, boxy shape typical of hatchbacks from the early 1990s.",
        "A car with the Volkswagen logo prominently displayed on the front grille.",
        "A car with a two-door or four-door body style.",
        "A car with rectangular headlights.",
        "A car with a rear hatch door that extends down to the bumper.",
        "A car with a relatively flat roofline that slopes slightly towards the rear.",
        "A car with a small, black plastic rear spoiler.",
        "A car with a single exhaust pipe on the left side.",
        "A car with a simple, uncluttered dashboard design.",
        "A car with a three-spoke steering wheel.",
        "A car with a vertical rear window.",
        "A car with a small, square-shaped third brake light located at the top of the rear window.",
        "A car with body-colored bumpers.",
        "A car with a small, black plastic antenna on the roof.",
        "A car with a fuel filler cap located on the right rear side.",
        "A car with a license plate located in the center of the rear bumper.",
        "A car with a small, rectangular side mirrors.",
        "A car with a black trim around the windows.",
        "A car with a simple, horizontal taillight design.",
        "A car with a Volkswagen badge located on the left side of the rear hatch."
    ],
    "1993 Geo Metro Convertible": [
        "A car with a compact, two-door design.",
        "A car with a convertible soft top.",
        "A car with a small, rounded front end and rectangular headlights.",
        "A car with a short, flat rear end with square taillights.",
        "A car with a small, low-profile body.",
        "A car with a simple, unadorned interior.",
        "A car with a small, fuel-efficient engine.",
        "A car with 13-inch wheels.",
        "A car with a single exhaust pipe on the right side.",
        "A car with a small, simple grille.",
        "A car with a small trunk space.",
        "A car with a manual transmission.",
        "A car with a simple, analog dashboard.",
        "A car with a small, two-spoke steering wheel.",
        "A car with a small, rounded rear bumper.",
        "A car with a small, rounded front bumper.",
        "A car with a small, simple side mirrors.",
        "A car with a small, simple radio and climate controls.",
        "A car with a small, simple center console.",
        "A car with a small, simple glove box.",
        "A car with a small, simple instrument cluster.",
        "A car with a small, simple rearview mirror.",
        "A car with a small, simple door handles.",
        "A car with a small, simple window controls.",
        "A car with a small, simple seat controls.",
        "A car with a small, simple sun visors.",
        "A car with a small, simple interior lights.",
        "A car with a small, simple exterior trim.",
        "A car with a small, simple wheel covers.",
        "A car with a small, simple hood.",
        "A car with a small, simple fenders.",
        "A car with a small, simple roof.",
        "A car with a small, simple trunk lid.",
        "A car with a small, simple gas cap.",
        "A car with a small, simple license plate holder.",
        "A car with a small, simple windshield wipers.",
        "A car with a small, simple antenna.",
        "A car with a small, simple turn signals.",
        "A car with a small, simple brake lights.",
        "A car with a small, simple backup lights.",
        "A car with a small, simple side marker lights.",
        "A car with a small, simple parking lights.",
        "A car with a small, simple fog lights.",
        "A car with a small, simple headlights.",
        "A car with a small, simple taillights.",
        "A car with a small, simple dome light.",
        "A car with a small, simple map lights.",
        "A car with a small, simple courtesy lights.",
        "A car with a small, simple glove box light.",
        "A car with a small, simple trunk light.",
        "A car with a small, simple underhood light.",
        "A car with a small, simple ashtray light.",
        "A car with a small, simple ignition light.",
        "A car with a small, simple high beam indicator.",
        "A car with a small, simple low fuel indicator.",
        "A car with a small, simple oil pressure indicator.",
        "A car with a small, simple temperature gauge.",
        "A car with a small, simple speedometer.",
        "A car with a small, simple tachometer.",
        "A car with a small, simple odometer.",
        "A car with a small, simple trip odometer.",
        "A car with a small, simple clock.",
        "A car with a small, simple horn.",
        "A car with a small, simple seat belts.",
        "A car with a small, simple airbags.",
        "A car with a small, simple child safety locks.",
        "A car with a small, simple rear defroster.",
        "A car with a small, simple side defroster.",
        "A car with a small, simple heater.",
        "A car with a small, simple air conditioner.",
        "A car with a small, simple radio.",
        "A car with a small, simple cassette player.",
        "A car with a small, simple speakers.",
        "A car with a small, simple power outlet.",
        "A car with a small, simple cigarette lighter.",
        "A car with a small, simple cup holders.",
        "A car with a small, simple glove box.",
        "A car with a small, simple sunroof.",
        "A car with a small, simple convertible top.",
        "A car with a small, simple rearview mirror.",
        "A car with a small, simple side mirrors.",
        "A car with a small, simple vanity mirrors.",
        "A car with a small, simple floor mats.",
        "A car with a small, simple cargo net.",
        "A car with a small, simple spare tire.",
        "A car with a small, simple jack.",
        "A car with a small, simple lug wrench.",
        "A car with a small, simple tire pressure gauge.",
        "A car with a small, simple first aid kit.",
        "A car with a small, simple fire extinguisher.",
        "A car with a small, simple flares.",
        "A car with a small, simple flashlight.",
        "A car with a small, simple jumper cables.",
        "A car with a small, simple tool kit.",
        "A car with a small, simple owner's manual.",
        "A car with a small, simple warranty information.",
        "A car with a small, simple service records.",
        "A car with a small, simple registration.",
        "A car with a small, simple insurance information.",
        "A car with a small, simple roadside assistance information."
    ],
    "1993 Mercedes-Benz 300-Class Convertible": [
        "A car with a three-pointed star emblem on the front grille and trunk.",
        "A car with a rectangular, horizontally oriented grille.",
        "A car with a long hood and a short rear deck.",
        "A car with a soft-top convertible roof.",
        "A car with dual rectangular headlights on each side.",
        "A car with a wide, low stance.",
        "A car with a chrome trim around the windows and along the side.",
        "A car with a body-colored bumper.",
        "A car with a large, wide windshield.",
        "A car with a two-door design.",
        "A car with a ribbed taillight design.",
        "A car with a side mirror on each door.",
        "A car with a Mercedes-Benz badge on the right side of the trunk.",
        "A car with a single exhaust pipe on the left side.",
        "A car with alloy wheels with a five-spoke design.",
        "A car with a relatively flat trunk lid.",
        "A car with a small antenna on the rear right side.",
        "A car with a leather interior, often in a contrasting color to the exterior.",
        "A car with a four-spoke steering wheel with the Mercedes-Benz logo in the center.",
        "A car with a dashboard that features wood trim."
    ],
    "1993 Volvo 240 Sedan": [
        "A car with a boxy, rectangular shape.",
        "A car with a front-engine, rear-wheel-drive layout.",
        "A car with a prominent front grille featuring the Volvo logo.",
        "A car with rectangular headlights.",
        "A car with a long, flat hood and trunk.",
        "A car with a four-door sedan body style.",
        "A car with a solid, unibody construction.",
        "A car with a relatively high ground clearance compared to modern sedans.",
        "A car with a simple, uncluttered interior design.",
        "A car with a large, vertical rear window.",
        "A car with a single side mirror on the driver's side (in some models).",
        "A car with a distinctive, upright Volvo 'brick' style.",
        "A car with a large, comfortable seating capacity for five people.",
        "A car with a large trunk space for its class.",
        "A car with a fuel-injected four-cylinder engine.",
        "A car with a three-box design, with distinct compartments for the engine, passenger, and cargo.",
        "A car with a robust and durable design, often associated with Volvo cars of this era.",
        "A car with a simple, functional dashboard layout with large, easy-to-read gauges.",
        "A car with a distinctive, almost flat rear end design.",
        "A car with a relatively long wheelbase providing a smooth ride."
    ],
    "1994 Audi 100 Sedan": [
        "A car with a large, rectangular grille at the front.",
        "A car with the Audi logo of four interlocked rings on the front and back.",
        "A car with a sleek, aerodynamic design typical of mid-90s sedans.",
        "A car with a long, sloping hood and a short rear deck.",
        "A car with a three-box configuration with distinct areas for the engine, passenger, and cargo.",
        "A car with rectangular headlights that are flush with the body.",
        "A car with a sunroof.",
        "A car with a dual exhaust system.",
        "A car with a body-colored bumper.",
        "A car with a relatively low ground clearance.",
        "A car with alloy wheels that have a unique five-spoke design.",
        "A car with a compact spare tire mounted inside the trunk.",
        "A car with a body that measures around 194 inches in length.",
        "A car with a side profile that shows a straight beltline from the front to the rear.",
        "A car with a fuel filler door on the right rear side.",
        "A car with a rear window that slopes down to the trunk.",
        "A car with a single windshield wiper.",
        "A car with a small antenna on the rear part of the roof.",
        "A car with a rear defogger.",
        "A car with a body-colored side-view mirror on both sides."
    ],
    "1994 Audi 100 Wagon": [
        "A car with a distinctive four-ring logo on the front grille.",
        "A car with a rectangular-shaped front grille.",
        "A car with a long, boxy body shape typical of station wagons.",
        "A car with a roof rack on top.",
        "A car with a rear window that is almost vertical.",
        "A car with a rear windshield wiper.",
        "A car with a dual exhaust system.",
        "A car with a large cargo area at the back.",
        "A car with a body that is longer than it is wide.",
        "A car with a sloping front hood.",
        "A car with rectangular headlights.",
        "A car with a side mirror on each front door.",
        "A car with a fuel cap on the right side.",
        "A car with a rear tailgate that opens upwards.",
        "A car with a third brake light located at the bottom of the rear window.",
        "A car with a license plate located in the center of the rear bumper.",
        "A car with a sunroof.",
        "A car with five-spoke alloy wheels.",
        "A car with a small antenna on the rear roof.",
        "A car with a body-colored bumper."
    ],
    "1994 Audi V8 Sedan": [
        "A car with a large, rectangular grille at the front.",
        "A car with the Audi logo of four interlocked rings on the front and back.",
        "A car with a long, boxy body shape typical of 1990s sedans.",
        "A car with dual round headlights on each side.",
        "A car with a prominent rear deck lid.",
        "A car with a sunroof.",
        "A car with a dual exhaust system.",
        "A car with a body-colored bumper.",
        "A car with a relatively low ground clearance.",
        "A car with a wide, low stance.",
        "A car with a large, wide windshield and rear window.",
        "A car with a three-box design, with distinct compartments for the engine, passenger, and cargo.",
        "A car with alloy wheels.",
        "A car with a side mirror on each front door.",
        "A car with a relatively long wheelbase.",
        "A car with a high beltline, giving the windows a 'squeezed' look.",
        "A car with a small antenna on the rear part of the roof.",
        "A car with a fuel filler door on the right rear side.",
        "A car with a rectangular rear license plate area.",
        "A car with a chrome trim around the windows."
    ],
    "1997 Dodge Caravan Minivan": [
        "A car with a boxy, rectangular shape.",
        "A car with a prominent front grille featuring the Dodge emblem.",
        "A car with a long, flat roofline.",
        "A car with sliding doors on both sides.",
        "A car with large, rectangular headlights.",
        "A car with a rear window that wraps around to the sides.",
        "A car with a high ground clearance compared to other minivans.",
        "A car with a short hood and a long body.",
        "A car with a rear liftgate that opens upwards.",
        "A car with a relatively flat windshield.",
        "A car with a noticeable antenna on the right side of the roof.",
        "A car with a single exhaust pipe on the right side.",
        "A car with a spare tire located underneath the rear of the vehicle.",
        "A car with a two-tone paint job, often with the lower part being a different color.",
        "A car with a large, spacious interior visible through the windows.",
        "A car with a third brake light located in the center of the rear window.",
        "A car with a long wheelbase for a minivan.",
        "A car with a front-engine, front-wheel-drive layout.",
        "A car with a relatively simple and unadorned interior design.",
        "A car with a dashboard that extends far into the cabin."
    ],
    "1998 Eagle Talon Hatchback": [
        "A car with a compact, sporty design.",
        "A car with a hatchback body style.",
        "A car with pop-up headlights.",
        "A car with a prominent rear spoiler.",
        "A car with a two-door configuration.",
        "A car with a front-engine, front-wheel-drive layout.",
        "A car with a distinctive side window design that slopes down towards the rear.",
        "A car with a rounded front end and a flat rear end.",
        "A car with a dual exhaust system.",
        "A car with a logo that features a stylized bird in flight.",
        "A car with a long, sloping hood.",
        "A car with a short rear deck.",
        "A car with a low ground clearance.",
        "A car with a wide wheelbase for a compact car.",
        "A car with a distinctive, angular rear window design.",
        "A car with a small, compact rear end.",
        "A car with a distinctive front grille design that is narrow and horizontal.",
        "A car with a logo located centrally on the front grille.",
        "A car with a rear window wiper.",
        "A car with a high-mounted third brake light."
    ],
    "1998 Nissan 240SX Coupe": [
        "A car with a sleek, rounded body style, typical of late 90s sports cars.",
        "A car with a long hood and a short rear deck, characteristic of a front-engine, rear-wheel-drive layout.",
        "A car with pop-up headlights, a feature that was common in the 90s but is rare today.",
        "A car with a two-door coupe body style.",
        "A car with a rear spoiler, which is common on sports cars.",
        "A car with a dual exhaust system, which is often seen on performance vehicles.",
        "A car with a Nissan badge on the front and rear.",
        "A car with 240SX badging on the rear.",
        "A car with a relatively low ride height, typical of sports cars.",
        "A car with 5-spoke alloy wheels, which were common on the 240SX.",
        "A car with a small, compact size, as the 240SX is not a large vehicle.",
        "A car with a sunroof, which was an optional feature on the 240SX.",
        "A car with a simple, uncluttered interior with a focus on the driver's controls.",
        "A car with a tachometer prominently displayed in the instrument cluster, indicating its sporty nature.",
        "A car with a manual transmission, which was common on the 240SX.",
        "A car with a relatively small rear seat, as the 240SX is a 2+2 coupe.",
        "A car with a hatchback-style trunk, which is a distinguishing feature of the 240SX."
    ],
    "1999 Plymouth Neon Coupe": [
        "A car with a compact, two-door design.",
        "A car with a rounded, aerodynamic shape.",
        "A car with a prominent front grille with the Plymouth logo in the center.",
        "A car with rectangular headlights that are slightly slanted towards the center.",
        "A car with a short rear end and high-mounted taillights.",
        "A car with a small, fixed rear spoiler.",
        "A car with body-colored bumpers and side mirrors.",
        "A car with a single exhaust pipe on the right side.",
        "A car with a relatively low ground clearance.",
        "A car with a small, rounded rear window.",
        "A car with a long, sloping front hood.",
        "A car with 14-inch wheels.",
        "A car with a simple, uncluttered interior design.",
        "A car with a three-spoke steering wheel.",
        "A car with manual or automatic transmission options.",
        "A car with a relatively high roofline for a coupe.",
        "A car with a small antenna on the rear end of the roof.",
        "A car with a fuel cap located on the rear right side.",
        "A car with a small trunk opening.",
        "A car with a front-wheel drive layout."
    ],
    "2000 AM General Hummer SUV": [
        "A car with a boxy, military-style exterior design.",
        "A car with a large, wide front grille.",
        "A car with round headlights positioned on the corners of the front end.",
        "A car with a high ground clearance.",
        "A car with large, rugged tires.",
        "A car with a wide body and a flat roof.",
        "A car with a spare tire mounted on the rear.",
        "A car with a large, sturdy front bumper.",
        "A car with vertical windshield and side windows.",
        "A car with a side-hinged rear door.",
        "A car with a four-door configuration.",
        "A car with a large, prominent hood.",
        "A car with a flat, straight back end.",
        "A car with a large, rectangular side mirrors.",
        "A car with a heavy-duty roof rack.",
        "A car with a wide wheelbase.",
        "A car with a dual exhaust system.",
        "A car with a large fuel tank capacity.",
        "A car with a heavy-duty suspension system.",
        "A car with a high seating position."
    ],
    "2001 Acura Integra Type R": [
        "A car with a large rear wing spoiler.",
        "A car with a round, dual exhaust system.",
        "A car with a white five-spoke alloy wheel design.",
        "A car with a red 'R' badge on the rear.",
        "A car with a front bumper that has large, round fog lights.",
        "A car with a body-colored front grille.",
        "A car with a sunroof.",
        "A car with a body-colored side skirt.",
        "A car with a unique, round headlight design.",
        "A car with a body-colored rear bumper with a lower black trim.",
        "A car with a compact, two-door design.",
        "A car with a hatchback body style.",
        "A car with a red 'Type R' badge on the center console inside.",
        "A car with a leather-wrapped Momo steering wheel.",
        "A car with a white-faced instrument cluster with a redline starting at 8,000 RPM.",
        "A car with a close-ratio five-speed manual transmission.",
        "A car with a high-revving 1.8-liter four-cylinder engine.",
        "A car with a red engine valve cover.",
        "A car with a body-colored power side mirror.",
        "A car with a unique, round taillight design."
    ],
    "2001 Lamborghini Diablo Coupe": [
        "A car with a low, wide, and aggressive stance.",
        "A car with a wedge-shaped profile.",
        "A car with scissor-style doors that open upwards.",
        "A car with a large rear wing spoiler.",
        "A car with a rear mid-engine, rear-wheel-drive layout.",
        "A car with a long, flat rear deck.",
        "A car with a distinctive air intake ahead of the rear wheels.",
        "A car with a dual rounded headlight design.",
        "A car with a large, centrally located dual exhaust system.",
        "A car with a two-seater cabin layout.",
        "A car with a V12 engine visible through a glass cover.",
        "A car with a wide and low front end with large air intakes.",
        "A car with a distinctive Lamborghini badge on the front and rear.",
        "A car with a high-mounted stop lamp integrated into the upper edge of the engine cover.",
        "A car with a large rear diffuser.",
        "A car with a distinctive five-hole wheel design.",
        "A car with a small, rectangular rear window.",
        "A car with a flat, angular windshield.",
        "A car with a narrow, slatted tail light design.",
        "A car with a leather-upholstered, sporty interior."
    ],
    "2002 Daewoo Nubira Wagon": [
        "A car with a compact, five-door wagon body style.",
        "A car with a front-engine, front-wheel-drive layout.",
        "A car with a distinctive chrome grille with the Daewoo logo in the center.",
        "A car with rectangular headlights and clear lens turn signals.",
        "A car with a roof rack for additional cargo.",
        "A car with a rear window wiper.",
        "A car with a rear defogger.",
        "A car with body-colored bumpers.",
        "A car with 14-inch steel wheels.",
        "A car with a relatively high ground clearance for a wagon.",
        "A car with a spacious cargo area when the rear seats are folded down.",
        "A car with a simple, functional interior design.",
        "A car with a four-speed automatic or five-speed manual transmission.",
        "A car with power windows and mirrors as standard features.",
        "A car with a cassette player and AM/FM radio in the dashboard.",
        "A car with a 2.0L, four-cylinder engine.",
        "A car with a fuel economy of around 20 miles per gallon in the city and 28 on the highway.",
        "A car with a length of about 178 inches, a width of about 67 inches, and a height of about 57 inches.",
        "A car with a wheelbase of approximately 102 inches.",
        "A car with a curb weight of around 2,800 pounds."
    ],
    "2006 Ford GT Coupe": [
        "A car with a mid-mounted, supercharged 5.4L V8 engine.",
        "A car with a distinctive wide and low body design.",
        "A car with a pair of upward-swinging doors.",
        "A car with a large, round, centrally located dual exhaust.",
        "A car with a rear spoiler that is integrated into the car's shut lines.",
        "A car with a racing stripe running down the center of the vehicle.",
        "A car with a vented front hood and large side air intakes.",
        "A car with a rear diffuser and a large rear grille for engine cooling.",
        "A car with a two-seater cockpit featuring a driver-oriented instrument panel.",
        "A car with 18-inch front and 19-inch rear BBS wheels.",
        "A car with HID headlights and LED taillights.",
        "A car with a fuel cap located on the upper rear quarter panel.",
        "A car with a small rear window that provides a view of the engine.",
        "A car with a blue oval Ford logo on the front and rear.",
        "A car with a six-speed manual transmission.",
        "A car with a color scheme that often includes white, red, blue, black, or yellow, often with contrasting stripes.",
        "A car with a 'GT' badge on the rear.",
        "A car with a front fascia that features three large cooling ducts.",
        "A car with a rear clamshell hood that opens to reveal the engine.",
        "A car with a low, aerodynamic profile reminiscent of classic race cars."
    ],
    "2007 Audi S4 Sedan": [
        "A car with a large, trapezoidal single-frame grille.",
        "A car with four rings logo on the front grille.",
        "A car with a compact and sporty body design.",
        "A car with dual exhaust outlets on the rear.",
        "A car with a roofline that slopes down towards the rear.",
        "A car with a small rear spoiler on the trunk lid.",
        "A car with xenon plus headlights with daytime running lights.",
        "A car with 18-inch alloy wheels.",
        "A car with S4 badges on the front grille and rear.",
        "A car with a wide and low stance.",
        "A car with flared wheel arches.",
        "A car with a high-gloss package with contrasting lower body parts.",
        "A car with aluminum-look exterior mirrors.",
        "A car with a sunroof.",
        "A car with a three-box body style, meaning separate compartments for the engine, passenger, and cargo.",
        "A car with a short rear overhang.",
        "A car with a long wheelbase relative to its overall length.",
        "A car with a high waistline and a low roofline.",
        "A car with a prominent crease running along the side, just below the windows.",
        "A car with a relatively flat hood and trunk lid."
    ],
    "2007 BMW 6 Series Convertible": [
        "A car with a long hood and short rear deck, typical of a grand tourer design.",
        "A car with a retractable soft-top roof.",
        "A car with a distinctive kidney-shaped grille, a signature feature of BMW.",
        "A car with dual round headlights slightly covered on top by the hood.",
        "A car with a muscular and athletic stance, with a wide and low body.",
        "A car with a chrome strip running along the side of the body.",
        "A car with a dual exhaust system.",
        "A car with 18-inch alloy wheels.",
        "A car with a high waistline and a low roofline.",
        "A car with a rear deck lid that is slightly raised, giving it a 'ducktail' appearance.",
        "A car with a wide and low front bumper with integrated fog lights.",
        "A car with a small rear window.",
        "A car with a BMW logo located in the center of the trunk lid.",
        "A car with a three-spoke steering wheel with control buttons.",
        "A car with a digital display in the center of the dashboard.",
        "A car with a gear shift located in the center console.",
        "A car with a 2+2 seating configuration.",
        "A car with a leather-wrapped interior."
    ],
    "2007 BMW X5 SUV": [
        "A car with a kidney-shaped grille, a signature feature of BMW.",
        "A car with a round BMW emblem on the hood and trunk.",
        "A car with a sleek, aerodynamic design.",
        "A car with a high ground clearance, typical of SUVs.",
        "A car with a long wheelbase and short overhangs.",
        "A car with a roofline that slopes slightly towards the rear.",
        "A car with a dual exhaust system.",
        "A car with a panoramic sunroof, a feature available in the 2007 BMW X5.",
        "A car with a rear spoiler, a feature common in the X5 series.",
        "A car with a side profile that shows a character line running from the front wheel arches to the rear tail lights.",
        "A car with large alloy wheels, typical of the X5 series.",
        "A car with a rear tailgate that is split into two sections, a unique feature of the BMW X5.",
        "A car with a muscular and robust appearance, typical of the X5 series.",
        "A car with a spacious interior, a characteristic of SUVs.",
        "A car with a dashboard that is driver-oriented, a common feature in BMW cars.",
        "A car with a three-spoke steering wheel with control buttons, a feature common in the 2007 BMW X5.",
        "A car with a gear shift lever located in the center console, a common feature in BMW cars.",
        "A car with a digital display in the center of the dashboard, a feature common in the 2007 BMW X5.",
        "A car with a rear-view camera, a feature available in the 2007 BMW X5.",
        "A car with a leather interior, a feature common in the X5 series."
    ],
    "2007 Bentley Continental Flying Spur Sedan": [
        "A car with a large, prominent grille with a 'B' emblem in the center.",
        "A car with four round headlights, two on each side of the grille.",
        "A car with a long, sleek body design.",
        "A car with a high beltline and a low roofline, giving it a sporty appearance.",
        "A car with a distinctive 'Flying B' ornament on the hood.",
        "A car with large, flared wheel arches housing 19-inch alloy wheels.",
        "A car with a short front overhang and a long rear overhang.",
        "A car with a dual exhaust system with oval-shaped tips.",
        "A car with a sloping rear end design, similar to a coupe.",
        "A car with a large, luxurious interior with high-quality leather and wood trim.",
        "A car with a split front bumper design, with the lower half housing the fog lights.",
        "A car with a large, sloping windshield and small, sleek side windows.",
        "A car with a high-mounted third brake light at the rear.",
        "A car with a Bentley logo on the center of the alloy wheels.",
        "A car with a chrome strip running along the bottom of the doors.",
        "A car with a small, sleek antenna on the rear part of the roof.",
        "A car with a large, prominent 'Bentley' badge on the back.",
        "A car with a chrome strip running along the top of the windows and wrapping around the rear of the car.",
        "A car with a large, luxurious rear seating area with ample legroom.",
        "A car with a distinctive, high-quality sound system, visible through the rear window."
    ],
    "2007 Bentley Continental GT Coupe": [
        "A car with a large, prominent grille with a 'B' emblem in the center.",
        "A car with four round headlights, two on each side of the grille.",
        "A car with a long, sloping hood.",
        "A car with a two-door design.",
        "A car with a high beltline and a low roof, giving it a 'hunkered down' appearance.",
        "A car with a short rear deck and a large, sloping rear window.",
        "A car with large, flared wheel arches housing 19-inch alloy wheels.",
        "A car with dual exhaust tips on each side of the rear.",
        "A car with a small rear spoiler integrated into the trunk lid.",
        "A car with a Bentley winged 'B' badge on the trunk lid.",
        "A car with a wide, low stance.",
        "A car with a luxurious interior, featuring high-quality leather and wood trim.",
        "A car with a large, centrally mounted infotainment screen in the dashboard.",
        "A car with a distinctive 'Bentley' treadplate on the door sills.",
        "A car with a large, round fuel filler cap on the right rear quarter panel.",
        "A car with a distinctive 'power line' that runs from the front wheel arch and along the car's side.",
        "A car with a split, two-tone paint job, with the lower half of the car a different color than the upper half.",
        "A car with a large, oval rear window.",
        "A car with a distinctive 'double horseshoe' rear design, inspired by the Bentley Continental R-Type."
    ],
    "2007 Buick Rainier SUV": [
        "A car with a chrome waterfall grille, a signature design element of Buick.",
        "A car with a prominent Buick emblem in the center of the grille.",
        "A car with a boxy, upright stance typical of traditional SUVs.",
        "A car with a roof rack for additional cargo capacity.",
        "A car with a rear window that can be opened independently of the tailgate.",
        "A car with large, round headlights on either side of the grille.",
        "A car with a long hood and a short rear deck, a design characteristic of many Buicks.",
        "A car with five-spoke alloy wheels.",
        "A car with a dual exhaust system.",
        "A car with a body-colored bumper and side mirrors.",
        "A car with a side profile that shows a high beltline and slightly flared wheel arches.",
        "A car with a rear wiper for the back window.",
        "A car with a relatively flat roofline that extends straight back to the rear of the vehicle.",
        "A car with a large, square-shaped rear tailgate.",
        "A car with rectangular-shaped taillights located at the corners of the rear end.",
        "A car with a visible antenna on the rear part of the roof.",
        "A car with a chrome strip running along the bottom of the doors.",
        "A car with a visible tow hitch at the rear, indicating its towing capabilities."
    ],
    "2007 Cadillac Escalade EXT Crew Cab": [
        "A car with a large, bold grille with the Cadillac emblem in the center.",
        "A car with rectangular, high-intensity discharge (HID) headlights.",
        "A car with a long, flat truck bed in the rear, similar to a pickup truck.",
        "A car with a large, boxy shape and a high ground clearance.",
        "A car with a distinctive side profile featuring a continuous line from the front to the back.",
        "A car with large, flared wheel arches housing 18-inch alloy wheels.",
        "A car with a roof rack for additional storage.",
        "A car with a rear window that can be removed for access to the truck bed.",
        "A car with a dual exhaust system.",
        "A car with a large, prominent Cadillac emblem on the tailgate.",
        "A car with a step bumper for easy access to the truck bed.",
        "A car with a large, luxurious interior visible through the windows.",
        "A car with a distinctive, angular design language typical of Cadillac vehicles.",
        "A car with chrome accents around the windows, door handles, and other parts of the exterior.",
        "A car with a large, wide stance and a commanding road presence.",
        "A car with a large side mirror with integrated turn signals.",
        "A car with a full-sized four-door crew cab configuration.",
        "A car with a rear defogger and rear wiper visible on the back glass.",
        "A car with a visible antenna on the roof for radio and navigation systems.",
        "A car with a visible sunroof on the top."
    ],
    "2007 Chevrolet Corvette Ron Fellows Edition Z06": [
        "A car with a unique Arctic White exterior paint.",
        "A car with a red, white, and silver color scheme, inspired by the Canadian flag.",
        "A car with a full-width racing spoiler.",
        "A car with a distinctive red and silver stripe that runs up the front fenders and onto the roof.",
        "A car with a red and black interior color scheme.",
        "A car with a special 'Corvette' logo on the front that includes the signature of Ron Fellows.",
        "A car with a unique vehicle identification number starting with '1G1YY'.",
        "A car with 'Z06' chrome badges on the front fenders.",
        "A car with a '427' logo on the hood, indicating the engine's displacement in cubic inches.",
        "A car with a 'Ron Fellows' signature on the center console.",
        "A car with a 'Z06' logo embroidered on the headrests of the seats.",
        "A car with a special edition plaque on the center console, indicating the production number of the car.",
        "A car with a 7.0L V8 engine, visible through a clear panel in the hood.",
        "A car with a six-speed manual transmission.",
        "A car with 18-inch front and 19-inch rear wheels.",
        "A car with red brake calipers.",
        "A car with high-performance Goodyear Eagle F1 Supercar tires.",
        "A car with a quad exhaust system at the rear.",
        "A car with a carbon fiber front fender.",
        "A car with a unique 'Corvette' logo on the rear end."
    ],
    "2007 Chevrolet Express Cargo Van": [
        "A car with a boxy, utilitarian shape, typical of cargo vans.",
        "A car with a large, prominent grille with the Chevrolet emblem in the center.",
        "A car with two large, swing-out doors at the rear.",
        "A car with a long, flat roofline.",
        "A car with a sliding door on the passenger side.",
        "A car with large, rectangular headlights.",
        "A car with a wide, flat windshield.",
        "A car with a high ground clearance.",
        "A car with a lack of rear windows, indicative of a cargo van.",
        "A car with a long wheelbase.",
        "A car with a single-color paint job, often white or another neutral color.",
        "A car with black, plastic bumpers.",
        "A car with a large side mirror on the driver's side.",
        "A car with a relatively high ride height compared to passenger vehicles.",
        "A car with a simple, unadorned interior visible through the front windshield.",
        "A car with a large cargo area visible through the rear doors.",
        "A car with a relatively narrow track width compared to its overall size.",
        "A car with a lack of decorative trim or bodywork.",
        "A car with a simple, functional dashboard visible through the front windshield.",
        "A car with a large fuel cap on the driver's side."
    ],
    "2007 Chevrolet Express Van": [
        "A car with a boxy, utilitarian shape, typical of full-size vans.",
        "A car with a large, prominent grille with the Chevrolet emblem in the center.",
        "A car with a long, flat hood and a nearly vertical windshield.",
        "A car with sliding doors on the passenger side.",
        "A car with large, rectangular headlights.",
        "A car with a high roofline, providing ample interior space.",
        "A car with a rear door that splits in the middle to open outward.",
        "A car with a single rear wheel on each side, unlike the dual rear wheels found on some larger vans.",
        "A car with a relatively plain, unadorned interior, designed for functionality rather than luxury.",
        "A car with a large, wide bumper at the front and rear.",
        "A car with a spare tire mounted on the rear door.",
        "A car with a long wheelbase, providing a large cargo area.",
        "A car with a lack of rear windows, or small, high-placed windows, depending on the specific model.",
        "A car with a relatively high ground clearance, typical of utility vehicles.",
        "A car with a simple, straightforward dashboard and control layout.",
        "A car with a large side mirror on each side, necessary for visibility due to the van's size.",
        "A car with a fuel cap located on the driver's side, towards the rear of the vehicle.",
        "A car with a relatively wide turning radius, due to its size and wheelbase."
    ],
    "2007 Chevrolet Impala Sedan": [
        "A car with a large, chrome bar grille that spans the width of the front end.",
        "A car with a Chevrolet emblem in the center of the front grille.",
        "A car with a long, sleek body design.",
        "A car with wrap-around headlights that extend into the front fenders.",
        "A car with a high rear deck and a short trunk lid.",
        "A car with a dual round tail lights on each side.",
        "A car with a body-colored side moldings and door handles.",
        "A car with a large, wide windshield and rear window for increased visibility.",
        "A car with 16-inch steel wheels with full wheel covers.",
        "A car with a roof that slopes down towards the rear, giving it a fastback appearance.",
        "A car with a large, spacious interior with seating for up to six passengers.",
        "A car with a dashboard that wraps around into the door panels.",
        "A car with a center console that extends from the dashboard to the rear seats.",
        "A car with a four-spoke steering wheel with control buttons.",
        "A car with a dual exhaust system."
    ],
    "2007 Chevrolet Malibu Sedan": [
        "A car with a split grille design, with the Chevrolet emblem in the center.",
        "A car with a long, sleek body and a slightly sloping roofline.",
        "A car with wraparound headlights that extend into the front fenders.",
        "A car with a short rear deck and large, wraparound taillights.",
        "A car with a chrome strip running along the bottom of the side windows.",
        "A car with a body-colored bumper and door handles.",
        "A car with 15-inch steel wheels with full wheel covers.",
        "A car with a high-mounted third brake light.",
        "A car with dual exhaust outlets on some models.",
        "A car with a relatively flat hood and trunk.",
        "A car with a small antenna mounted on the rear of the roof.",
        "A car with a relatively low ground clearance.",
        "A car with a compact spare tire mounted inside the trunk.",
        "A car with a spacious interior with a two-tone color scheme.",
        "A car with a dashboard that wraps around into the door panels.",
        "A car with a three-spoke steering wheel with mounted controls.",
        "A car with a center console that houses the gear shift and cup holders.",
        "A car with a digital information display located in the instrument cluster.",
        "A car with a split-folding rear seat for additional cargo space.",
        "A car with a keyless entry system."
    ],
    "2007 Chevrolet Monte Carlo Coupe": [
        "A car with a two-door coupe body style.",
        "A car with a split grille design, with the Chevrolet emblem in the center.",
        "A car with a long, sloping rear end and a short deck.",
        "A car with a high beltline and a low roofline.",
        "A car with large, wraparound headlights that extend into the front fenders.",
        "A car with a muscular and aggressive stance.",
        "A car with a rear spoiler on some models.",
        "A car with dual exhaust outlets on some models.",
        "A car with a large, wide windshield for increased visibility.",
        "A car with a hood that slopes down towards the front, giving it a streamlined appearance.",
        "A car with a distinctive C-pillar design that slopes down towards the rear of the car.",
        "A car with 17-inch alloy wheels on some models.",
        "A car with a relatively long wheelbase for a coupe, providing a smooth ride.",
        "A car with a large Chevrolet emblem on the rear end.",
        "A car with a wide stance, providing increased stability.",
        "A car with a distinctive, sporty appearance that sets it apart from other Chevrolet models."
    ],
    "2007 Chevrolet Silverado 1500 Classic Extended Cab": [
        "A car with a large, rectangular grille with a prominent Chevrolet emblem in the center.",
        "A car with a boxy, rugged exterior design.",
        "A car with a long bed behind the passenger cabin, indicative of a pickup truck.",
        "A car with two full-size front doors and smaller, rear-hinged back doors.",
        "A car with a high ground clearance and large, sturdy tires.",
        "A car with a large, prominent bumper and tow hooks at the front.",
        "A car with a step bumper at the rear for easy access to the truck bed.",
        "A car with a dual stacked headlight design on each side of the grille.",
        "A car with a long, horizontal tail light design on each side of the tailgate.",
        "A car with a large, square-shaped side mirrors for better visibility.",
        "A car with a visible exhaust pipe on the right side.",
        "A car with a body-colored or chrome front bumper, depending on the trim level.",
        "A car with a visible antenna on the right front fender.",
        "A car with a Chevrolet logo on the center of the tailgate.",
        "A car with a 'Vortec' badge on the front side panel, indicating the engine type.",
        "A car with a 'Silverado' badge on the lower part of the front doors.",
        "A car with a '1500' badge on the side of the front doors, indicating the model variant.",
        "A car with a 'Classic' badge on the tailgate, indicating the specific model year."
    ],
    "2007 Dodge Caliber Wagon": [
        "A car with a bold, upright stance and a high beltline.",
        "A car with a crosshair grille, a signature design element of Dodge.",
        "A car with a blacked-out B-pillar for a 'floating roof' effect.",
        "A car with a rear liftgate instead of a traditional trunk.",
        "A car with a compact and boxy shape, typical of a wagon body style.",
        "A car with large, round headlights on either side of the grille.",
        "A car with a relatively flat hood and a steeply raked windshield.",
        "A car with a rear spoiler integrated into the top of the liftgate.",
        "A car with a two-tone interior with a unique, futuristic design.",
        "A car with a center console that can slide forward and backward.",
        "A car with a rear cargo floor that can be configured in different ways.",
        "A car with a 1.8L, 2.0L, or 2.4L four-cylinder engine.",
        "A car with a continuously variable transmission (CVT).",
        "A car with 17-inch steel wheels or optional alloy wheels.",
        "A car with optional all-wheel drive.",
        "A car with a length of approximately 173.8 inches and a width of approximately 68.8 inches.",
        "A car with a height of approximately 60.4 inches.",
        "A car with a wheelbase of approximately 103.7 inches."
    ],
    "2007 Dodge Dakota Club Cab": [
        "A car with a compact pickup truck body style.",
        "A car with a front grille that is divided into four sections by a cross-shaped chrome bar.",
        "A car with a Club Cab, which is an extended cab with small, rear-hinged back doors.",
        "A car with a rounded front end and rectangular headlights.",
        "A car with a flat, horizontal hood.",
        "A car with a bed that is approximately the same length as the cab.",
        "A car with a rear bumper that is flush with the tailgate.",
        "A car with a Dodge emblem in the center of the front grille.",
        "A car with a relatively high ground clearance.",
        "A car with a single exhaust pipe located on the right side.",
        "A car with a body-colored front bumper.",
        "A car with a relatively short wheelbase for a pickup truck.",
        "A car with a side mirror on each front door.",
        "A car with a visible antenna on the right side of the front hood.",
        "A car with a two-tone paint job, often with the lower part being a different color.",
        "A car with a rear window that is almost the same width as the cab.",
        "A car with a six-lug wheel pattern.",
        "A car with a fuel cap located on the left side.",
        "A car with a spare tire located under the bed at the rear.",
        "A car with a visible towing hitch at the rear."
    ],
    "2007 Dodge Durango SUV": [
        "A car with a large, boxy shape, typical of mid-2000s SUVs.",
        "A car with a prominent front grille featuring a crosshair design, a signature of Dodge vehicles.",
        "A car with a large, square-shaped headlight on each side of the grille.",
        "A car with a hood that slopes down towards the front, creating a more aerodynamic look.",
        "A car with a high ground clearance, typical of SUVs.",
        "A car with a flat, vertical rear end with large, rectangular taillights.",
        "A car with a roof rack for additional storage.",
        "A car with a spare tire mounted under the rear of the vehicle.",
        "A car with a side profile that shows a long, straight roofline.",
        "A car with a large side mirror on each door.",
        "A car with a short front overhang and a longer rear overhang.",
        "A car with a rear window that is almost vertical.",
        "A car with a rear wiper on the back window.",
        "A car with a large, wide windshield.",
        "A car with a Dodge emblem on the front and rear.",
        "A car with five-spoke alloy wheels.",
        "A car with a fuel cap located on the left rear side.",
        "A car with a visible tow hitch at the rear.",
        "A car with a dual exhaust system.",
        "A car with a Durango badge on the rear."
    ],
    "2007 Ford F-150 Regular Cab": [
        "A car with a large, bold grille that prominently features the Ford logo.",
        "A car with a boxy, upright cab design.",
        "A car with a single row of seating, indicating it's a regular cab model.",
        "A car with a long, flat truck bed.",
        "A car with large, round headlights on either side of the grille.",
        "A car with a high ground clearance and large, rugged tires.",
        "A car with a side mirror that extends out on a large, visible arm.",
        "A car with a visible tow hitch at the back.",
        "A car with a rectangular, vertical tail light design.",
        "A car with a Ford logo on the tailgate.",
        "A car with a fuel cap located on the driver's side.",
        "A car with a visible antenna on the right front fender.",
        "A car with a two-door design, typical of regular cab models.",
        "A car with a visible spare tire under the rear truck bed.",
        "A car with a step bumper at the back for easy access to the truck bed.",
        "A car with a solid rear window, without any sliding feature.",
        "A car with a hood that has a slight bulge in the middle, giving it a muscular appearance.",
        "A car with a visible F-150 badge on the side of the truck bed.",
        "A car with a straight, horizontal body line running from the front to the back.",
        "A car with a visible exhaust pipe on the right side."
    ],
    "2007 Ford Focus Sedan": [
        "A car with a compact, four-door sedan body style.",
        "A car with a trapezoidal front grille, which is a signature of Ford vehicles.",
        "A car with a blue oval Ford emblem at the center of the front grille.",
        "A car with clear lens halogen headlamps.",
        "A car with a body-colored front and rear bumper.",
        "A car with a high-mounted rear stop light.",
        "A car with body-colored door handles and side mirrors.",
        "A car with 15-inch steel wheels with 6-spoke wheel covers.",
        "A car with a short rear deck and a relatively high trunk.",
        "A car with a single exhaust pipe on the right side.",
        "A car with a relatively flat roofline.",
        "A car with a small antenna mounted on the rear roof.",
        "A car with a rear defogger.",
        "A car with a relatively long wheelbase for a compact car.",
        "A car with a fuel filler door on the passenger side.",
        "A car with a relatively narrow track width.",
        "A car with a compact spare tire mounted inside the trunk.",
        "A car with a simple, functional interior design.",
        "A car with a two-tone interior color scheme.",
        "A car with a center console with storage and cup holders.",
        "A car with manual air conditioning controls.",
        "A car with a 4-speaker audio system.",
        "A car with power windows and door locks.",
        "A car with a tilt and telescopic steering wheel.",
        "A car with a driver's seat height adjuster.",
        "A car with a split folding rear seat.",
        "A car with a tachometer and a trip odometer.",
        "A car with dual front airbags and front side-impact airbags.",
        "A car with a remote keyless entry system.",
        "A car with a 2.0L 4-cylinder engine under the hood.",
        "A car with a 5-speed manual or 4-speed automatic transmission.",
        "A car with front-wheel drive.",
        "A car with power-assisted rack-and-pinion steering.",
        "A car with front disc and rear drum brakes.",
        "A car with a MacPherson strut front suspension and a multi-link rear suspension.",
        "A car with a front stabilizer bar.",
        "A car with a battery saver feature.",
        "A car with a low tire pressure warning system.",
        "A car with a child safety rear door locks.",
        "A car with a rear window wiper and washer."
    ],
    "2007 Ford Freestar Minivan": [
        "A car with a large, boxy shape typical of minivans.",
        "A car with a prominent blue oval Ford logo on the front grille.",
        "A car with a horizontal bar grille design.",
        "A car with large, rectangular headlights on either side of the grille.",
        "A car with a relatively flat hood and windshield.",
        "A car with sliding doors on both sides for rear passengers.",
        "A car with a high roofline to accommodate up to seven passengers.",
        "A car with a rear liftgate that opens upwards.",
        "A car with a short front overhang and a longer rear overhang.",
        "A car with a rear window that wraps around to the sides of the vehicle.",
        "A car with a roof rack for additional storage.",
        "A car with 16-inch steel wheels.",
        "A car with body-colored bumpers and side mirrors.",
        "A car with a rear wiper for the back window.",
        "A car with a visible exhaust pipe on the right side at the back.",
        "A car with a 'Freestar' badge on the left side of the rear liftgate.",
        "A car with a 'Ford' badge on the right side of the rear liftgate.",
        "A car with a third brake light located at the bottom of the rear window.",
        "A car with a fuel filler door located on the driver's side.",
        "A car with a two-tone interior, typically grey or beige."
    ],
    "2007 Ford Mustang Convertible": [
        "A car with a long hood and short rear deck, a design characteristic of the Mustang.",
        "A car with a galloping horse emblem on the front grille.",
        "A car with a convertible soft top.",
        "A car with round headlights and a wide grille.",
        "A car with a tri-bar taillight design.",
        "A car with a rear spoiler.",
        "A car with dual exhaust pipes.",
        "A car with a bulging power dome hood.",
        "A car with a side scoop behind the doors.",
        "A car with 17-inch painted aluminum wheels.",
        "A car with a distinctive C-pillar design.",
        "A car with a body-colored bumper.",
        "A car with fog lamps integrated into the front grille.",
        "A car with a fuel cap located on the rear side.",
        "A car with a two-door body style.",
        "A car with a leather-wrapped steering wheel.",
        "A car with a retro-styled speedometer and tachometer.",
        "A car with a Mustang logo on the steering wheel.",
        "A car with a 4.0L V6 engine (if the engine is visible in the photo).",
        "A car with a 5-speed manual transmission (if the interior is visible in the photo)."
    ],
    "2007 Honda Odyssey Minivan": [
        "A car with a large, boxy shape typical of minivans.",
        "A car with a prominent Honda emblem on the front grille.",
        "A car with dual sliding doors on the sides.",
        "A car with a rear window that wraps around to the sides.",
        "A car with a short hood and a long, flat roof.",
        "A car with a high ground clearance.",
        "A car with a rear spoiler above the back window.",
        "A car with a large, wide windshield.",
        "A car with a roof-mounted antenna.",
        "A car with a rear wiper on the back window.",
        "A car with a third brake light located in the rear spoiler.",
        "A car with 16-inch alloy wheels.",
        "A car with a dual exhaust system.",
        "A car with headlights that are slightly rounded at the corners.",
        "A car with a body-colored front and rear bumper.",
        "A car with a chrome-trimmed front grille.",
        "A car with a large cargo area at the back.",
        "A car with a license plate located in the middle of the rear bumper.",
        "A car with a fuel filler door located on the driver's side.",
        "A car with a body-colored side mirrors and door handles."
    ],
    "2007 Hyundai Elantra Sedan": [
        "A car with a compact, four-door sedan body style.",
        "A car with a chrome-accented front grille.",
        "A car with wrap-around headlights that extend into the front fenders.",
        "A car with a high rear deck and large taillights.",
        "A car with body-colored door handles and side mirrors.",
        "A car with a relatively long wheelbase for a compact car.",
        "A car with a small antenna on the rear part of the roof.",
        "A car with 15-inch steel wheels with full covers.",
        "A car with a relatively low ground clearance.",
        "A car with a small, rounded rear window.",
        "A car with a single exhaust pipe on the right side.",
        "A car with a Hyundai logo in the center of the trunk lid.",
        "A car with a small, rectangular license plate area on the trunk lid.",
        "A car with a relatively flat hood and roofline.",
        "A car with a small, rounded fuel door on the left rear side.",
        "A car with a relatively narrow, horizontal air intake below the front bumper.",
        "A car with a small, rounded trunk lid.",
        "A car with a relatively large greenhouse area for a compact car.",
        "A car with a small, rounded rear bumper.",
        "A car with a relatively short front overhang."
    ],
    "2007 Suzuki Aerio Sedan": [
        "A car with a compact, four-door sedan body style.",
        "A car with a front-engine, front-wheel-drive layout.",
        "A car with a distinctive, rounded front end and large, clear headlamps.",
        "A car with a high roofline, providing a tall cabin.",
        "A car with a short rear deck and a relatively high trunk.",
        "A car with a small, rectangular grille located at the center of the front bumper.",
        "A car with body-colored door handles and side mirrors.",
        "A car with a small rear spoiler integrated into the trunk lid.",
        "A car with a single exhaust pipe located on the right side of the rear bumper.",
        "A car with 15-inch alloy wheels.",
        "A car with a small antenna located on the rear part of the roof.",
        "A car with a relatively flat hood and windshield.",
        "A car with a Suzuki emblem located at the center of the grille and on the trunk lid.",
        "A car with a third brake light located at the bottom of the rear window.",
        "A car with a black interior and cloth seats.",
        "A car with a simple, straightforward dashboard design with a centrally located instrument cluster.",
        "A car with a relatively large greenhouse, providing good visibility from inside the car."
    ],
    "2007 Volvo XC90 SUV": [
        "A car with a boxy, upright design.",
        "A car with a distinctive Volvo emblem on the front grille.",
        "A car with a broad front grille with vertical slats.",
        "A car with dual exhaust pipes at the rear.",
        "A car with a roof rack.",
        "A car with a rear spoiler.",
        "A car with a rear window wiper.",
        "A car with a high ground clearance.",
        "A car with large, rectangular headlights.",
        "A car with fog lights located low on the front bumper.",
        "A car with a large, square-shaped rear window.",
        "A car with a rear tailgate that opens upwards.",
        "A car with a split tailgate, where the glass can be opened separately from the rest of the tailgate.",
        "A car with alloy wheels with a five-spoke design.",
        "A car with side mirrors that are color-matched with the body.",
        "A car with a sunroof.",
        "A car with a visible antenna on the roof.",
        "A car with a visible tow hitch at the rear.",
        "A car with a visible parking sensor system on the front and rear bumpers.",
        "A car with a visible Volvo logo on the center of the alloy wheels.",
        "A car with a visible 'XC90' badge on the rear."
    ],
    "2008 Acura TL Type-S": [
        "A car with a unique front fascia that includes a black chrome grille and a lower intake that is larger than on other models.",
        "A car with a rear spoiler and larger dual exhaust outlets.",
        "A car with a 'Type-S' badge on the rear.",
        "A car with dark chrome trim around the windows and the door handles.",
        "A car with 17-inch alloy wheels with a unique design specific to the 'Type-S' model.",
        "A car with Brembo four-piston front brake calipers.",
        "A car with perforated leather seating surfaces with contrast stitching.",
        "A car with a unique 'Type-S' specific steering wheel.",
        "A car with a 'Type-S' specific gauge cluster.",
        "A car with quad headlights and a more aggressive body kit.",
        "A car with a sunroof and a rear window defroster.",
        "A car with a unique 'Type-S' specific shift knob.",
        "A car with a navigation system and a backup camera.",
        "A car with a 'Type-S' specific sport-tuned suspension.",
        "A car with a 3.5L V6 engine that is unique to the 'Type-S' model.",
        "A car with a 5-speed automatic transmission with paddle shifters on the steering wheel.",
        "A car with a unique 'Type-S' specific interior trim.",
        "A car with a 'Type-S' specific aluminum door sill.",
        "A car with high-intensity discharge (HID) headlights.",
        "A car with a unique 'Type-S' specific floor mats."
    ],
    "2008 Audi RS 4 Convertible": [
        "A car with a large, single-frame grille with a glossy black honeycomb pattern.",
        "A car with two oval exhaust pipes integrated into the rear bumper.",
        "A car with a convertible roof.",
        "A car with flared wheel arches.",
        "A car with a rear lip spoiler on the trunk lid.",
        "A car with 19-inch, 7-double-spoke design alloy wheels.",
        "A car with aluminum-finish door mirror housings.",
        "A car with RS 4 badging on the grille and rear.",
        "A car with xenon plus headlights with automatic self-leveling.",
        "A car with LED daytime running lights.",
        "A car with a high-gloss black front spoiler and rear diffuser insert.",
        "A car with body-color lower side flares and door sills.",
        "A car with a four-passenger seating configuration.",
        "A car with a three-spoke, flat-bottom multifunction sport steering wheel.",
        "A car with a dashboard that features a driver information system with a lap timer.",
        "A car with Recaro sport seats in Silk Nappa leather or optional Valcona leather.",
        "A car with carbon fiber inlays on the interior.",
        "A car with a 4.2-liter V8 engine under the hood.",
        "A car with a six-speed manual transmission.",
        "A car with quattro permanent all-wheel drive system."
    ],
    "2008 Chrysler Crossfire Convertible": [
        "A car with a distinctive boat-tail rear end.",
        "A car with a long hood and short rear deck.",
        "A car with a center spine that runs the length of the car, from front to rear.",
        "A car with a retractable soft top.",
        "A car with a two-seat cabin.",
        "A car with a Mercedes-Benz SLK-Class platform.",
        "A car with a 3.2-liter V6 engine.",
        "A car with a large grille that has the Chrysler winged emblem in the center.",
        "A car with 18-inch front wheels and 19-inch rear wheels.",
        "A car with a rear spoiler that automatically extends at speeds above 60 mph.",
        "A car with a dual exhaust system.",
        "A car with a 6-speed manual or 5-speed automatic transmission.",
        "A car with a rounded, bulging hood.",
        "A car with a high beltline and low roofline.",
        "A car with a narrow, tapering tail.",
        "A car with a two-tone interior color scheme.",
        "A car with a silver center console and door trim.",
        "A car with a leather-wrapped steering wheel and shift knob.",
        "A car with a power-adjustable driver's seat.",
        "A car with a tire-pressure monitoring system."
    ],
    "2008 Chrysler PT Cruiser Convertible": [
        "A car with a retro-styled compact design.",
        "A car with a convertible roof.",
        "A car with a high roofline and a long, flat hood.",
        "A car with round headlights that are set high on the fenders.",
        "A car with a vertical grille that is split into two sections.",
        "A car with a rear end that is rounded and has large, vertical taillights.",
        "A car with a small rear window and a large trunk lid.",
        "A car with a two-door body style.",
        "A car with a chrome-accented interior.",
        "A car with a dashboard that is styled to match the exterior of the vehicle.",
        "A car with a large, round speedometer in the center of the dashboard.",
        "A car with a seating capacity for four passengers.",
        "A car with a front-engine, front-wheel-drive layout.",
        "A car with 15-inch steel wheels.",
        "A car with body-colored bumpers and side moldings.",
        "A car with a rear spoiler as an optional feature.",
        "A car with a 2.4-liter four-cylinder engine.",
        "A car with a four-speed automatic transmission."
    ],
    "2008 Dodge Magnum Wagon": [
        "A car with a bold, aggressive front grille design.",
        "A car with a long, sloping rear end, characteristic of a wagon body style.",
        "A car with a large, rectangular-shaped rear window.",
        "A car with a high beltline and narrow windows.",
        "A car with a prominent Dodge logo on the front grille.",
        "A car with a set of dual, round headlights on each side.",
        "A car with a muscular, wide stance.",
        "A car with a large, flat hood.",
        "A car with a rear liftgate, instead of a traditional trunk.",
        "A car with a roof that slopes down towards the rear.",
        "A car with a dual exhaust system.",
        "A car with five-spoke alloy wheels.",
        "A car with a short front overhang and a long rear overhang.",
        "A car with a large, broad front bumper.",
        "A car with a rear spoiler integrated into the roofline.",
        "A car with a body-colored front grille.",
        "A car with a side profile that shows a continuous, flowing line from the front to the rear.",
        "A car with a rear wiper on the back window.",
        "A car with a large cargo area visible through the rear window.",
        "A car with a relatively low ground clearance for a wagon."
    ],
    "2008 Isuzu Ascender SUV": [
        "A car with a large, chrome grille that has a horizontal bar in the middle.",
        "A car with a prominent Isuzu logo in the center of the grille.",
        "A car with rectangular headlights that are slightly slanted towards the grille.",
        "A car with a long, boxy body shape typical of SUVs.",
        "A car with a high ground clearance.",
        "A car with five-spoke alloy wheels.",
        "A car with a roof rack for additional cargo.",
        "A car with a rear window that is almost vertical, unlike many SUVs that have a slanted rear window.",
        "A car with a spare tire mounted under the cargo area at the rear.",
        "A car with a single exhaust pipe on the right side.",
        "A car with a rear wiper on the tailgate.",
        "A car with side mirrors that are color-matched with the body.",
        "A car with black door handles and side moldings.",
        "A car with a short front overhang and a long rear overhang.",
        "A car with a large, square-shaped rear bumper.",
        "A car with a third brake light located at the bottom of the rear window.",
        "A car with a two-tone body color, with the lower part usually in a different shade.",
        "A car with a long wheelbase, providing ample interior space.",
        "A car with a rear tailgate that opens upwards.",
        "A car with a visible antenna on the right side of the roof."
    ],
    "2008 Lamborghini Reventon Coupe": [
        "A car with a sharp, angular design, reminiscent of a stealth fighter jet.",
        "A car with a unique grey-barium color, which has a matte finish.",
        "A car with bi-xenon headlights and LED accents.",
        "A car with a distinctive front fascia featuring large air intakes.",
        "A car with a rear diffuser and a small adjustable rear spoiler.",
        "A car with a centrally located twin exhaust system.",
        "A car with a flat, muscular hood that has two large air intakes.",
        "A car with scissor doors, a signature feature of many Lamborghini models.",
        "A car with a digital display in the cockpit that can switch between a traditional layout and one that mimics a jet's instrumentation.",
        "A car with a unique wheel design, featuring five split spokes with a dark grey finish.",
        "A car with a glass engine cover that showcases the V12 engine.",
        "A car with a narrow, elongated side profile, with prominent wheel arches.",
        "A car with a distinctive Lamborghini badge on the front and rear.",
        "A car with a two-seater configuration and a luxurious interior featuring black leather and Alcantara.",
        "A car with a flat-bottomed steering wheel, similar to those found in race cars.",
        "A car with a high-performance braking system visible behind the wheels, featuring carbon-ceramic brakes.",
        "A car with a unique serial number located near the driver's side door, as only 20 units were produced."
    ],
    "2009 Bentley Arnage Sedan": [
        "A car with a large, rectangular chrome grille at the front.",
        "A car with dual round headlights on each side of the grille.",
        "A car with a long, wide hood and a short rear deck.",
        "A car with a Bentley logo prominently displayed on the hood.",
        "A car with a high beltline and a low roofline, giving it a sleek, streamlined appearance.",
        "A car with large, flared wheel arches housing 19-inch alloy wheels.",
        "A car with a distinctive 'B' shaped side vents behind the front wheels.",
        "A car with a long wheelbase, providing ample interior space.",
        "A car with a dual exhaust system with oval-shaped tips.",
        "A car with a large, prominent boot lid with a chrome strip running across it.",
        "A car with a Bentley winged 'B' badge on the boot lid.",
        "A car with a luxurious interior, featuring high-quality leather and wood trim.",
        "A car with a traditional analog clock on the dashboard.",
        "A car with a Bentley nameplate on the back, between the tail lights.",
        "A car with a distinctive, muscular stance, indicative of its high-performance capabilities."
    ],
    "2009 Bugatti Veyron 16.4 Convertible": [
        "A car with a horseshoe-shaped radiator grille.",
        "A car with a two-tone color scheme, often with the front end in a different color than the rear.",
        "A car with a low, wide stance and a very aerodynamic shape.",
        "A car with a large rear spoiler that can be raised or lowered.",
        "A car with a quad-turbocharged 8.0-liter W16 engine visible through a glass panel on the rear.",
        "A car with a pair of large air intakes behind the doors.",
        "A car with a unique set of headlights, each consisting of a single xenon headlamp with a ring of LED daytime running lights.",
        "A car with a flat, elongated tail with oval-shaped taillights.",
        "A car with a convertible top, specifically a targa top.",
        "A car with a centrally mounted exhaust system with two large pipes.",
        "A car with a Bugatti logo prominently displayed on the front and rear.",
        "A car with 10-spoke alloy wheels, with a unique design exclusive to Bugatti.",
        "A car with a luxurious interior, featuring leather upholstery and a center console made of brushed aluminum.",
        "A car with a speedometer that goes up to 280 mph (450 km/h), indicating its high-performance capabilities.",
        "A car with a fuel cap located on the right rear quarter panel.",
        "A car with a small, oval-shaped rear window.",
        "A car with a flat-bottomed steering wheel and a high center console, separating the driver and passenger seats.",
        "A car with a \"EB\" logo on the rear, standing for Ettore Bugatti, the founder of the company.",
        "A car with a distinctive \"V\" shape on the front end, formed by the lines of the hood and the front fenders."
    ],
    "2009 Bugatti Veyron 16.4 Coupe": [
        "A car with a two-tone color scheme, typically with the front end in one color and the rear in another.",
        "A car with a horseshoe-shaped front grille.",
        "A car with a center spine running from the front to the rear.",
        "A car with a flat, wide, and low profile.",
        "A car with a quad-turbocharged 8.0-liter W16 engine.",
        "A car with a top speed of 253 mph.",
        "A car with a 7-speed DSG sequential transmission.",
        "A car with a total of 10 radiators for cooling.",
        "A car with a retractable rear wing for aerodynamics.",
        "A car with a two-door coupe body style.",
        "A car with a full-time all-wheel drive.",
        "A car with a fuel economy of 8 city / 14 highway mpg.",
        "A car with a large diffuser and centrally mounted exhaust pipes at the rear.",
        "A car with a Bugatti emblem on the front grille.",
        "A car with a curved windshield and roofline.",
        "A car with a luxurious interior featuring leather upholstery and aluminum accents.",
        "A car with a digital instrument cluster.",
        "A car with a center console that houses controls for the climate and audio system.",
        "A car with a unique key for activating the top speed mode.",
        "A car with a fuel tank capacity of 26.4 gallons.",
        "A car with a curb weight of 4162 lbs.",
        "A car with a length of 175.7 inches, a width of 78.7 inches, and a height of 47.4 inches.",
        "A car with a wheelbase of 106.7 inches.",
        "A car with a ground clearance of 4.9 inches in handling mode.",
        "A car with a 0-60 mph acceleration time of 2.5 seconds.",
        "A car with a carbon fiber body structure.",
        "A car with a luggage compartment in the front.",
        "A car with a power-to-weight ratio of 529 hp per tonne.",
        "A car with a maximum power output of 1001 hp at 6000 rpm.",
        "A car with a maximum torque of 922 lb-ft at 2200-5500 rpm."
    ],
    "2009 Chevrolet TrailBlazer SS": [
        "A car with a large, prominent Chevrolet emblem in the center of the grille.",
        "A car with a distinctive SS badge on the grille, rear, and sides.",
        "A car with a body-colored grille, as opposed to the chrome grilles found on other TrailBlazer models.",
        "A car with a muscular and aggressive stance, indicative of its high-performance nature.",
        "A car with 20-inch polished aluminum wheels, unique to the SS model.",
        "A car with a dual-outlet exhaust system, which is a characteristic of the SS model.",
        "A car with a lower ride height compared to other TrailBlazer models, due to its sport-tuned suspension.",
        "A car with a roof rack, which is a common feature on TrailBlazer models.",
        "A car with a large, boxy shape, typical of mid-size SUVs from the late 2000s.",
        "A car with a rear liftgate that includes a separately opening window, a common feature on TrailBlazers.",
        "A car with a large, rectangular side mirrors.",
        "A car with a distinctive headlight design, with separate housings for the high and low beams.",
        "A car with a large, wide windshield, typical of SUVs.",
        "A car with a long hood and a short rear deck, a characteristic of the TrailBlazer design.",
        "A car with a large, spacious interior, indicative of its mid-size SUV classification.",
        "A car with a leather-wrapped steering wheel with audio controls, a feature found in the SS model.",
        "A car with a distinctive instrument cluster, featuring white-faced gauges with red needles, unique to the SS model."
    ],
    "2009 Chrysler Aspen SUV": [
        "A car with a large, chrome grille featuring the Chrysler emblem in the center.",
        "A car with a boxy, upright stance typical of traditional SUVs.",
        "A car with a squared-off rear end and a large, vertically oriented tailgate.",
        "A car with a roof rack for additional cargo.",
        "A car with large, rounded headlights flanking the grille.",
        "A car with a long, flat hood and a relatively vertical windshield.",
        "A car with a high ground clearance and large wheel arches.",
        "A car with a three-row seating configuration.",
        "A car with a rear window that opens independently of the tailgate.",
        "A car with a side profile that features a straight beltline and large, square windows.",
        "A car with a rear bumper that includes a step for easier access to the roof rack.",
        "A car with a dual exhaust system.",
        "A car with 18-inch alloy wheels.",
        "A car with a large, prominent C-pillar.",
        "A car with a body-colored side molding running along the length of the vehicle.",
        "A car with a chrome trim around the windows and along the bottom of the doors.",
        "A car with a rear wiper for the back window.",
        "A car with fog lights integrated into the front bumper.",
        "A car with a towing hitch at the rear.",
        "A car with a fuel filler cap located on the driver's side."
    ],
    "2009 Dodge Charger SRT-8": [
        "A car with a large, aggressive front grille with a honeycomb pattern.",
        "A car with a hood that features a functional air scoop.",
        "A car with a 'SRT' badge on the front grille.",
        "A car with a body-colored rear spoiler.",
        "A car with dual exhaust pipes at the rear.",
        "A car with 20-inch aluminum wheels.",
        "A car with Brembo brakes visible behind the wheels.",
        "A car with a long, muscular body design.",
        "A car with a 'Charger' badge on the rear.",
        "A car with a '6.1 Hemi' badge on the side fenders.",
        "A car with high-intensity discharge headlamps.",
        "A car with a body that is available in various colors, including bright silver, brilliant black, and torred.",
        "A car with a large, spacious interior with sporty elements.",
        "A car with a performance-oriented instrument cluster.",
        "A car with a distinctive Dodge logo on the steering wheel.",
        "A car with a center console that features a touch screen display.",
        "A car with sport bucket seats with 'SRT' embossed on them.",
        "A car with a rear-wheel-drive layout.",
        "A car with a distinctive American muscle car design."
    ],
    "2009 Dodge Ram Pickup 3500 Quad Cab": [
        "A car with a large, bold grille that prominently features the Dodge logo.",
        "A car with a muscular, robust body design.",
        "A car with a four-door, Quad Cab configuration.",
        "A car with a long, flat truck bed at the rear.",
        "A car with large, flared wheel arches.",
        "A car with a high ground clearance and a commanding road presence.",
        "A car with a large, rectangular side-view mirrors for towing visibility.",
        "A car with a distinctive hood design that slopes downward towards the grille.",
        "A car with a rear bumper that includes steps for easy access to the truck bed.",
        "A car with a dual rear wheel setup, often referred to as a \"dually\".",
        "A car with a large, sturdy front bumper with integrated fog lights.",
        "A car with a towing package, including a hitch receiver and trailer wiring harness.",
        "A car with a distinctive tailgate that prominently features the Dodge logo.",
        "A car with a large, spacious interior and a full-sized rear seat.",
        "A car with a distinctive dashboard design, including a large center console.",
        "A car with a large fuel tank, often visible from the side profile.",
        "A car with a distinctive antenna on the right front fender.",
        "A car with a large exhaust pipe, often visible from the rear view."
    ],
    "2009 Dodge Sprinter Cargo Van": [
        "A car with a boxy, tall body shape, typical of cargo vans.",
        "A car with a large, prominent grille with the Dodge emblem in the center.",
        "A car with a long wheelbase and high roof, providing ample cargo space.",
        "A car with sliding doors on the side and double doors at the rear for easy loading and unloading.",
        "A car with large, rectangular headlights on either side of the grille.",
        "A car with a relatively flat, vertical windshield, typical of commercial vans.",
        "A car with a single-color paint job, often white or silver, common for commercial vehicles.",
        "A car with black, plastic bumpers and side mirrors.",
        "A car with small, steel wheels with hubcaps.",
        "A car with a short hood, indicating a front-engine layout.",
        "A car with a high ground clearance, suitable for heavy loads.",
        "A car with a simple, utilitarian interior visible through the windshield or side windows.",
        "A car with a step bumper at the rear for easy access to the cargo area.",
        "A car with a visible exhaust pipe on the right side.",
        "A car with a large side mirror for better visibility."
    ],
    "2009 Ford Expedition EL SUV": [
        "A car with a large, boxy shape, typical of full-size SUVs.",
        "A car with a prominent Ford logo centered on the front grille.",
        "A car with a three-bar chrome grille, a design feature common in Ford vehicles of this era.",
        "A car with large, rectangular headlights on either side of the grille.",
        "A car with a long wheelbase, indicative of the 'EL' (Extended Length) model.",
        "A car with a roof rack for additional cargo storage.",
        "A car with a rear liftgate window that can open separately from the liftgate.",
        "A car with a side step for easier access to the cabin.",
        "A car with five-spoke alloy wheels.",
        "A car with a rear wiper for the back window.",
        "A car with a tow hitch, indicating its towing capabilities.",
        "A car with a high ground clearance, typical of SUVs.",
        "A car with a large side mirror for better visibility.",
        "A car with a distinctive C-pillar design, which is a vertical or near-vertical support between the rear side window and rear windshield.",
        "A car with a 'Expedition' badge on the left side of the liftgate.",
        "A car with a 'EL' badge on the right side of the liftgate.",
        "A car with a dual exhaust system.",
        "A car with a large, spacious interior, visible through the windows.",
        "A car with a rear parking sensor system.",
        "A car with a fuel filler door on the driver's side."
    ],
    "2009 HUMMER H2 SUT Crew Cab": [
        "A car with a large, boxy, and rugged exterior design.",
        "A car with a short pickup bed at the rear.",
        "A car with a large chrome grille at the front.",
        "A car with round headlights on either side of the grille.",
        "A car with a large, prominent HUMMER logo on the grille.",
        "A car with a high ground clearance.",
        "A car with large, flared wheel arches.",
        "A car with a spare tire mounted on the rear tailgate.",
        "A car with a step bar for easier entry and exit.",
        "A car with a roof rack for additional storage.",
        "A car with a large, wide windshield.",
        "A car with a side mirror that has an integrated turn signal.",
        "A car with a dual exhaust system.",
        "A car with a large fuel cap on the driver's side.",
        "A car with a distinctive H2 badge on the rear side.",
        "A car with a towing hitch at the rear.",
        "A car with a four-door configuration.",
        "A car with a sunroof.",
        "A car with a rear window that can be opened independently of the tailgate.",
        "A car with a large, prominent hood with vents."
    ],
    "2009 Mercedes-Benz SL-Class Coupe": [
        "A car with a retractable hardtop roof.",
        "A car with a long hood and a short rear deck.",
        "A car with a three-pointed star emblem on the front grille.",
        "A car with a wide and low stance.",
        "A car with a dual exhaust system.",
        "A car with a two-door design.",
        "A car with a large front grille with horizontal slats.",
        "A car with a pair of bi-xenon headlights.",
        "A car with LED daytime running lights.",
        "A car with a side vent on the front fenders.",
        "A car with a rear spoiler that automatically extends at high speeds.",
        "A car with a pair of large and wide rear taillights.",
        "A car with a rear diffuser.",
        "A car with a set of 18-inch alloy wheels.",
        "A car with a luxurious interior featuring leather upholstery.",
        "A car with a central console that houses the COMAND infotainment system.",
        "A car with a sporty and flat-bottom steering wheel.",
        "A car with a pair of sporty bucket seats.",
        "A car with a V8 or V12 engine, depending on the model.",
        "A car with a 7-speed automatic transmission.",
        "A car with a badge on the back indicating the engine size and model."
    ],
    "2009 Spyker C8 Convertible": [
        "A car with a distinctive aerodynamic design.",
        "A car with a convertible roof.",
        "A car with a unique, oval-shaped grille at the front.",
        "A car with two doors.",
        "A car with a mid-engine layout.",
        "A car with a prominent rear diffuser.",
        "A car with a pair of circular headlights on each side.",
        "A car with a logo that features a propeller and a wheel.",
        "A car with a sleek, low-to-the-ground profile.",
        "A car with a luxurious, leather-clad interior.",
        "A car with a unique, airplane-inspired dashboard.",
        "A car with a manual transmission.",
        "A car with a distinctive, wide rear end with large, round taillights.",
        "A car with a pair of side-mounted exhaust pipes.",
        "A car with a large, glass-covered engine bay at the rear.",
        "A car with a set of large, alloy wheels.",
        "A car with a small, aerodynamic spoiler at the back.",
        "A car with a distinctive, Spyker emblem on the hood.",
        "A car with a unique, chrome-finished side mirrors.",
        "A car with a distinctive, Spyker logo on the steering wheel."
    ],
    "2009 Spyker C8 Coupe": [
        "A car with a distinctive aerodynamic design.",
        "A car with a low, wide stance.",
        "A car with a long, sloping hood.",
        "A car with a large, oval-shaped front grille.",
        "A car with two round headlights on each side of the grille.",
        "A car with a small, round fog light below each headlight.",
        "A car with a unique, glass-covered engine compartment at the rear.",
        "A car with a pair of large, round tail lights.",
        "A car with a dual exhaust system located in the center of the rear bumper.",
        "A car with a two-door, two-seater configuration.",
        "A car with a distinctive, hinged roof panel.",
        "A car with a luxurious, leather-clad interior.",
        "A car with a unique, aviation-inspired dashboard and control layout.",
        "A car with a manual transmission, indicated by a gear lever in the center console.",
        "A car with large, alloy wheels with a multi-spoke design.",
        "A car with a Spyker logo, which is a circular emblem with a propeller and a wheel.",
        "A car with a rear diffuser for improved aerodynamics.",
        "A car with side air intakes located just behind the doors.",
        "A car with a small, oval rear window.",
        "A car with a distinctive, curved windshield."
    ],
    "2010 BMW M5 Sedan": [
        "A car with a large, dual kidney-shaped grille on the front.",
        "A car with the BMW logo located centrally on the hood and trunk.",
        "A car with quad exhaust pipes at the rear.",
        "A car with a small M5 badge on the right side of the trunk.",
        "A car with a power dome on the hood.",
        "A car with 19-inch M light-alloy wheels in double-spoke design.",
        "A car with flared wheel arches.",
        "A car with aerodynamic side mirrors.",
        "A car with a shark fin antenna on the roof.",
        "A car with LED tail lights.",
        "A car with a rear spoiler integrated into the trunk lid.",
        "A car with a wide, low stance.",
        "A car with a long, sloping hood.",
        "A car with a high-gloss Shadow Line around the windows.",
        "A car with a distinctive side gill with M5 logo.",
        "A car with bi-xenon headlights.",
        "A car with a sunroof.",
        "A car with a sporty and luxurious interior, including M-specific seats and steering wheel.",
        "A car with a high-performance brake system with blue calipers.",
        "A car with a V10 engine, which is not visible in the photo but can be inferred from the M5 badge."
    ],
    "2010 BMW M6 Convertible": [
        "A car with a large, wide kidney grille at the front, a signature feature of BMW.",
        "A car with a convertible roof, which can be folded down.",
        "A car with a long, sleek hood and a short rear deck.",
        "A car with a distinctive M6 badge on the rear.",
        "A car with quad exhaust pipes at the rear, a characteristic of the M series.",
        "A car with large air intakes on the front bumper.",
        "A car with a wide, low stance, typical of sports cars.",
        "A car with 19-inch M light-alloy wheels in double-spoke design.",
        "A car with flared wheel arches, giving it a muscular appearance.",
        "A car with a carbon fiber roof, a feature unique to the M series.",
        "A car with LED corona rings around the headlights.",
        "A car with a high-performance brake system with large, vented disc brakes.",
        "A car with aerodynamic side mirrors, a feature of the M series.",
        "A car with a distinctive side gill with an integrated indicator, a feature of the M series.",
        "A car with a rear diffuser, a feature of high-performance cars.",
        "A car with a leather-wrapped M sport steering wheel with M logo.",
        "A car with M sport seats with integrated headrests.",
        "A car with a specific M instrument cluster.",
        "A car with an M gear shift lever.",
        "A car with a specific M door sill finishers."
    ],
    "2010 Chevrolet Cobalt SS": [
        "A car with a compact and sporty design.",
        "A car with a prominent Chevrolet emblem on the front grille.",
        "A car with a unique front bumper that includes fog lights.",
        "A car with a rear spoiler, which is a characteristic of the SS model.",
        "A car with 18-inch forged aluminum wheels.",
        "A car with a dual-outlet stainless-steel exhaust.",
        "A car with SS badging on the rear and sides.",
        "A car with a power dome hood, which is unique to the Cobalt SS.",
        "A car with a sporty interior, including sport seats and a leather-wrapped steering wheel.",
        "A car with a boost gauge in the driver's side A-pillar, which is a unique feature of the Cobalt SS.",
        "A car with a specific Cobalt body shape, which is a two-door coupe or a four-door sedan.",
        "A car with a unique Cobalt SS instrument panel, including a 140-mph speedometer and a tachometer.",
        "A car with Brembo front brake calipers, which are a unique feature of the Cobalt SS.",
        "A car with a specific Cobalt SS color palette, which includes Victory Red, Black, and Rally Yellow among others."
    ],
    "2010 Chevrolet HHR SS": [
        "A car with a retro-styled compact wagon design.",
        "A car with a unique front grille featuring a prominent Chevrolet emblem.",
        "A car with a high roofline and a long, flat hood.",
        "A car with large, round headlights on either side of the grille.",
        "A car with a small, rounded rear window and large, rectangular side windows.",
        "A car with a rear liftgate that opens upwards.",
        "A car with 18-inch polished forged aluminum wheels.",
        "A car with a SS badge on the rear and sides.",
        "A car with a dual-outlet stainless-steel exhaust with bright tips.",
        "A car with a sport-tuned suspension.",
        "A car with a unique front and rear fascia.",
        "A car with a rear spoiler mounted on the liftgate.",
        "A car with a leather-wrapped steering wheel with mounted audio controls.",
        "A car with a turbocharged 2.0L engine.",
        "A car with a sporty interior featuring SS-specific sport seats.",
        "A car with a boost gauge integrated into the driver's side A-pillar.",
        "A car with a unique instrument panel with a silver color scheme.",
        "A car with a Pioneer sound system with seven speakers.",
        "A car with a bright chrome exterior package."
    ],
    "2010 Chevrolet Malibu Hybrid Sedan": [
        "A car with a Chevrolet emblem on the front grille and rear.",
        "A car with a hybrid badge on the rear and sides.",
        "A car with a body style of a four-door sedan.",
        "A car with a split front grille, the upper part being narrower than the lower part.",
        "A car with wrap-around headlamps that extend into the front fenders.",
        "A car with a long, sloping rear window that merges seamlessly into the trunk.",
        "A car with a high-mounted third brake light.",
        "A car with dual exhaust outlets.",
        "A car with 17-inch alloy wheels.",
        "A car with body-colored door handles and side mirrors.",
        "A car with a chrome trim around the windows and along the sides.",
        "A car with a relatively flat hood and trunk.",
        "A car with a short antenna mounted on the rear part of the roof.",
        "A car with a relatively high beltline, giving the car a somewhat \"chunky\" appearance.",
        "A car with a fuel filler door located on the rear passenger side.",
        "A car with a Malibu badge on the right side of the trunk.",
        "A car with a relatively large trunk for a hybrid sedan.",
        "A car with a compact spare tire mounted inside the trunk.",
        "A car with a rear defogger.",
        "A car with a solar-ray light-tinted glass."
    ],
    "2010 Chrysler 300 SRT-8": [
        "A car with a large, bold front grille with a honeycomb pattern.",
        "A car with a prominent Chrysler emblem in the center of the front grille.",
        "A car with a muscular, boxy body design.",
        "A car with a long, wide hood and a short rear deck.",
        "A car with dual exhaust pipes at the rear.",
        "A car with 20-inch aluminum wheels.",
        "A car with high-intensity discharge (HID) headlamps.",
        "A car with a rear spoiler mounted on the trunk lid.",
        "A car with SRT-8 badging on the front grille and rear trunk.",
        "A car with a large, spacious interior with leather seats.",
        "A car with a distinctive analog clock in the center of the dashboard.",
        "A car with a performance-oriented instrument cluster with white-faced gauges.",
        "A car with a sunroof on the top.",
        "A car with a body-colored front and rear bumpers.",
        "A car with a body-colored side mirrors.",
        "A car with a chrome trim around the windows and along the sides.",
        "A car with a rear-wheel-drive layout.",
        "A car with a large, powerful V8 engine under the hood.",
        "A car with Brembo brakes visible behind the wheels.",
        "A car with a five-speed automatic transmission."
    ],
    "2010 Chrysler Sebring Convertible": [
        "A car with a retractable soft top or hard top.",
        "A car with a front grille that has a winged Chrysler emblem in the center.",
        "A car with a rounded, almost oval-shaped body design.",
        "A car with two doors on each side.",
        "A car with a long, sloping hood and a short rear deck.",
        "A car with a high-mounted third brake light.",
        "A car with a chrome strip running along the side of the body.",
        "A car with a rear window defroster.",
        "A car with a body-colored bumper.",
        "A car with halogen projector headlamps with chrome bezels.",
        "A car with fog lamps integrated into the front bumper.",
        "A car with dual exhaust tips.",
        "A car with 17-inch aluminum wheels.",
        "A car with power heated exterior mirrors.",
        "A car with a remote keyless entry system.",
        "A car with a tire pressure monitoring warning signal.",
        "A car with a body-colored power convertible top with lining.",
        "A car with a glass rear window with an integral defroster.",
        "A car with a solar control glass.",
        "A car with a compact spare tire.",
        "A car with a bright door handle.",
        "A car with a bright front and rear fascias.",
        "A car with a bright grille.",
        "A car with a bright side moldings.",
        "A car with a decklid liner with Chrysler wing badge.",
        "A car with a hard tonneau cover.",
        "A car with a hood insulation.",
        "A car with a power convertible top and windows down key fob.",
        "A car with a premium headliner module.",
        "A car with a security alarm.",
        "A car with a windscreen."
    ],
    "2010 Dodge Dakota Crew Cab": [
        "A car with a large, bold grille featuring the Dodge logo in the center.",
        "A car with a boxy, muscular body design.",
        "A car with a four-door crew cab configuration.",
        "A car with a long, flat truck bed at the rear.",
        "A car with a high ground clearance and large wheel arches.",
        "A car with a pair of rectangular headlights on either side of the grille.",
        "A car with a wide, flat hood and a slightly raked windshield.",
        "A car with a pair of large, vertical taillights at the rear.",
        "A car with a rear bumper that integrates steps for easy access to the truck bed.",
        "A car with a pair of large, power-adjustable side mirrors.",
        "A car with a roof that features integrated rails for additional cargo capacity.",
        "A car with a dual exhaust system.",
        "A car with 16-inch alloy wheels.",
        "A car with a body-colored front bumper.",
        "A car with a rear window that can be opened for access to the truck bed.",
        "A car with a towing hitch at the rear for towing trailers or other vehicles.",
        "A car with a fuel cap located on the driver's side.",
        "A car with a short, stubby antenna on the roof for radio reception."
    ],
    "2010 Dodge Ram Pickup 3500 Crew Cab": [
        "A car with a large, bold grille that prominently features the Dodge logo.",
        "A car with a muscular, robust body design.",
        "A car with a four-door crew cab configuration.",
        "A car with a long, flat truck bed at the rear.",
        "A car with large, flared wheel arches.",
        "A car with a high ground clearance.",
        "A car with a large towing mirror on each side.",
        "A car with a distinctive hood bulge.",
        "A car with a step bumper at the rear for easy access to the truck bed.",
        "A car with a dual rear wheel setup, often referred to as a \"dually\".",
        "A car with rectangular, vertically aligned headlights.",
        "A car with a large, sturdy front bumper.",
        "A car with a side step for easier access to the cab.",
        "A car with a large fuel cap on the driver's side.",
        "A car with a rear sliding window.",
        "A car with a prominent antenna on the right front fender.",
        "A car with a large, heavy-duty tailgate.",
        "A car with a distinctive Dodge Ram emblem on the tailgate."
    ],
    "2010 HUMMER H3T Crew Cab": [
        "A car with a boxy, rugged exterior design.",
        "A car with a large, chrome grille featuring seven vertical slats.",
        "A car with round headlights embedded in the rectangular front fascia.",
        "A car with a short bed in the rear, making it look like a pickup truck.",
        "A car with a spare tire mounted on the swing-out tailgate at the back.",
        "A car with flared wheel arches housing large, off-road tires.",
        "A car with a high ground clearance for off-road capabilities.",
        "A car with a crew cab configuration, meaning it has four full-size doors.",
        "A car with roof rails for additional cargo capacity.",
        "A car with a distinctive HUMMER badge on the front grille and rear tailgate.",
        "A car with a side step for easier access to the cabin.",
        "A car with a tow hitch at the rear for towing capabilities.",
        "A car with a large, upright windshield.",
        "A car with a skid plate under the front bumper for off-road protection.",
        "A car with a dual exhaust system.",
        "A car with a rectangular side mirror.",
        "A car with a body-colored front bumper."
    ],
    "2011 Audi S6 Sedan": [
        "A car with a large, trapezoidal single-frame grille.",
        "A car with four circular headlights.",
        "A car with LED daytime running lights forming a unique pattern.",
        "A car with a prominent S6 badge on the front grille.",
        "A car with dual exhaust outlets on each side at the rear.",
        "A car with a rear spoiler integrated into the trunk lid.",
        "A car with 19-inch alloy wheels.",
        "A car with aluminum-look mirror housings.",
        "A car with flared wheel arches.",
        "A car with a sleek, aerodynamic profile.",
        "A car with a long, sloping roofline.",
        "A car with a high waistline and a low, sporty stance.",
        "A car with a short rear overhang.",
        "A car with a distinctive V10 badge on the side.",
        "A car with a large, spacious interior visible through the windows.",
        "A car with a sunroof.",
        "A car with a wide, low stance.",
        "A car with a muscular, athletic appearance.",
        "A car with a distinctive Audi design language.",
        "A car with a high-performance look and feel."
    ],
    "2011 Audi TT Hatchback": [
        "A car with a sleek, rounded profile.",
        "A car with a prominent front grille featuring four interlocked rings, the logo of Audi.",
        "A car with two doors, indicating it's a coupe.",
        "A car with a sloping roofline that merges seamlessly into the rear, giving it a hatchback look.",
        "A car with dual exhaust outlets on the left side of the rear.",
        "A car with a small rear spoiler that automatically extends at higher speeds.",
        "A car with LED daytime running lights forming a unique pattern around the headlamps.",
        "A car with a fuel filler cap on the right side, which is round and has a brushed metal finish.",
        "A car with 18-inch 5-arm dynamic design wheels.",
        "A car with a short front overhang and a longer rear overhang.",
        "A car with a compact and sporty stance.",
        "A car with a TT badge on the rear.",
        "A car with a high waistline and a low roof, giving it a 'bottle' shape.",
        "A car with a small rear window and a sloping rear end.",
        "A car with a single-frame radiator grille.",
        "A car with large air inlets in the front bumper.",
        "A car with a flat-bottomed steering wheel inside, visible through the window.",
        "A car with a unique interior design featuring circular air vents and a minimalist dashboard, visible through the window."
    ],
    "2011 Bentley Mulsanne Sedan": [
        "A car with a large, prominent front grille with vertical slats.",
        "A car with a pair of round inner headlights and rectangular outer headlights.",
        "A car with a winged 'B' emblem on the hood.",
        "A car with a long, sloping hood and a short rear deck.",
        "A car with a high beltline and a low roofline.",
        "A car with a pair of oval-shaped exhaust outlets.",
        "A car with a split rear window.",
        "A car with a large, luxurious interior with high-quality leather and wood trim.",
        "A car with a digital instrument cluster behind the steering wheel.",
        "A car with a large, central infotainment screen on the dashboard.",
        "A car with a pair of rear-hinged 'suicide' doors.",
        "A car with a large, prominent 'B' emblem on the wheel hubs.",
        "A car with a long wheelbase and a large overall length.",
        "A car with a pair of large, comfortable rear seats with plenty of legroom.",
        "A car with a large, spacious trunk.",
        "A car with a pair of large, comfortable front seats with plenty of adjustments.",
        "A car with a large, prominent Bentley logo on the rear.",
        "A car with a pair of large, comfortable rear seats with individual entertainment screens.",
        "A car with a large, prominent Bentley logo on the front grille.",
        "A car with a pair of large, comfortable front seats with individual entertainment screens."
    ],
    "2011 Dodge Challenger SRT8": [
        "A car with a large, aggressive front grille with a honeycomb pattern.",
        "A car with two round headlights on each side, separated by the grille.",
        "A car with a long, flat hood with two functional air intakes.",
        "A car with a muscular, wide stance and a low roofline.",
        "A car with a distinctive side profile featuring a high beltline and narrow windows.",
        "A car with a rear end that features a lip spoiler and large, round dual exhaust tips.",
        "A car with 20-inch forged aluminum wheels with a five-spoke design.",
        "A car with Brembo brakes visible behind the wheels.",
        "A car with a '392' badge on the front fender, indicating the engine's cubic-inch displacement.",
        "A car with a fuel filler cap on the driver's side that has a retro design.",
        "A car with a large, wide rear window and a short trunk.",
        "A car with a distinctive 'SRT' badge on the rear.",
        "A car with a wide, flat dashboard and a large center console inside.",
        "A car with sporty, bolstered seats with 'SRT' embossed on the backrest.",
        "A car with a unique instrument cluster featuring a 180-mph (290 km/h) speedometer.",
        "A car with a T-shaped automatic gear shift lever.",
        "A car with a large, 6.4-liter V8 engine under the hood."
    ],
    "2011 Ford Ranger SuperCab": [
        "A car with a compact pickup truck body style.",
        "A car with a Ford emblem on the front grille and tailgate.",
        "A car with a distinctive front grille design, featuring two horizontal bars.",
        "A car with a SuperCab badge on the side of the rear door.",
        "A car with a 6-foot bed in the back.",
        "A car with a side step design on the SuperCab model.",
        "A car with a rounded front bumper and rectangular fog lights.",
        "A car with a two-door extended cab or a four-door extended cab.",
        "A car with a spare tire mounted under the bed in the rear.",
        "A car with a towing hitch at the back.",
        "A car with a 2011 model year registration sticker on the windshield.",
        "A car with a Ranger badge on the tailgate.",
        "A car with a distinctive wheel design specific to the 2011 Ford Ranger SuperCab.",
        "A car with a side mirror mounted on the doors rather than the front pillars.",
        "A car with a fuel cap located on the driver's side.",
        "A car with a rear jump seats in the SuperCab model.",
        "A car with a simple, utilitarian interior design.",
        "A car with a manual transmission or automatic transmission options.",
        "A car with a 4x2 or 4x4 drivetrain options.",
        "A car with a payload sticker on the inside of the driver's side door."
    ],
    "2011 Infiniti QX56 SUV": [
        "A car with a large, chrome, trapezoidal grille.",
        "A car with a high, boxy rear end.",
        "A car with a long, flat hood.",
        "A car with a prominent Infiniti logo in the center of the grille.",
        "A car with large, wrap-around headlights.",
        "A car with a pair of fog lights located lower on the front bumper.",
        "A car with a distinctive side vent located behind the front wheel.",
        "A car with a roof rack.",
        "A car with a large, glass sunroof.",
        "A car with a rear spoiler above the rear window.",
        "A car with a dual exhaust system.",
        "A car with a large, rectangular rear window.",
        "A car with a pair of large, vertical taillights.",
        "A car with a chrome strip running along the bottom of the side doors.",
        "A car with a set of 20-inch, 7-spoke aluminum-alloy wheels.",
        "A car with a body-colored side mirror with integrated turn signals.",
        "A car with a chrome door handle.",
        "A car with a chrome strip running along the top of the rear bumper.",
        "A car with a rear wiper on the back window.",
        "A car with a power liftgate.",
        "A car with a chrome strip running along the bottom of the windows.",
        "A car with a chrome strip running along the top of the front bumper.",
        "A car with a chrome strip running along the top of the rear bumper.",
        "A car with a chrome strip running along the top of the side windows.",
        "A car with a chrome strip running along the bottom of the front bumper."
    ],
    "2011 Lincoln Town Car Sedan": [
        "A car with a large, boxy shape, indicative of traditional American luxury sedans.",
        "A car with a chrome waterfall grille at the front.",
        "A car with large, wrap-around headlights.",
        "A car with a long, flat hood and a high, flat trunk.",
        "A car with a long wheelbase, providing ample interior space.",
        "A car with a Lincoln emblem in the center of the grille.",
        "A car with a vertical tail light design.",
        "A car with a keyless entry keypad on the driver's side door.",
        "A car with dual exhaust outlets integrated into the rear bumper.",
        "A car with a large, comfortable, and luxurious interior, often visible through the windows.",
        "A car with a distinctive side profile, featuring a straight beltline and a formal roofline.",
        "A car with 17-inch, 9-spoke machined aluminum wheels.",
        "A car with a body-colored bumper with a chrome strip running across.",
        "A car with a rear air suspension for a smoother ride, noticeable in the car's stance.",
        "A car with a large, rectangular side mirror.",
        "A car with a chrome strip running along the side of the car, from the front wheel to the rear.",
        "A car with a power pull-down trunk lid, which may be visible if the trunk is open in the photo.",
        "A car with a chrome door handle.",
        "A car with a large greenhouse, providing good outward visibility.",
        "A car with a distinctive Lincoln Town Car badge on the rear side."
    ],
    "2011 Mazda Tribute SUV": [
        "A car with a compact and boxy SUV shape.",
        "A car with a prominent front grille featuring a large Mazda emblem in the center.",
        "A car with a pair of clear lens halogen headlights on either side of the grille.",
        "A car with a roof rack for additional cargo.",
        "A car with a rear window wiper.",
        "A car with a pair of fog lights located on the lower front bumper.",
        "A car with 16-inch alloy wheels.",
        "A car with body-colored door handles and side mirrors.",
        "A car with a rear liftgate that opens upwards.",
        "A car with a spare tire mounted on the back of the vehicle.",
        "A car with a dual exhaust system.",
        "A car with a high ground clearance.",
        "A car with black plastic cladding along the bottom of the vehicle.",
        "A car with a short front and rear overhang.",
        "A car with a relatively flat roofline.",
        "A car with a rear spoiler above the back window.",
        "A car with a visible antenna on the roof.",
        "A car with a chrome trim around the windows.",
        "A car with a visible fuel cap on the driver's side.",
        "A car with a visible Mazda logo on the wheel center caps."
    ],
    "2012 Acura RL Sedan": [
        "A car with a distinctive pentagonal grille with a chrome surround.",
        "A car with the Acura logo prominently displayed in the center of the grille.",
        "A car with sleek, narrow headlights that are integrated into the design of the front end.",
        "A car with a long, sloping hood and a short rear deck.",
        "A car with a dual exhaust system.",
        "A car with a sunroof as a standard feature.",
        "A car with 18-inch alloy wheels.",
        "A car with a high beltline and a low, aerodynamic roofline.",
        "A car with a body-colored rear spoiler.",
        "A car with LED taillights that wrap around the sides of the vehicle.",
        "A car with a chrome strip running along the bottom of the windows.",
        "A car with body-colored side mirrors that have integrated turn signals.",
        "A car with a distinctive side profile, with a high waistline and a sloping roofline.",
        "A car with a relatively flat and wide rear end.",
        "A car with a rearview camera as a standard feature.",
        "A car with a keyless access system.",
        "A car with a spacious and luxurious interior, featuring leather upholstery and wood trim.",
        "A car with a navigation system as a standard feature.",
        "A car with a 10-speaker audio system.",
        "A car with a spacious trunk for a sedan of its size."
    ],
    "2012 Acura TL Sedan": [
        "A car with a shield-shaped front grille, also known as the \"Power Plenum\" grille.",
        "A car with a pair of thin, angular headlights that flank the grille.",
        "A car with a pronounced crease running along the side, starting from the front wheel arch and fading into the rear door.",
        "A car with a high, short rear deck, giving it a somewhat sporty appearance.",
        "A car with dual exhaust outlets integrated into the rear bumper.",
        "A car with a sunroof as a standard feature.",
        "A car with 17-inch alloy wheels for the base model and 18-inch for the SH-AWD model.",
        "A car with a relatively low and wide stance.",
        "A car with LED tail lights that wrap around the side of the vehicle.",
        "A car with a small, subtle rear spoiler.",
        "A car with a body-colored front and rear bumper.",
        "A car with heated side mirrors.",
        "A car with a long, sloping roofline.",
        "A car with a chrome strip running along the bottom of the windows.",
        "A car with a relatively flat hood and a short front overhang.",
        "A car with a rear window defroster.",
        "A car with a body-colored door handle.",
        "A car with a compact spare tire mounted inside under cargo floor.",
        "A car with a 6-speed automatic transmission with Sequential SportShift paddle shifters.",
        "A car with a 3.5L V6 engine for the base model and a 3.7L V6 for the SH-AWD model."
    ],
    "2012 Acura TSX Sedan": [
        "A car with a pentagonal front grille featuring a large Acura logo in the center.",
        "A car with a pair of narrow, angular headlights that flank the grille.",
        "A car with a long, sloping hood and a short rear deck, giving it a sporty profile.",
        "A car with a dual exhaust system.",
        "A car with 17-inch, 5-spoke alloy wheels.",
        "A car with a moonroof.",
        "A car with a compact, yet spacious interior featuring leather seats.",
        "A car with a high-tech dashboard that includes a multi-information display and a navigation system.",
        "A car with a body that measures 185.6 inches in length, 72.4 inches in width, and 56.7 inches in height.",
        "A car with a wheelbase that measures 106.5 inches.",
        "A car with a distinctive side profile featuring a character line that runs from the front fender to the rear taillights.",
        "A car with a rear end that features a lip spoiler and wraparound taillights.",
        "A car with a body that is available in several colors, including Bellanova White Pearl, Crystal Black Pearl, and Forged Silver Metallic.",
        "A car with a 2.4-liter, 4-cylinder engine or a 3.5-liter V6 engine.",
        "A car with a 5-speed automatic transmission or a 6-speed manual transmission.",
        "A car with a fuel economy rating of 22 city/31 highway mpg for the 4-cylinder engine and 19 city/28 highway mpg for the V6 engine.",
        "A car with a front-wheel drive layout.",
        "A car with a seating capacity for five passengers.",
        "A car with a trunk capacity of 12.6 cubic feet.",
        "A car with safety features such as anti-lock brakes, stability control, and multiple airbags."
    ],
    "2012 Acura ZDX Hatchback": [
        "A car with a sleek, coupe-like design and four doors.",
        "A car with a distinctive, sloping roofline that ends in a hatchback-style rear.",
        "A car with a shield-shaped front grille, which is a signature design element of Acura.",
        "A car with high-intensity discharge (HID) headlights and fog lights.",
        "A car with a panoramic glass roof that extends over the rear seats.",
        "A car with 19-inch, seven-spoke alloy wheels.",
        "A car with dual exhaust outlets integrated into the rear bumper.",
        "A car with a rear window wiper, which is not common in luxury SUVs.",
        "A car with a power tailgate, which opens and closes at the push of a button.",
        "A car with a high ground clearance, typical of SUVs.",
        "A car with a luxurious interior, featuring leather seats and a navigation system with real-time traffic and weather updates.",
        "A car with a unique center console design, featuring a hand-stitched leather cover.",
        "A car with a rearview camera that displays the area directly behind the vehicle when it's in reverse.",
        "A car with a push-button ignition, which is not common in all cars.",
        "A car with a six-speed automatic transmission with Sequential SportShift paddle shifters.",
        "A car with a 3.7-liter V6 engine, which is specific to this model."
    ],
    "2012 Aston Martin V8 Vantage Convertible": [
        "A car with a distinctive front grille that is wide and low, with a horizontal bar and the Aston Martin logo at the top.",
        "A car with two doors and a convertible roof.",
        "A car with a pair of large, round headlights on either side of the grille.",
        "A car with a long, sloping hood and a short rear end, typical of sports cars.",
        "A car with side vents behind the front wheels, which are a signature feature of Aston Martin.",
        "A car with a compact and muscular stance, with a low ground clearance.",
        "A car with a rear diffuser and twin exhaust pipes located in the center of the rear bumper.",
        "A car with a sleek, aerodynamic design and smooth lines running from the front to the back.",
        "A car with a luxurious interior, featuring high-quality leather and a distinctive center console design.",
        "A car with 19-inch, 10-spoke alloy wheels.",
        "A car with LED taillights that are narrow and horizontally placed.",
        "A car with a small, sporty rear spoiler.",
        "A car with a fuel cap located on the left rear quarter panel.",
        "A car with a distinctive 'Vantage' badge on the rear.",
        "A car with a high-mounted third brake light integrated into the rear spoiler.",
        "A car with a rear view that shows a flat, wide stance with flared wheel arches.",
        "A car with a front fender vent with a chrome or silver accent.",
        "A car with a side profile that shows a sloping roofline and a short rear deck.",
        "A car with a front bumper that has large air intakes on either side.",
        "A car with door handles that are flush with the body of the car."
    ],
    "2012 Aston Martin V8 Vantage Coupe": [
        "A car with a distinctive front grille that is wide and low, with a horizontal bar across the middle.",
        "A car with two doors and a compact, sporty design.",
        "A car with a long, sloping hood and a short rear end.",
        "A car with a pair of large, round headlights on either side of the grille.",
        "A car with a small, round fog light on each side of the front bumper.",
        "A car with a side profile that features a prominent side vent behind the front wheel.",
        "A car with a rear end that features a pair of round taillights and a center-mounted brake light.",
        "A car with a dual exhaust system with the outlets located at the center of the rear bumper.",
        "A car with a rear diffuser that is integrated into the rear bumper.",
        "A car with a roofline that slopes down towards the rear, giving it a fastback appearance.",
        "A car with a small, rear spoiler that is integrated into the trunk lid.",
        "A car with a set of large, alloy wheels with a multi-spoke design.",
        "A car with a luxurious interior that features leather upholstery and a center console with a distinctive, waterfall design.",
        "A car with a steering wheel that features multiple control buttons and a distinctive, flat-bottom design.",
        "A car with a digital instrument cluster and a center-mounted infotainment screen.",
        "A car with a distinctive badge on the hood that features a pair of wings."
    ],
    "2012 Aston Martin Virage Convertible": [
        "A car with a distinctive front grille that is wide and narrow, with a winged Aston Martin logo on top.",
        "A car with two doors and a convertible roof.",
        "A car with a sleek, aerodynamic design and a low, wide stance.",
        "A car with a pair of bi-xenon headlamps that are swept back into the fenders.",
        "A car with a pronounced side strake extending from the front wheel arch to the door.",
        "A car with a rear end that features a flip tail and clear lens LED lights.",
        "A car with 20-inch, 10-spoke diamond turned alloy wheels.",
        "A car with a luxurious interior featuring Bridge of Weir leather upholstery.",
        "A car with a center console that is made of high-quality materials and features a pop-up navigation screen.",
        "A car with a powerful V12 engine visible under the hood.",
        "A car with a six-speed automatic transmission with paddle shifters on the steering wheel.",
        "A car with a distinctive 'VIRAGE' badge on the rear.",
        "A car with a sporty yet elegant look, typical of Aston Martin designs.",
        "A car with a unique exhaust note that is deep and throaty, typical of Aston Martin cars.",
        "A car with carbon ceramic brakes, visible through the wheel spokes.",
        "A car with a rear diffuser that helps manage airflow under the vehicle.",
        "A car with a front splitter that helps manage airflow over and around the vehicle.",
        "A car with a unique 'swan wing' door design that opens at a slightly upward angle.",
        "A car with a fuel cap that is beautifully crafted and features the Aston Martin logo.",
        "A car with a distinctive bonnet that features six vents for cooling the engine."
    ],
    "2012 Aston Martin Virage Coupe": [
        "A car with a distinctive front grille that is wide and narrow, with a winged Aston Martin badge at the top.",
        "A car with a sleek, low-slung profile and a long hood.",
        "A car with two doors and a 2+2 seating configuration.",
        "A car with a set of 20-inch, 10-spoke alloy wheels.",
        "A car with bi-xenon headlamps that have integrated LED side lights and direction indicators.",
        "A car with a rear end that features a 'flip' to reduce lift and improve stability at high speeds.",
        "A car with a full-grain leather interior and walnut wood trim.",
        "A car with a 6.0L V12 engine under the hood.",
        "A car with a six-speed Touchtronic 2 automatic transmission.",
        "A car with a carbon ceramic braking system.",
        "A car with a distinctive 'swan wing' door design that opens at a 12-degree upward angle.",
        "A car with a rear diffuser that integrates the dual exhaust tips.",
        "A car with a navigation system that rises from the dashboard when the engine is started.",
        "A car with a clear rear lamp with a black border.",
        "A car with a front mid-mounted engine with rear-wheel drive.",
        "A car with a bonded aluminum structure for lightness and strength.",
        "A car with a sport button that allows the driver to select between different driving modes.",
        "A car with a hand-stitched steering wheel.",
        "A car with a boot-mounted umbrella.",
        "A car with a 700W Aston Martin Premium audio system with Dolby Pro Logic II."
    ],
    "2012 Audi A5 Coupe": [
        "A car with a large, trapezoidal single-frame grille.",
        "A car with four interlocking rings emblem on the front grille.",
        "A car with sleek, wave-design shoulder line.",
        "A car with LED daytime running lights.",
        "A car with Xenon plus headlights with LED tail lights.",
        "A car with a dual exhaust system.",
        "A car with a panoramic sunroof.",
        "A car with a two-door design.",
        "A car with a sloping roofline, giving it a coupe-like appearance.",
        "A car with 18-inch 10-spoke-design wheels.",
        "A car with a three-spoke multifunction sport steering wheel.",
        "A car with leather seating surfaces.",
        "A car with a split folding 50/50 rear seatback.",
        "A car with an Audi concert radio with ten speakers and single CD player with MP3 playback capability.",
        "A car with an Audi music interface with iPod integration.",
        "A car with a driver information system with trip computer, clock, and compass.",
        "A car with a start-stop engine system.",
        "A car with a 2.0L TFSI four-cylinder engine.",
        "A car with an eight-speed Tiptronic automatic transmission.",
        "A car with quattro all-wheel drive system.",
        "A car with Audi drive select.",
        "A car with a power-adjustable heated exterior side mirrors.",
        "A car with rain/light sensor for automatic windshield wipers and headlights.",
        "A car with a rear acoustic parking sensor.",
        "A car with a space-saving spare tire.",
        "A car with a tire pressure monitoring system.",
        "A car with an anti-theft alarm system with immobilizer.",
        "A car with a three-zone automatic climate control.",
        "A car with a tilt and telescopic manually adjustable steering column.",
        "A car with a power central locking system with safety unlock feature if airbags deploy.",
        "A car with a heated 12-way power front seats including four-way power lumbar adjustment for driver.",
        "A car with a SIRIUS satellite radio with a 90-day trial subscription.",
        "A car with a Bluetooth wireless technology preparation for mobile phone.",
        "A car with a Homelink garage door opener.",
        "A car with a cruise control with coast, resume and accelerate features.",
        "A car with a driver and front passenger dual-stage airbags, front thorax side airbags, knee airbags and Sideguard head curtain airbags.",
        "A car with lower anchors and tethers for children (LATCH) in rear seats.",
        "A car with an electronic stability control with traction control (ASR).",
        "A car with a four-wheel disc brakes with anti-lock brake system (ABS), electronic brake-pressure distribution (EBD) and brake assist.",
        "A car with a tool kit and car jack."
    ],
    "2012 Audi R8 Coupe": [
        "A car with a distinctive full LED headlights and taillights.",
        "A car with a large, trapezoidal single-frame grille.",
        "A car with two doors and a sloping roofline, indicative of a coupe body style.",
        "A car with side blades behind the doors, which are large, contrasting panels.",
        "A car with a mid-engine layout, visible through a rear window.",
        "A car with a dual exhaust system with oval outlets.",
        "A car with a prominent rear diffuser.",
        "A car with a retractable rear spoiler.",
        "A car with 19-inch, 10-spoke Y design forged aluminum wheels.",
        "A car with flared wheel arches.",
        "A car with a flat and wide stance.",
        "A car with a high waistline and a low roofline.",
        "A car with a short front overhang and a long rear overhang.",
        "A car with a fuel filler cap on the right side.",
        "A car with a small rear window, indicative of a mid-engine layout.",
        "A car with a 'V10' badge on the front fenders, if it's a V10 model.",
        "A car with a large, flat windshield.",
        "A car with a compact and aerodynamic shape.",
        "A car with a distinctive Audi logo on the front and rear.",
        "A car with a sleek, modern interior design, visible through the windows."
    ],
    "2012 Audi S4 Sedan": [
        "A car with a large, trapezoidal single-frame grille.",
        "A car with four interlinked rings emblem on the front grille.",
        "A car with a distinctive S4 badge on the front grille.",
        "A car with a sleek, aerodynamic profile.",
        "A car with LED daytime running lights.",
        "A car with dual exhaust outlets on the rear.",
        "A car with a rear lip spoiler.",
        "A car with 18-inch alloy wheels.",
        "A car with a sunroof.",
        "A car with a body-colored side mirror housing.",
        "A car with a quad headlight design.",
        "A car with a sporty, aggressive front bumper.",
        "A car with a body-colored rear bumper with a diffuser.",
        "A car with a high-performance brake system visible behind the wheels.",
        "A car with a sleek, elongated hood.",
        "A car with a compact, three-box design.",
        "A car with a chrome trim around the windows.",
        "A car with a distinctive crease line running from the front to the rear.",
        "A car with a high beltline.",
        "A car with a short rear deck.",
        "A car with a relatively flat roofline.",
        "A car with a large, wide rear window.",
        "A car with a compact, sporty stance."
    ],
    "2012 Audi S5 Convertible": [
        "A car with a large, single-frame grille with vertical chrome struts.",
        "A car with a convertible roof.",
        "A car with LED daytime running lights.",
        "A car with quad exhaust outlets.",
        "A car with a rear lip spoiler.",
        "A car with 19-inch alloy wheels.",
        "A car with a V-shaped hood.",
        "A car with a prominent Audi logo on the front grille.",
        "A car with a sleek, aerodynamic profile.",
        "A car with a high-gloss black trim around the windows.",
        "A car with a wind deflector that can be raised and lowered.",
        "A car with a three-spoke multifunction sport steering wheel.",
        "A car with S5 badging on the rear.",
        "A car with aluminum-optic mirror housings.",
        "A car with a power-operated soft top.",
        "A car with a rear diffuser.",
        "A car with a sporty, aggressive stance.",
        "A car with a muscular rear shoulder line.",
        "A car with a short rear deck.",
        "A car with a wide, low stance."
    ],
    "2012 Audi S5 Coupe": [
        "A car with a large, single-frame grille with vertical chrome struts.",
        "A car with a sleek, two-door coupe body style.",
        "A car with LED daytime running lights in a wave-like pattern.",
        "A car with quad exhaust outlets at the rear.",
        "A car with a distinctive 'V' shape on the hood.",
        "A car with a prominent crease running along the side, from the headlights to the taillights.",
        "A car with a small rear spoiler that automatically extends at high speeds.",
        "A car with the Audi logo, four interlocked rings, on the front and rear.",
        "A car with 19-inch alloy wheels with a five-spoke design.",
        "A car with S5 badging on the front grille and rear.",
        "A car with aluminum-look mirror housings.",
        "A car with a panoramic sunroof.",
        "A car with a high-gloss black trim around the windows.",
        "A car with a sporty, aggressive stance.",
        "A car with a wide, low-to-the-ground appearance.",
        "A car with a long, sloping roofline.",
        "A car with a short rear deck.",
        "A car with large, wraparound taillights."
    ],
    "2012 Audi TT RS Coupe": [
        "A car with a large, single-frame grille with a glossy black diamond-pattern grid.",
        "A car with a fixed rear wing spoiler.",
        "A car with two large, oval exhaust pipes integrated into the rear bumper.",
        "A car with a TT RS logo on the front grille and rear.",
        "A car with a unique five-arm rotor design for the alloy wheels.",
        "A car with flared wheel arches and side sills.",
        "A car with LED daytime running lights incorporated into the headlight design.",
        "A car with a roof contour that descends early into the flat rear window.",
        "A car with a body that is almost entirely made of aluminum.",
        "A car with a fuel filler cap in classic sports car style, without a cover, surrounded by socket screws.",
        "A car with a distinctive tornado line below the windows that gives the body a taut look.",
        "A car with a rear diffuser that frames the two large tailpipes.",
        "A car with a honeycomb pattern in the air inlets.",
        "A car with exterior mirror housings in aluminum look.",
        "A car with a four-ring logo on the hood.",
        "A car with a flat and wide stance.",
        "A car with a short overhang at the front.",
        "A car with a long, wraparound tailgate that opens very wide.",
        "A car with a high-gloss package with aluminum-look trim around the windows.",
        "A car with a third brake light integrated into the air diffuser."
    ],
    "2012 Audi TTS Coupe": [
        "A car with a single-frame radiator grille with a high-gloss black diamond-pattern grid.",
        "A car with a TTS logo on the front grille.",
        "A car with a pair of round exhaust pipes on each side of the rear.",
        "A car with a fixed rear spoiler.",
        "A car with LED daytime running lights in a unique \"U\" shape.",
        "A car with a two-door coupe body style.",
        "A car with 19-inch alloy wheels in a 5-spoke design.",
        "A car with aluminum-look exterior mirrors.",
        "A car with a flat-bottomed, three-spoke multifunction steering wheel.",
        "A car with a S tronic dual-clutch transmission.",
        "A car with a quattro permanent all-wheel drive system.",
        "A car with a 2.0 TFSI engine with 272 horsepower.",
        "A car with a speedometer that goes up to 280 km/h.",
        "A car with a TTS logo on the rear.",
        "A car with a four-seater configuration.",
        "A car with a high-gloss package including the window slot trims and the B-pillar trims.",
        "A car with a black interior with Impulse leather in Steel Grey.",
        "A car with a Bose surround sound system.",
        "A car with a navigation system with a pop-up screen.",
        "A car with a driver information system with a lap timer."
    ],
    "2012 BMW 1 Series Convertible": [
        "A car with a compact, two-door design.",
        "A car with a soft-top convertible roof.",
        "A car with the iconic BMW kidney grille at the front.",
        "A car with round, halogen headlights on either side of the grille.",
        "A car with a long hood and short rear deck, typical of a rear-wheel-drive layout.",
        "A car with a BMW logo on the center of the trunk.",
        "A car with dual exhaust outlets at the rear.",
        "A car with 17-inch alloy wheels.",
        "A car with a high beltline that gives it a sporty, hunkered-down look.",
        "A car with a small, compact rear seating area.",
        "A car with a BMW iDrive infotainment system on the dashboard.",
        "A car with a three-spoke steering wheel featuring control buttons.",
        "A car with a speedometer and tachometer located directly in front of the driver.",
        "A car with a center console that slightly favors the driver.",
        "A car with a start-stop button located next to the gear shift.",
        "A car with a rear-wheel-drive layout.",
        "A car with a body that measures around 4.36 meters in length.",
        "A car with a distinctive side profile featuring a rising character line from the front wheel arch to the rear tail-light."
    ],
    "2012 BMW 1 Series Coupe": [
        "A car with a compact, two-door design.",
        "A car with a long hood and short rear deck.",
        "A car with a kidney-shaped grille, a signature feature of BMW.",
        "A car with dual round headlights under a clear cover.",
        "A car with a muscular shoulder line running from the front to the rear.",
        "A car with a rear-wheel-drive layout.",
        "A car with a high beltline that gives it a sporty, hunkered-down look.",
        "A car with a small, round BMW emblem on the center of the trunk.",
        "A car with L-shaped taillights.",
        "A car with dual exhaust outlets.",
        "A car with 17-inch alloy wheels.",
        "A car with a sunroof.",
        "A car with a small rear window.",
        "A car with a sloping roofline that merges seamlessly into the trunk.",
        "A car with a wide stance and short overhangs.",
        "A car with a three-box design: one box for the engine, one for the passenger cabin, and one for the trunk.",
        "A car with a sporty and luxurious interior, featuring a driver-focused cockpit.",
        "A car with a three-spoke steering wheel with control buttons.",
        "A car with a start-stop button to the right of the steering wheel.",
        "A car with a high-resolution screen on the center console for the infotainment system."
    ],
    "2012 BMW 3 Series Sedan": [
        "A car with a kidney-shaped grille that is split into two parts.",
        "A car with a long hood and short rear deck, a design typical of rear-wheel-drive vehicles.",
        "A car with a blue and white round emblem on the hood and trunk.",
        "A car with a three-box design, meaning it has distinct compartments for the engine, passengers, and cargo.",
        "A car with a sleek, aerodynamic profile.",
        "A car with dual circular headlights that are slightly angled towards the kidney grille.",
        "A car with a Hofmeister kink, a low forward bend at the C-pillar or D-pillar in the case of touring vehicles.",
        "A car with a side profile that showcases a strong shoulder line running from the front fender to the taillight.",
        "A car with L-shaped taillights that wrap around the sides of the vehicle.",
        "A car with a dual exhaust system.",
        "A car with a shark fin antenna on the roof for radio reception.",
        "A car with a badge on the right side of the trunk that says \"328i\", \"335i\", or \"ActiveHybrid 3\", indicating the model of the 3 series.",
        "A car with a relatively low ride height, typical of sport sedans.",
        "A car with a wide, low stance, giving it an aggressive look.",
        "A car with a sunroof that extends over the front and rear seats.",
        "A car with a rear-wheel-drive layout, although some models may have all-wheel drive.",
        "A car with a high beltline, which is the line from the hood to the trunk along the bottom of the windows.",
        "A car with a large, wide air intake in the front bumper.",
        "A car with a small rear spoiler integrated into the trunk lid.",
        "A car with a power dome, a slight bulge in the center of the hood."
    ],
    "2012 BMW 3 Series Wagon": [
        "A car with a long roofline that extends towards the rear, indicative of a wagon body style.",
        "A car with the iconic BMW kidney grille at the front.",
        "A car with a roundel emblem on the hood and trunk, which is a signature of BMW.",
        "A car with four doors and a rear hatch for cargo access.",
        "A car with a dual circular headlight design on each side.",
        "A car with a side profile that shows a strong shoulder line running from the front fender to the tail lights.",
        "A car with a rear end that features L-shaped tail lights.",
        "A car with a dual exhaust system, which is common in BMW 3 series models.",
        "A car with a shark fin antenna on the roof, a common feature in BMW cars.",
        "A car with alloy wheels that have a unique BMW design.",
        "A car with a relatively low ground clearance, typical of sporty wagons.",
        "A car with a rear window wiper, a feature common in wagons.",
        "A car with a sunroof, a common feature in BMW 3 series models.",
        "A car with a sleek, aerodynamic design, typical of BMW vehicles.",
        "A car with a high-quality interior, featuring leather seats and a digital display on the dashboard."
    ],
    "2012 BMW ActiveHybrid 5 Sedan": [
        "A car with the iconic BMW kidney grille at the front.",
        "A car with a blue trim around the BMW logo on the wheels, indicating it's a hybrid model.",
        "A car with a badge on the rear that says 'ActiveHybrid 5'.",
        "A car with a sleek, aerodynamic design typical of BMW sedans.",
        "A car with LED headlights and fog lights.",
        "A car with a sunroof, a feature common in luxury sedans.",
        "A car with a dual exhaust system at the rear.",
        "A car with a long, sloping hood and a short rear end, typical of BMW's design language.",
        "A car with 17-inch alloy wheels.",
        "A car with a shark fin antenna on the roof for radio and navigation systems.",
        "A car with a distinctive side profile, featuring a character line running from the front wheel arch to the tail lights.",
        "A car with a large, wide windshield and rear window, providing excellent visibility.",
        "A car with chrome accents around the windows and on the door handles.",
        "A car with a high beltline that gives it a sporty, aggressive look.",
        "A car with a spacious, luxurious interior, featuring leather seats and a digital instrument cluster.",
        "A car with a large, prominent BMW logo on the hood.",
        "A car with a body-colored bumper with integrated fog lights.",
        "A car with a rear spoiler, adding to its sporty aesthetic.",
        "A car with a large, spacious trunk, a common feature in sedans.",
        "A car with a rearview camera, a common feature in luxury cars."
    ],
    "2012 BMW M3 Coupe": [
        "A car with a kidney-shaped grille, a signature feature of BMW.",
        "A car with a long hood and a short rear deck, typical of a coupe design.",
        "A car with a power dome on the hood, a unique feature of the M3 model.",
        "A car with quad exhaust pipes at the rear.",
        "A car with a small lip spoiler on the trunk lid.",
        "A car with flared wheel arches to accommodate wider tires.",
        "A car with side vents on the front fenders with the M3 logo.",
        "A car with 18 or 19-inch light-alloy wheels in a double-spoke design.",
        "A car with bi-xenon headlights and LED tail lights.",
        "A car with a carbon fiber roof to reduce weight and lower the center of gravity.",
        "A car with a distinctive side mirror design, which is aerodynamically optimized.",
        "A car with a high-performance braking system with large, vented and drilled discs.",
        "A car with a specific M3 badge on the rear.",
        "A car with a wide and low stance, typical of a sports car.",
        "A car with a luxurious interior featuring leather seats and a driver-focused cockpit."
    ],
    "2012 BMW X3 SUV": [
        "A car with a kidney-shaped grille, a signature feature of BMW.",
        "A car with a round BMW emblem on the hood and trunk.",
        "A car with a sleek, aerodynamic design.",
        "A car with a high ground clearance, typical of SUVs.",
        "A car with a long, sloping roofline.",
        "A car with a dual exhaust system.",
        "A car with a compact, yet spacious interior.",
        "A car with a panoramic sunroof.",
        "A car with a rear spoiler.",
        "A car with a large, wide front bumper.",
        "A car with a set of angular, halogen headlights.",
        "A car with a set of fog lights located low on the front bumper.",
        "A car with a set of 17-inch alloy wheels.",
        "A car with a rear window wiper.",
        "A car with a set of roof rails.",
        "A car with a set of LED taillights.",
        "A car with a rearview camera.",
        "A car with a leather-wrapped steering wheel.",
        "A car with a set of power-adjustable front seats.",
        "A car with a set of side mirrors with integrated turn signals.",
        "A car with a set of front and rear parking sensors.",
        "A car with a set of automatic rain-sensing wipers.",
        "A car with a set of automatic headlights.",
        "A car with a set of heated front seats.",
        "A car with a set of dual-zone automatic climate control."
    ],
    "2012 BMW X6 SUV": [
        "A car with a distinctive coupe-like sloping roofline.",
        "A car with a large, prominent kidney grille at the front.",
        "A car with dual round headlights that are slightly cut off at the top.",
        "A car with a high ground clearance, typical of SUVs.",
        "A car with a wide and muscular stance.",
        "A car with flared wheel arches.",
        "A car with a split tailgate, the upper part being the window and the lower part being the actual tailgate.",
        "A car with four doors and a hatchback-style rear.",
        "A car with dual exhaust pipes at the rear.",
        "A car with a long hood and a short rear deck.",
        "A car with a BMW logo on the hood and at the center of the trunk.",
        "A car with a side profile that shows a high beltline and a low roofline.",
        "A car with large alloy wheels, typically 19 or 20 inches.",
        "A car with a rear bumper that has a diffuser-style design.",
        "A car with a shark fin antenna on the roof.",
        "A car with exterior mirrors that have built-in turn signal lights.",
        "A car with a rear window that is angled more horizontally than vertically.",
        "A car with a front bumper that has large air intakes.",
        "A car with a rear spoiler above the rear window.",
        "A car with a body design that is more rounded than boxy."
    ],
    "2012 BMW Z4 Convertible": [
        "A car with a long hood and short rear deck, typical of a roadster design.",
        "A car with a retractable hardtop roof.",
        "A car with dual round headlights that are slightly angled towards the kidney grille.",
        "A car with a distinctive kidney-shaped grille, a signature feature of BMW.",
        "A car with a side vent located just behind the front wheel arches.",
        "A car with a twin exhaust system located at the center of the rear.",
        "A car with a rear diffuser integrated into the bumper.",
        "A car with a small rear spoiler integrated into the trunk lid.",
        "A car with a BMW logo located on the hood and trunk.",
        "A car with 17-inch alloy wheels as standard, with larger options available.",
        "A car with a high beltline that gives it a low-slung appearance.",
        "A car with a short overhang at the front and rear.",
        "A car with a muscular and sculpted side profile.",
        "A car with a wide and low stance.",
        "A car with a three-spoke steering wheel with multifunction buttons.",
        "A car with a driver-focused cockpit layout.",
        "A car with a digital display located in the center of the dashboard.",
        "A car with a start-stop button located next to the gear shift lever.",
        "A car with a BMW iDrive controller located on the center console.",
        "A car with a leather-wrapped gear shift lever.",
        "A car with sport seats as standard, with optional heated seats.",
        "A car with a wind deflector located behind the seats.",
        "A car with a roll-over protection system visible behind the headrests."
    ],
    "2012 Bentley Continental GT Coupe": [
        "A car with a large, prominent grille that is rectangular in shape and has a chrome finish.",
        "A car with a pair of round headlights on each side of the grille, with the inner ones being larger.",
        "A car with a 'B' emblem on the hood and the center of the wheel hubs.",
        "A car with a long, sloping hood and a short rear deck.",
        "A car with a two-door design, indicating it's a coupe.",
        "A car with a muscular, sculpted body design, especially noticeable on the sides and rear.",
        "A car with large, pronounced wheel arches housing 20 or 21-inch alloy wheels.",
        "A car with a dual exhaust system with oval-shaped tips on each side of the rear.",
        "A car with a high beltline and a low roofline, giving it a sporty, aggressive stance.",
        "A car with a retractable rear spoiler that automatically deploys at certain speeds.",
        "A car with a luxurious interior, featuring high-quality leather upholstery and wood veneer trim.",
        "A car with a large, centrally located infotainment screen on the dashboard.",
        "A car with a distinctive 'winged' design theme on the dashboard, mimicking the Bentley logo.",
        "A car with a four-seat configuration, with two individual rear seats separated by a center console.",
        "A car with a keyless entry and ignition system, as indicated by a start/stop button on the console.",
        "A car with a large, round speedometer and tachometer on the instrument cluster, with a smaller multi-function display in between.",
        "A car with a traditional gear lever on the center console, rather than a rotary dial or buttons.",
        "A car with a panoramic sunroof, covering almost the entire roof."
    ],
    "2012 Bentley Continental Supersports Conv. Convertible": [
        "A car with a large, prominent grille with a 'B' emblem in the center.",
        "A car with four round headlights, two on each side of the grille.",
        "A car with a long, wide hood and a short rear deck.",
        "A car with a convertible roof.",
        "A car with large, multi-spoke alloy wheels.",
        "A car with a muscular, sculpted body design.",
        "A car with a high beltline and a low roofline.",
        "A car with a dual exhaust system with oval-shaped tips.",
        "A car with a luxurious, leather-clad interior.",
        "A car with a sporty, three-spoke steering wheel.",
        "A car with a digital instrument cluster and a large infotainment screen in the center of the dashboard.",
        "A car with a 'B' emblem on the center of the wheel hubs.",
        "A car with a wide, low stance.",
        "A car with a large, prominent rear spoiler.",
        "A car with a Bentley winged 'B' badge on the trunk lid.",
        "A car with a high-performance braking system with large, visible brake calipers.",
        "A car with a sleek, aerodynamic profile.",
        "A car with a distinctive, aggressive front bumper design.",
        "A car with a rear diffuser for improved aerodynamics.",
        "A car with a 'Supersports' badge on the side."
    ],
    "2012 Buick Enclave SUV": [
        "A car with a waterfall-style front grille.",
        "A car with a tri-shield Buick logo at the center of the grille.",
        "A car with a rounded, sleek body design.",
        "A car with a high beltline and low roofline.",
        "A car with chrome accents around the windows and along the sides.",
        "A car with large, wraparound headlights that extend into the fenders.",
        "A car with a long, sloping windshield.",
        "A car with a dual exhaust system.",
        "A car with a large, prominent Buick emblem on the rear tailgate.",
        "A car with a rear spoiler above the back window.",
        "A car with 19-inch, ten-spoke machined aluminum wheels.",
        "A car with LED daytime running lights.",
        "A car with a roof rack for additional cargo.",
        "A car with a power liftgate at the rear.",
        "A car with a three-row seating arrangement inside.",
        "A car with a dual-panel sunroof.",
        "A car with a rearview camera system.",
        "A car with a touchscreen infotainment system in the center of the dashboard.",
        "A car with wood-grain accents on the interior.",
        "A car with a leather-wrapped steering wheel."
    ],
    "2012 Buick Regal GS": [
        "A car with a waterfall-style front grille.",
        "A car with a Buick emblem in the center of the grille.",
        "A car with a pair of large, wraparound headlights.",
        "A car with a lower front fascia that includes vertical air intakes.",
        "A car with a sleek, aerodynamic profile.",
        "A car with 19-inch, 5-twin-spoke alloy wheels.",
        "A car with Brembo front calipers visible behind the wheels.",
        "A car with a rear spoiler on the trunk lid.",
        "A car with dual exhaust outlets integrated into the rear bumper.",
        "A car with a GS badge on the trunk lid.",
        "A car with a power sunroof.",
        "A car with a body-color door handles and side mirrors.",
        "A car with a chrome trim around the side windows.",
        "A car with a high beltline and a sloping roofline.",
        "A car with a LED taillights.",
        "A car with a rear diffuser.",
        "A car with a sporty and aggressive stance.",
        "A car with a compact and muscular design.",
        "A car with a distinctive, sculpted hood.",
        "A car with a unique, sporty front and rear fascia."
    ],
    "2012 Buick Verano Sedan": [
        "A car with a waterfall-style front grille.",
        "A car with blue-accented projector beam headlamps.",
        "A car with a compact, sleek design.",
        "A car with a chrome accent around the windows.",
        "A car with 17-inch multi-spoke alloy wheels.",
        "A car with a body-colored rear spoiler.",
        "A car with a dual exhaust system with chrome tips.",
        "A car with a high-mounted LED stop lamp.",
        "A car with body-colored door handles.",
        "A car with heated power outside mirrors.",
        "A car with a solar absorbing windshield.",
        "A car with a compact spare tire.",
        "A car with a body-colored front and rear bumpers.",
        "A car with a front license plate bracket.",
        "A car with a remote keyless entry system.",
        "A car with a rear window defogger.",
        "A car with a solar-ray light-tinted glass.",
        "A car with a front intermittent variable wiper.",
        "A car with a signature Buick portholes on the hood.",
        "A car with a distinct Buick emblem on the grille and rear."
    ],
    "2012 Cadillac CTS-V Sedan": [
        "A car with a bold and aggressive front grille featuring a prominent Cadillac emblem.",
        "A car with a sleek, aerodynamic profile and a high beltline.",
        "A car with a dual-exhaust system integrated into the rear bumper.",
        "A car with a distinctive V-shaped badge on the rear, indicating its high-performance variant.",
        "A car with 19-inch painted aluminum wheels with high-performance Brembo brakes visible behind them.",
        "A car with a power bulge on the hood, indicating the presence of a supercharged engine underneath.",
        "A car with vertical LED daytime running lights and HID headlamps.",
        "A car with a rear spoiler for improved aerodynamics.",
        "A car with a cabin featuring high-quality materials, including leather and suede microfiber.",
        "A car with a pop-up navigation screen in the center of the dashboard.",
        "A car with Recaro performance seating available.",
        "A car with a distinctive 'V' badge on the steering wheel.",
        "A car with a rear-wheel-drive layout.",
        "A car with a 6.2L V8 engine, which is unique to the CTS-V model.",
        "A car with a six-speed manual or automatic transmission.",
        "A car with Magnetic Ride Control, a suspension system that adjusts to road conditions."
    ],
    "2012 Cadillac SRX SUV": [
        "A car with a bold, angular front grille featuring the Cadillac emblem.",
        "A car with a sleek, aerodynamic profile.",
        "A car with vertical LED taillights.",
        "A car with a dual-exhaust system.",
        "A car with a large, panoramic sunroof.",
        "A car with a rear spoiler.",
        "A car with 18-inch alloy wheels.",
        "A car with a roof rack for additional storage.",
        "A car with high-intensity discharge (HID) headlamps.",
        "A car with a rear window wiper.",
        "A car with a power liftgate.",
        "A car with a distinctive, boxy rear end.",
        "A car with chrome door handles.",
        "A car with body-colored side mirrors with integrated turn signals.",
        "A car with a long, sloping windshield.",
        "A car with a prominent, bulging hood.",
        "A car with a rear privacy glass.",
        "A car with a front bumper that houses fog lights.",
        "A car with a rear bumper that has a black lower section.",
        "A car with a Cadillac's signature vertical light pipe technology in the front headlights."
    ],
    "2012 Chevrolet Avalanche Crew Cab": [
        "A car with a unique midgate design that allows the rear cabin wall and window to fold down, extending the bed length.",
        "A car with a distinctive two-tone exterior color scheme, with the lower portion typically in a different color.",
        "A car with a large, bold front grille featuring the Chevrolet emblem in the center.",
        "A car with a boxy, truck-like shape and a four-door crew cab design.",
        "A car with a short bed with hard tonneau cover that is flush with the top of the cab.",
        "A car with large, flared wheel arches and side body cladding.",
        "A car with a robust front bumper with integrated fog lights.",
        "A car with a rear step bumper for easy access to the bed.",
        "A car with a towing hitch at the rear, indicating its towing capabilities.",
        "A car with 17-inch alloy wheels as standard, with larger options available.",
        "A car with roof rack side rails for additional cargo capacity.",
        "A car with a large, rectangular side mirrors for better visibility.",
        "A car with a high ground clearance, indicative of its off-road capabilities.",
        "A car with a distinctive Chevrolet taillight design.",
        "A car with a rear window that can be removed independently of the midgate.",
        "A car with a six-speed automatic transmission, as indicated by the gear shift in the interior photo.",
        "A car with a spacious interior that can seat up to six passengers.",
        "A car with a dashboard design that is typical of Chevrolet vehicles from the early 2010s."
    ],
    "2012 Chevrolet Camaro Convertible": [
        "A car with a large, wide grille that spans almost the entire width of the front end.",
        "A car with a low, sleek profile and a long hood.",
        "A car with a convertible soft top.",
        "A car with two doors and four seats.",
        "A car with a rear spoiler.",
        "A car with a round, dual-exhaust system.",
        "A car with a distinctive, muscular body design.",
        "A car with a Chevrolet emblem on the front and rear.",
        "A car with a set of large, five-spoke alloy wheels.",
        "A car with a pair of narrow, elongated headlights.",
        "A car with a short rear deck.",
        "A car with a wide, low stance.",
        "A car with a fuel filler door located on the driver's side rear quarter panel.",
        "A car with a bulging hood that suggests a powerful engine underneath.",
        "A car with a rear diffuser.",
        "A car with a pair of rectangular-shaped, vertically stacked tail lights on each side.",
        "A car with a small, sporty antenna on the rear.",
        "A car with a wide, flat dashboard and a deep-set instrument cluster.",
        "A car with a high beltline and relatively small side windows.",
        "A car with a distinctive side profile, featuring a sharp crease running from the front wheel arch to the rear."
    ],
    "2012 Chevrolet Corvette Convertible": [
        "A car with a long, low hood and short rear deck.",
        "A car with a convertible roof.",
        "A car with a large, prominent grille with the Chevrolet emblem in the center.",
        "A car with two doors.",
        "A car with a rear spoiler.",
        "A car with a pair of round taillights on each side.",
        "A car with a pair of high-intensity discharge headlamps.",
        "A car with a wide, low stance.",
        "A car with a pair of large, circular exhaust pipes centered in the rear.",
        "A car with a sculpted side profile with a prominent fender.",
        "A car with a small, glass rear window in the convertible top.",
        "A car with a fuel filler cap on the driver's side rear quarter panel.",
        "A car with a Corvette emblem on the front side of the car.",
        "A car with a 'Corvette' script on the rear of the car.",
        "A car with a large, bulging hood to accommodate the engine.",
        "A car with a pair of side mirrors that are body-colored.",
        "A car with a pair of fog lights integrated into the front bumper.",
        "A car with a pair of air intake vents on the hood.",
        "A car with a pair of air intake vents behind the front wheels on the side fenders.",
        "A car with a pair of large, wide tires for high-performance driving."
    ],
    "2012 Chevrolet Corvette ZR1": [
        "A car with a large, prominent grille at the front.",
        "A car with a sleek, aerodynamic body shape.",
        "A car with a long hood and a short rear deck.",
        "A car with a distinctive 'ZR1' badge on the rear.",
        "A car with a carbon fiber roof and hood.",
        "A car with a visible supercharger through a polycarbonate window on the hood.",
        "A car with a quad exhaust system at the center of the rear.",
        "A car with a small rear spoiler.",
        "A car with large, multi-spoke alloy wheels.",
        "A car with high-performance Brembo brakes visible behind the wheels.",
        "A car with a two-door coupe body style.",
        "A car with a distinctive Chevrolet emblem on the front grille and rear.",
        "A car with a blue-tinted engine cover visible through the hood window.",
        "A car with a dual-mode exhaust system.",
        "A car with a wide, low stance.",
        "A car with a large, bulging fender flares.",
        "A car with a carbon fiber front splitter and rocker moldings.",
        "A car with HID headlamps and LED daytime running lights.",
        "A car with a two-tone color scheme, typically a primary color with black or silver accents.",
        "A car with a 'Corvette' nameplate on the rear."
    ],
    "2012 Chevrolet Silverado 1500 Extended Cab": [
        "A car with a large, chrome grille that spans the entire front of the vehicle.",
        "A car with the Chevrolet emblem prominently displayed in the center of the grille.",
        "A car with a boxy, robust body shape typical of pickup trucks.",
        "A car with a long bed behind the passenger cabin.",
        "A car with an extended cab, meaning there are four doors and additional seating behind the front seats.",
        "A car with large, prominent wheel arches.",
        "A car with a high ground clearance, typical of pickup trucks.",
        "A car with a towing hitch at the back, indicating its utility nature.",
        "A car with rectangular headlights on either side of the grille.",
        "A car with a flat, horizontal hood and a straight, vertical windshield.",
        "A car with side mirrors that are large and rectangular, designed for towing visibility.",
        "A car with a step bumper at the back for easy access to the truck bed.",
        "A car with a fuel cap located on the driver's side.",
        "A car with Chevrolet's unique body lines and design cues, such as the crease that runs from the front fender through the doors and towards the rear.",
        "A car with 17-inch steel wheels as standard, with options for alloy wheels.",
        "A car with a spare tire mounted under the bed at the rear.",
        "A car with a short antenna mounted on the right side of the hood.",
        "A car with a single exhaust pipe located on the passenger side at the rear."
    ],
    "2012 Chevrolet Silverado 1500 Hybrid Crew Cab": [
        "A car with a large, rectangular front grille with the Chevrolet emblem in the center.",
        "A car with a hybrid badge on the side, indicating its hybrid nature.",
        "A car with a crew cab configuration, meaning it has four full-sized doors and a spacious rear seating area.",
        "A car with a boxy, robust body shape typical of pickup trucks.",
        "A car with a long bed in the rear for cargo.",
        "A car with a pair of stacked headlights on each side of the front grille.",
        "A car with a prominent hood and a high ground clearance.",
        "A car with a side mirror that has a built-in turn signal.",
        "A car with a rear bumper that has steps for easy access to the bed.",
        "A car with a tailgate that has the Chevrolet logo embossed on it.",
        "A car with 17-inch aluminum wheels.",
        "A car with a two-tone interior color scheme.",
        "A car with a large center console for storage and controls.",
        "A car with a towing package, including a hitch receiver and wiring harness.",
        "A car with a fuel economy gauge in the instrument cluster, specific to the hybrid model."
    ],
    "2012 Chevrolet Silverado 1500 Regular Cab": [
        "A car with a large, rectangular grille with horizontal bars and a prominent Chevrolet emblem in the center.",
        "A car with a boxy, rugged exterior design.",
        "A car with a two-door body style, indicating it's a regular cab.",
        "A car with a long, flat truck bed at the rear.",
        "A car with large, rounded wheel arches.",
        "A car with a high ground clearance.",
        "A car with a pair of rectangular headlights on either side of the grille.",
        "A car with a wide, flat hood and a straight, upright windshield.",
        "A car with a pair of towing mirrors extending from the doors.",
        "A car with a step bumper at the rear for easy access to the truck bed.",
        "A car with a single exhaust pipe on the right side.",
        "A car with a Chevrolet logo on the center of the tailgate.",
        "A car with 17-inch steel wheels.",
        "A car with a side-hinged tailgate at the rear.",
        "A car with a fuel cap located on the driver's side.",
        "A car with a large, prominent antenna on the right side of the hood.",
        "A car with a body-colored front bumper.",
        "A car with a pair of fog lights located on the lower part of the front bumper."
    ],
    "2012 Chevrolet Silverado 2500HD Regular Cab": [
        "A car with a large, bold front grille featuring the Chevrolet emblem.",
        "A car with a boxy, rugged body design.",
        "A car with a single-row cabin, indicating it's a regular cab model.",
        "A car with a long, flat cargo bed at the rear.",
        "A car with large, pronounced wheel arches.",
        "A car with rectangular headlights.",
        "A car with a high ground clearance, indicative of a heavy-duty pickup.",
        "A car with a side mirror that extends out on an arm, useful for towing visibility.",
        "A car with a sturdy, heavy-duty bumper.",
        "A car with a towing hitch at the back, indicating its towing capabilities.",
        "A car with a step bumper for easy access to the truck bed.",
        "A car with a two-door design, typical of regular cab models.",
        "A car with a fuel cap located on the driver's side.",
        "A car with Chevrolet's specific design language from the 2012 era.",
        "A car with a visible antenna on the roof for radio reception.",
        "A car with a large, sturdy set of tires, suitable for a heavy-duty vehicle.",
        "A car with a visible exhaust pipe on the passenger side.",
        "A car with a rear window that spans the width of the cab.",
        "A car with a license plate holder located centrally on the rear bumper."
    ],
    "2012 Chevrolet Sonic Sedan": [
        "A car with a compact, four-door sedan body style.",
        "A car with a distinctive dual-port grille design.",
        "A car with round headlights and circular taillights.",
        "A car with a short rear deck and a high beltline.",
        "A car with a small, rear spoiler integrated into the trunk lid.",
        "A car with a 'hidden' rear door handle located high up in the C-pillar.",
        "A car with a relatively long wheelbase for its compact size.",
        "A car with 15-inch steel wheels as standard.",
        "A car with a small, round fuel filler door on the rear quarter panel.",
        "A car with a Chevrolet emblem prominently displayed on the front grille and rear trunk.",
        "A car with body-colored door handles and mirrors.",
        "A car with a relatively low ground clearance.",
        "A car with a small, compact antenna on the rear roof.",
        "A car with a relatively flat roofline that slopes slightly towards the rear.",
        "A car with a small, rectangular license plate holder on the rear bumper.",
        "A car with a single exhaust pipe located on the right side of the rear bumper."
    ],
    "2012 Chevrolet Tahoe Hybrid SUV": [
        "A car with a hybrid badge on the rear liftgate and sides.",
        "A car with a large, chrome grille that has a prominent Chevrolet emblem in the center.",
        "A car with a boxy, upright stance typical of traditional SUVs.",
        "A car with a roof rack on top.",
        "A car with a pair of rectangular headlights on each side of the grille.",
        "A car with a pair of fog lights located on the lower front bumper.",
        "A car with 18-inch, 8-lug, polished aluminum wheels.",
        "A car with a rear wiper on the back window.",
        "A car with a large rear liftgate that opens upwards.",
        "A car with a towing hitch receiver at the back.",
        "A car with a split front bench seat, which is rare in modern vehicles.",
        "A car with a two-tone interior color scheme.",
        "A car with a digital display in the center of the instrument cluster.",
        "A car with a large center console with cup holders and storage compartments.",
        "A car with a third row of seats, indicating it can seat up to eight passengers.",
        "A car with a hybrid powertrain, indicated by the \"Hybrid\" badging and the energy flow screen on the dashboard."
    ],
    "2012 Chevrolet Traverse SUV": [
        "A car with a large, dual-port grille with a prominent Chevrolet emblem in the center.",
        "A car with rounded, swept-back headlights on either side of the grille.",
        "A car with a long, horizontal tail light design that wraps around to the sides.",
        "A car with a boxy, upright stance and a high beltline.",
        "A car with a three-row seating configuration.",
        "A car with a rear liftgate that opens upwards.",
        "A car with a roof rack for additional cargo.",
        "A car with a relatively flat hood and windshield.",
        "A car with a prominent crease running along the side, from the front wheel well to the tail lights.",
        "A car with five-spoke alloy wheels.",
        "A car with a large, rectangular rear window.",
        "A car with body-colored door handles and side mirrors.",
        "A car with a small antenna on the rear part of the roof.",
        "A car with a dual exhaust system.",
        "A car with a Chevrolet emblem on the center of the rear liftgate.",
        "A car with a relatively high ground clearance, typical of SUVs.",
        "A car with a chrome trim around the side windows.",
        "A car with a large, wide windshield and relatively large side windows.",
        "A car with a split front grille design, with the upper part being significantly smaller than the lower part.",
        "A car with a small, rectangular fog light on each side of the lower front bumper."
    ],
    "2012 Chrysler Town and Country Minivan": [
        "A car with a boxy, yet sleek, body design.",
        "A car with a distinctive front grille featuring the Chrysler logo.",
        "A car with dual sliding doors on either side.",
        "A car with a rear liftgate door.",
        "A car with a long wheelbase and a high roofline.",
        "A car with a large, rectangular-shaped front windshield.",
        "A car with a pair of rectangular-shaped headlights on either side of the grille.",
        "A car with a pair of fog lights located at the lower part of the front bumper.",
        "A car with a pair of vertical taillights at the rear.",
        "A car with a roof rack for additional storage.",
        "A car with a short hood and a long rear section.",
        "A car with a visible antenna on the roof.",
        "A car with a pair of power-folding, heated side mirrors.",
        "A car with 17-inch aluminum wheels.",
        "A car with a rear spoiler above the back window.",
        "A car with a visible exhaust pipe on the right side at the rear.",
        "A car with a visible rear wiper on the back window.",
        "A car with a visible Chrysler badge on the rear liftgate."
    ],
    "2012 Dodge Caliber Wagon": [
        "A car with a compact, boxy shape, characteristic of a small wagon or crossover SUV.",
        "A car with a bold, aggressive front grille featuring the Dodge emblem.",
        "A car with a high roofline, providing ample headroom for passengers.",
        "A car with a rear liftgate, characteristic of a wagon body style.",
        "A car with a relatively flat hood and windshield, giving it a somewhat squared-off appearance.",
        "A car with large, round headlights on either side of the grille.",
        "A car with a rear spoiler, adding a sporty touch to the vehicle.",
        "A car with five-spoke alloy wheels, typical of the 2012 Dodge Caliber.",
        "A car with a two-tone interior, often featuring a darker upper dash and lighter lower dash.",
        "A car with a distinctive instrument panel, featuring large, round gauges.",
        "A car with a center console that houses the gear shift and cup holders.",
        "A car with a split-folding rear seat, providing flexibility for cargo and passengers.",
        "A car with a relatively high ground clearance, compared to other compact cars.",
        "A car with a rear window wiper, a common feature on wagons and SUVs.",
        "A car with a relatively short wheelbase, contributing to its compact size.",
        "A car with a single exhaust pipe located on the right side of the rear bumper."
    ],
    "2012 Dodge Charger Sedan": [
        "A car with a bold, aggressive front end featuring a large, crosshair grille.",
        "A car with a long, sloping rear roofline, giving it a fastback-like profile.",
        "A car with a set of large, wrap-around headlights.",
        "A car with a sculpted hood and sides.",
        "A car with a rear end that features distinctive, racetrack-style taillights.",
        "A car with a dual exhaust system.",
        "A car with a large, spacious interior with a performance-inspired instrument panel.",
        "A car with a body that measures approximately 200 inches in length.",
        "A car with a large, prominent Dodge emblem on the front grille.",
        "A car with 17-inch alloy wheels as standard.",
        "A car with a high beltline and narrow windows.",
        "A car with a large, 8.4-inch touchscreen display in the center console.",
        "A car with a push-button start and keyless entry.",
        "A car with a rear spoiler on some models.",
        "A car with a choice of several bold exterior colors, including red, blue, black, and silver.",
        "A car with a distinctive, muscular stance and broad shoulders.",
        "A car with a large trunk and a split-folding rear seat for additional cargo space.",
        "A car with a powerful V6 or V8 engine under the hood.",
        "A car with a five-speed automatic transmission as standard.",
        "A car with a rear-wheel drive layout."
    ],
    "2012 Dodge Durango SUV": [
        "A car with a bold, muscular exterior design.",
        "A car with a signature crosshair grille.",
        "A car with a large, aggressive front bumper.",
        "A car with a long, boxy body shape.",
        "A car with a high ground clearance.",
        "A car with a roof rack for additional storage.",
        "A car with a rear spoiler.",
        "A car with dual exhaust pipes.",
        "A car with large, prominent wheel arches.",
        "A car with a large, rectangular rear window.",
        "A car with a rear windshield wiper.",
        "A car with a seven-slot grille.",
        "A car with a large, square-shaped cargo area.",
        "A car with a third row of seating visible through the windows.",
        "A car with a distinctive 'DODGE' lettering on the rear.",
        "A car with a large, prominent Dodge emblem on the front and rear.",
        "A car with a side profile that slopes slightly towards the rear.",
        "A car with a large, square-shaped side mirrors.",
        "A car with a distinctive C-pillar design.",
        "A car with a large, rectangular front headlights.",
        "A car with a rectangular rear taillights that extend onto the tailgate.",
        "A car with a large, square-shaped fog lights.",
        "A car with a five-spoke alloy wheel design.",
        "A car with a visible towing hitch at the rear.",
        "A car with a fuel filler cap on the driver's side."
    ],
    "2012 Dodge Journey SUV": [
        "A car with a crosshair grille design.",
        "A car with a boxy yet streamlined body shape.",
        "A car with a large, bold front bumper.",
        "A car with a pair of sleek, wrap-around headlights.",
        "A car with a high ground clearance.",
        "A car with a roof rack for additional storage.",
        "A car with a rear spoiler.",
        "A car with a dual exhaust system.",
        "A car with a large, rectangular rear window.",
        "A car with a pair of vertical taillights.",
        "A car with a five-door body style.",
        "A car with a compact spare tire mounted under the body.",
        "A car with a long wheelbase for an SUV.",
        "A car with a Dodge emblem on the front and rear.",
        "A car with a rear window wiper.",
        "A car with a side mirror integrated turn signal.",
        "A car with alloy wheels.",
        "A car with a visible antenna on the roof.",
        "A car with a fuel cap on the left side.",
        "A car with a visible 'Journey' badge on the rear."
    ],
    "2012 FIAT 500 Abarth": [
        "A car with a compact, rounded design.",
        "A car with a distinctive scorpion badge on the front grille and rear.",
        "A car with a dual exhaust system at the center of the rear bumper.",
        "A car with 17-inch alloy wheels.",
        "A car with red brake calipers.",
        "A car with a small, rounded headlight design.",
        "A car with a small, rounded taillight design.",
        "A car with a black or white stripe running from the front to the back on the roof and hood.",
        "A car with a small, rounded side mirror design.",
        "A car with a sporty body kit including side skirts and a rear spoiler.",
        "A car with a three-door hatchback body style.",
        "A car with a distinctive FIAT logo on the front and back.",
        "A car with a small, rounded rear window.",
        "A car with a black interior with red accents.",
        "A car with a manual transmission gear lever.",
        "A car with a turbo boost gauge on the dashboard.",
        "A car with a flat-bottomed steering wheel.",
        "A car with a high-mounted rear brake light.",
        "A car with a small, rounded fuel cap on the right side.",
        "A car with a distinctive Abarth logo on the side."
    ],
    "2012 FIAT 500 Convertible": [
        "A car with a compact, rounded design.",
        "A car with a retractable, cloth top.",
        "A car with a distinctive, circular headlight design.",
        "A car with a small, chrome-trimmed grille below the license plate.",
        "A car with a 'whiskers and logo' face on the front.",
        "A car with a rear-mounted antenna.",
        "A car with a small, hatchback-style trunk.",
        "A car with a dual-exhaust system.",
        "A car with 15-inch alloy wheels.",
        "A car with body-colored side mirrors.",
        "A car with a high-mounted, two-piece taillight design.",
        "A car with a small, round fog light on each side of the front bumper.",
        "A car with a chrome door handle.",
        "A car with a short, stubby rear end.",
        "A car with a FIAT badge on the front and back.",
        "A car with a 500 badge on the rear right side.",
        "A car with a small, two-door design.",
        "A car with a compact, four-seater interior.",
        "A car with a body-colored dashboard.",
        "A car with a three-spoke steering wheel."
    ],
    "2012 Ferrari 458 Italia Convertible": [
        "A car with a retractable hardtop roof, which is a unique feature of a convertible.",
        "A car with a distinctive three-layer paintwork, which is a signature of the 2012 Ferrari 458 Italia Convertible.",
        "A car with a 4.5-liter V8 engine visible through a glass cover.",
        "A car with a seven-speed dual-clutch automatic transmission.",
        "A car with a distinctive triple exhaust pipes centered in the rear.",
        "A car with a front fascia that includes a single wide mouth opening for air intake.",
        "A car with bi-xenon headlamps and LED running lights.",
        "A car with a rear diffuser and aerodynamic design to improve downforce.",
        "A car with a speedometer that reads up to 220 mph (350 km/h).",
        "A car with a distinctive Ferrari logo on the front hood and rear.",
        "A car with a two-door, two-seat layout.",
        "A car with 20-inch wheels and high-performance Brembo brakes.",
        "A car with a luxurious interior featuring leather upholstery and a high-tech control system.",
        "A car with a distinctive '458 Italia' badge on the rear.",
        "A car with a flat-bottomed steering wheel that includes many controls like turn signals, ignition button, and suspension settings.",
        "A car with a high rear deck and low front hood, giving it a wedge-like profile.",
        "A car with a rear spoiler that is integrated into the tail lights and rear bumper.",
        "A car with a high-mounted centrally located tachometer in the instrument cluster.",
        "A car with a distinctive Ferrari prancing horse logo on the steering wheel."
    ],
    "2012 Ferrari 458 Italia Coupe": [
        "A car with a sleek, aerodynamic design.",
        "A car with a low, wide stance.",
        "A car with a distinctive three-vent front grille.",
        "A car with a large, prancing horse emblem on the front.",
        "A car with a long, sloping hood.",
        "A car with a short rear deck.",
        "A car with a rear diffuser and dual exhaust tips on each side.",
        "A car with a glass engine cover showcasing the mid-mounted engine.",
        "A car with a pair of round taillights on each side.",
        "A car with a retractable rear spoiler.",
        "A car with a two-door coupe body style.",
        "A car with a set of 20-inch alloy wheels.",
        "A car with a pair of bi-xenon headlamps.",
        "A car with a distinctive side air intake behind the doors.",
        "A car with a luxurious, two-seat cabin.",
        "A car with a flat-bottomed steering wheel featuring various controls.",
        "A car with a high-revving 4.5-liter V8 engine.",
        "A car with a seven-speed dual-clutch automatic transmission.",
        "A car with a yellow tachometer in the center of the instrument cluster.",
        "A car with a red or yellow body color, which are popular choices for this model."
    ],
    "2012 Ferrari California Convertible": [
        "A car with a retractable hardtop roof.",
        "A car with a prancing horse logo on the front grille.",
        "A car with a long, sleek hood and a short rear deck.",
        "A car with a front-engine, rear-wheel-drive layout.",
        "A car with a 2+2 seating configuration.",
        "A car with a three-part LED tail light design.",
        "A car with a dual exhaust system.",
        "A car with a large, wide front grille.",
        "A car with a rear diffuser.",
        "A car with a 4.3-liter V8 engine (though this may not be visible in a photo).",
        "A car with 20-inch diamond-finish alloy wheels.",
        "A car with a high-performance Brembo braking system (visible through the wheel spokes).",
        "A car with a sleek, aerodynamic profile.",
        "A car with a vented hood for improved engine cooling.",
        "A car with a distinctive 'Ferrari' badge on the rear.",
        "A car with a high-mounted third brake light.",
        "A car with a sculpted side profile with a prominent crease line running from the front wheel arch to the rear.",
        "A car with a 'California' badge on the rear.",
        "A car with a leather-upholstered interior (if interior is visible in the photo).",
        "A car with a distinctive Ferrari steering wheel with integrated controls (if interior is visible in the photo)."
    ],
    "2012 Ferrari FF Coupe": [
        "A car with a long, sloping hood and a short rear deck.",
        "A car with a large, prominent prancing horse emblem on the front grille.",
        "A car with a set of quad circular taillights.",
        "A car with a unique hatchback-like rear design.",
        "A car with a set of four exhaust pipes, two on each side.",
        "A car with a 2-door body style.",
        "A car with a distinctive side profile, featuring a sharp, downward-sloping roofline.",
        "A car with a set of large, 5-spoke alloy wheels.",
        "A car with a pair of large, elongated headlights that stretch back into the fenders.",
        "A car with a small, rectangular rear window.",
        "A car with a pair of large air intakes on the front bumper.",
        "A car with a small, sporty rear spoiler.",
        "A car with a luxurious, leather-clad interior featuring a large central infotainment screen.",
        "A car with a distinctive Ferrari logo on the center of the steering wheel.",
        "A car with a set of large, carbon-ceramic brake discs visible behind the wheels.",
        "A car with a pair of powerfully flared wheel arches.",
        "A car with a distinctive 'FF' badge on the rear."
    ],
    "2012 Fisker Karma Sedan": [
        "A car with a solar panel roof, which is a unique feature of the 2012 Fisker Karma Sedan.",
        "A car with a low, sleek profile and a long wheelbase.",
        "A car with a pronounced front grille that has a trapezoidal shape.",
        "A car with a pair of elongated headlights that stretch back into the fenders.",
        "A car with 22-inch wheels, which are standard on the 2012 Fisker Karma Sedan.",
        "A car with a pair of large exhaust outlets located in the lower rear bumper.",
        "A car with a distinctive 'moustache' design on the front grille.",
        "A car with a high-tech interior, including a large touch screen in the center console.",
        "A car with a unique 'diamond dust' paint finish, which is an option on the 2012 Fisker Karma Sedan.",
        "A car with a pair of rear-hinged 'coach' doors for the back seats.",
        "A car with a badge on the rear that says 'EVer', which stands for Electric Vehicle extended range, a unique feature of the 2012 Fisker Karma Sedan.",
        "A car with a long, sloping rear end that ends in a sharp point, a unique design feature of the 2012 Fisker Karma Sedan.",
        "A car with a Brembo brake system, which is standard on the 2012 Fisker Karma Sedan.",
        "A car with a unique 'eco-chic' interior, which uses environmentally friendly materials.",
        "A car with a pair of large, round tail lights that are located high on the rear fenders."
    ],
    "2012 Ford E-Series Wagon Van": [
        "A car with a boxy, utilitarian shape, typical of full-size vans.",
        "A car with a large, chrome grille that is split into three sections.",
        "A car with round headlights on either side of the grille.",
        "A car with a high roofline and a long, flat hood.",
        "A car with a sliding side door for rear passenger access.",
        "A car with large, rectangular windows along the sides.",
        "A car with a rear door that splits in the middle to open outward.",
        "A car with a Ford logo placed in the center of the grille.",
        "A car with a relatively flat windshield compared to modern, more aerodynamic designs.",
        "A car with a long wheelbase to accommodate multiple rows of seating.",
        "A car with a rear bumper that includes a step for easier access to the cargo area.",
        "A car with a side mirror that extends out on a long arm from the door.",
        "A car with a spare tire mounted under the rear of the vehicle.",
        "A car with a fuel cap located on the driver's side, towards the rear of the vehicle.",
        "A car with a simple, unadorned rear end with large, rectangular taillights.",
        "A car with a heavy-duty suspension visible beneath the vehicle.",
        "A car with a large, prominent antenna on the roof.",
        "A car with a relatively high ground clearance for a van.",
        "A car with a simple, functional interior visible through the windows, including multiple rows of bench seating.",
        "A car with a large, flat dashboard and a steering wheel with a Ford logo in the center."
    ],
    "2012 Ford Edge SUV": [
        "A car with a large, three-bar chrome grille.",
        "A car with a high beltline and a sloping roofline.",
        "A car with a rounded rear end and wraparound taillights.",
        "A car with a prominent Ford emblem centered on the grille.",
        "A car with a body-colored rear spoiler.",
        "A car with dual exhaust outlets.",
        "A car with 18-inch alloy wheels as standard.",
        "A car with a distinctive LED running lights.",
        "A car with a large, upright dashboard and center console.",
        "A car with a panoramic sunroof.",
        "A car with a rearview camera and parking sensors.",
        "A car with a touchscreen interface for the infotainment system.",
        "A car with a seating capacity for five passengers.",
        "A car with a split-folding rear seat that allows for more cargo space.",
        "A car with a keyless entry keypad on the driver's door.",
        "A car with a capless fuel filler system.",
        "A car with a Ford's MyKey system, which allows parents to set speed and volume limits for young drivers.",
        "A car with a blind-spot warning system and cross-traffic alert.",
        "A car with a six-speed automatic transmission.",
        "A car with a choice of three engines: a 3.5-liter V6, a 2.0-liter turbocharged four-cylinder, and a 3.7-liter V6."
    ],
    "2012 Ford F-150 Regular Cab": [
        "A car with a large, bold front grille with the Ford emblem in the center.",
        "A car with a boxy, utilitarian shape typical of pickup trucks.",
        "A car with a two-door body style, indicating it's a regular cab model.",
        "A car with a large cargo bed at the rear.",
        "A car with a high ground clearance and robust wheel arches.",
        "A car with a side mirror that extends further out, designed for towing visibility.",
        "A car with a rectangular, upright front end.",
        "A car with a long, flat hood.",
        "A car with a single row of seating.",
        "A car with a towing hitch at the back, indicating its utility nature.",
        "A car with a step bumper at the rear for easy access to the truck bed.",
        "A car with a Ford's signature C-shaped taillights.",
        "A car with a fuel cap located on the driver's side.",
        "A car with a visible antenna on the right side of the front hood.",
        "A car with a spare tire located underneath the cargo bed at the rear.",
        "A car with a Ford's specific 17-inch steel wheels.",
        "A car with a VIN number that starts with 1F, indicating it's a Ford vehicle made in the USA."
    ],
    "2012 Ford F-450 Super Duty Crew Cab": [
        "A car with a large, bold front grille with the Ford emblem in the center.",
        "A car with a boxy, robust body structure, indicative of a heavy-duty pickup truck.",
        "A car with a four-door crew cab configuration, providing ample interior space.",
        "A car with a long, flat truck bed at the rear.",
        "A car with large, prominent wheel arches housing heavy-duty wheels.",
        "A car with a high ground clearance, typical of heavy-duty trucks.",
        "A car with towing mirrors that extend out further than standard mirrors.",
        "A car with a step bumper at the rear for easy access to the truck bed.",
        "A car with a dual rear wheel setup on each side, often referred to as a 'dually'.",
        "A car with a distinctive 'Super Duty' badge on the front doors.",
        "A car with rectangular, vertically aligned headlights.",
        "A car with a large, sturdy front bumper with integrated fog lights.",
        "A car with a side step rail for easier access to the cab.",
        "A car with a large fuel tank, often visible beneath the truck bed.",
        "A car with a visible exhaust pipe on the side, indicative of a diesel engine.",
        "A car with a rear window in the cab, often sliding or with a defrost feature.",
        "A car with a visible hitch or towing setup at the rear."
    ],
    "2012 Ford Fiesta Sedan": [
        "A car with a compact, four-door design.",
        "A car with a trapezoidal front grille.",
        "A car with swept-back headlights.",
        "A car with a high-mounted rear brake light.",
        "A car with a Ford emblem centered on the front grille.",
        "A car with a small rear spoiler.",
        "A car with body-colored door handles and side mirrors.",
        "A car with a relatively short rear overhang.",
        "A car with a license plate mounted on the center of the trunk.",
        "A car with a small, rounded rear end.",
        "A car with a long, sloping windshield.",
        "A car with a Ford logo on the center of the wheel caps.",
        "A car with a compact, boxy shape.",
        "A car with a relatively low ground clearance.",
        "A car with a small, rounded hood.",
        "A car with a single exhaust pipe on the right side.",
        "A car with a fuel cap on the passenger side.",
        "A car with a small antenna on the rear roof.",
        "A car with a relatively narrow body compared to its length.",
        "A car with a small, rounded trunk lid."
    ],
    "2012 GMC Acadia SUV": [
        "A car with a bold, rectangular grille featuring the GMC logo in the center.",
        "A car with a boxy, upright stance and a squared-off rear end.",
        "A car with a long, flat roofline and a rear spoiler.",
        "A car with wraparound rear glass and a rear window wiper.",
        "A car with large, rectangular headlights that flank the grille.",
        "A car with fog lights located in the lower front bumper.",
        "A car with a dual exhaust system.",
        "A car with 18-inch alloy wheels.",
        "A car with a roof rack for additional cargo.",
        "A car with a large, prominent wheel arches.",
        "A car with a side profile that features a character line running from the front fender to the rear taillights.",
        "A car with a rear liftgate that opens to a sizable cargo area.",
        "A car with a three-row seating configuration.",
        "A car with a GMC-specific instrument panel and center stack design.",
        "A car with a rearview camera system integrated into the rearview mirror.",
        "A car with a red reflector strip running across the tailgate.",
        "A car with a chrome trim around the windows and along the side body.",
        "A car with a body-colored side mirrors and door handles.",
        "A car with a fuel economy of around 17 mpg in the city and 24 mpg on the highway.",
        "A car with a 3.6-liter V6 engine that produces 288 horsepower and 270 pound-feet of torque."
    ],
    "2012 GMC Canyon Extended Cab": [
        "A car with a compact pickup truck body style.",
        "A car with a prominent GMC logo on the front grille.",
        "A car with a rectangular front grille divided into several sections.",
        "A car with two full-size front doors and two smaller rear-hinged back doors.",
        "A car with a bed in the rear for cargo.",
        "A car with a body-colored front bumper.",
        "A car with a rounded-rectangle shaped headlight on each side of the front grille.",
        "A car with a relatively high ground clearance.",
        "A car with a short rear overhang.",
        "A car with a long, flat cargo bed behind the passenger cabin.",
        "A car with a single exhaust pipe on the right side.",
        "A car with a step bumper at the rear.",
        "A car with a towing hitch at the rear.",
        "A car with a rectangular rear tail light on each side.",
        "A car with a side mirror on each of the front doors.",
        "A car with a visible antenna on the right front side.",
        "A car with a fuel cap on the left side.",
        "A car with a spare tire mounted under the cargo bed at the rear.",
        "A car with a relatively boxy design.",
        "A car with a visible third brake light above the rear window.",
        "A car with a GMC badge on the tailgate."
    ],
    "2012 GMC Savana Van": [
        "A car with a boxy, utilitarian shape, typical of full-size vans.",
        "A car with a large, prominent grille with the GMC logo in the center.",
        "A car with a long, flat hood and a nearly vertical windshield.",
        "A car with sliding doors on the side and large, swing-out doors at the rear.",
        "A car with large, rectangular headlights on either side of the grille.",
        "A car with a high roofline, providing ample interior space.",
        "A car with a single-piece rear door that swings up for cargo models.",
        "A car with a split, swing-out rear doors for passenger models.",
        "A car with a long wheelbase, providing a spacious cargo area.",
        "A car with a relatively plain, unadorned side profile, typical of commercial vans.",
        "A car with a wide, flat rear end with large, square taillights.",
        "A car with a sturdy, heavy-duty appearance, indicative of its work-oriented design.",
        "A car with a lack of rear windows in cargo models, or large, rectangular windows in passenger models.",
        "A car with a front-engine, rear-wheel-drive layout.",
        "A car with a heavy-duty suspension system, designed for carrying heavy loads.",
        "A car with a relatively high ground clearance, typical of utility vehicles.",
        "A car with a lack of decorative elements, emphasizing its functional design.",
        "A car with a large, wide side mirrors for improved visibility.",
        "A car with a simple, functional interior with durable materials.",
        "A car with a large, bulky bumper at the front and rear."
    ],
    "2012 GMC Terrain SUV": [
        "A car with a bold, boxy exterior design.",
        "A car with a prominent, squared-off grille featuring a large GMC logo in the center.",
        "A car with angular, high-mounted headlights.",
        "A car with a muscular hood and broad shoulders.",
        "A car with a distinctive C-pillar design that slopes forward.",
        "A car with a rear window that slopes down towards the rear end.",
        "A car with a rear end that features large, rectangular taillights.",
        "A car with a dual exhaust system.",
        "A car with a roof rack for additional cargo.",
        "A car with 17-inch painted aluminum wheels.",
        "A car with a body-colored bumper and door handles.",
        "A car with a rear liftgate that opens upwards.",
        "A car with a compact spare tire mounted under the body.",
        "A car with a long wheelbase and short overhangs.",
        "A car with a high ground clearance.",
        "A car with a wide stance and robust fender flares.",
        "A car with a side profile that features a strong, rising character line.",
        "A car with a rear spoiler above the back window.",
        "A car with a chrome trim around the windows and along the lower side of the body.",
        "A car with a black lower body cladding for off-road protection."
    ],
    "2012 GMC Yukon Hybrid SUV": [
        "A car with a large, boxy shape, typical of full-size SUVs.",
        "A car with a prominent GMC logo centered on the front grille.",
        "A car with a hybrid badge on the sides and rear, indicating its hybrid nature.",
        "A car with a distinctive front grille design, featuring a honeycomb pattern.",
        "A car with rectangular-shaped headlights on either side of the grille.",
        "A car with a roof rack, typical of SUVs designed for utility and outdoor activities.",
        "A car with a large side mirror, designed for better visibility.",
        "A car with a rear wiper, typical of SUVs and hatchbacks.",
        "A car with a step-up running board along the bottom of the side doors.",
        "A car with a large rear window and a high ground clearance.",
        "A car with a spare tire mounted under the rear of the vehicle.",
        "A car with a split tailgate, where the window and the door can be opened separately.",
        "A car with a Yukon badge on the left side of the tailgate.",
        "A car with a large, spacious interior, typical of full-size SUVs.",
        "A car with a third row of seats, indicating its capacity to seat more than five passengers.",
        "A car with a towing hitch at the rear, indicating its towing capabilities.",
        "A car with 18-inch alloy wheels, typical of full-size SUVs.",
        "A car with a large fuel door on the driver's side, indicating its hybrid nature.",
        "A car with a large, prominent bumper both at the front and rear.",
        "A car with a long wheelbase, typical of full-size SUVs."
    ],
    "2012 Honda Accord Coupe": [
        "A car with a sleek, two-door design.",
        "A car with a distinctive front grille featuring the Honda emblem.",
        "A car with angular headlights that are slightly swept back.",
        "A car with a long hood and a short rear deck.",
        "A car with a body-colored rear spoiler.",
        "A car with dual exhaust outlets.",
        "A car with 17-inch alloy wheels.",
        "A car with a sunroof.",
        "A car with body-colored power side mirrors.",
        "A car with chrome door handles.",
        "A car with a rear window defroster.",
        "A car with a compact spare tire.",
        "A car with projector-beam halogen headlights.",
        "A car with LED brake lights.",
        "A car with a body-colored impact-absorbing front and rear bumpers.",
        "A car with a security system with remote entry and trunk release.",
        "A car with a 6-speaker audio system.",
        "A car with a leather-wrapped steering wheel.",
        "A car with a 5-speed automatic transmission.",
        "A car with a 2.4L DOHC i-VTEC 4-cylinder engine.",
        "A car with a fuel economy of 23 city/32 highway mpg.",
        "A car with a seating capacity of 5 passengers.",
        "A car with a multi-angle rearview camera.",
        "A car with dual-zone automatic climate control.",
        "A car with a push-button ignition.",
        "A car with a 160-watt AM/FM/CD audio system.",
        "A car with a 6-disc in-dash CD changer.",
        "A car with a USB audio interface.",
        "A car with a Bluetooth HandsFreeLink.",
        "A car with a cruise control.",
        "A car with an illuminated steering wheel-mounted audio and cruise controls.",
        "A car with a tilt and telescopic steering column.",
        "A car with a center console with sliding armrest and storage compartments.",
        "A car with a maintenance minder system.",
        "A car with a map light.",
        "A car with a remote fuel filler door release.",
        "A car with a remote trunk release with lock.",
        "A car with a dual-stage, multiple-threshold front airbags (SRS).",
        "A car with a side curtain airbags with rollover sensor.",
        "A car with a vehicle stability assist (VSA) with traction control.",
        "A car with an anti-lock braking system (ABS).",
        "A car with an electronic brake distribution (EBD).",
        "A car with a tire pressure monitoring system (TPMS).",
        "A car with a daytime running lights (DRL).",
        "A car with a side-impact door beams.",
        "A car with a lower anchors and tethers for children (LATCH).",
        "A car with a child-proof rear door locks.",
        "A car with an emergency trunk release.",
        "A car with a immobilizer theft-deterrent system.",
        "A car with a front 3-point seat belts with automatic tensioning system."
    ],
    "2012 Honda Accord Sedan": [
        "A car with a chrome bar grille that spans the width of the front end.",
        "A car with a pair of clear lens halogen headlights that are slightly angled towards the center.",
        "A car with a body-colored front and rear bumper.",
        "A car with a body-colored power side mirror with manual folding feature.",
        "A car with 16-inch alloy wheels.",
        "A car with a chrome exhaust finisher.",
        "A car with a body-colored rear decklid spoiler.",
        "A car with a compact and sleek sedan body style.",
        "A car with a sunroof on the top.",
        "A car with a three-box body style with distinct compartments for the engine, passenger, and cargo.",
        "A car with a relatively low ground clearance.",
        "A car with a long and wide stance, giving it a sporty look.",
        "A car with a rear window defroster.",
        "A car with a high-mounted brake light.",
        "A car with a keyless entry system.",
        "A car with a four-door configuration.",
        "A car with a chrome door handle.",
        "A car with a dual-zone automatic climate control system inside.",
        "A car with a leather-wrapped steering wheel.",
        "A car with a spacious interior that can comfortably seat five passengers.",
        "A car with a large trunk for cargo.",
        "A car with a digital odometer and trip meter.",
        "A car with a multi-information display that shows various vehicle information.",
        "A car with a six-speaker audio system.",
        "A car with a front console with storage.",
        "A car with a rear center armrest.",
        "A car with a cruise control system.",
        "A car with a tilt and telescopic steering wheel.",
        "A car with a power windows and door locks.",
        "A car with a front and rear cupholders.",
        "A car with a front and rear reading lights.",
        "A car with a front and rear map lights.",
        "A car with a vanity mirror for the driver and front passenger.",
        "A car with a power driver seat with lumbar support.",
        "A car with a rear seat that can be folded down for additional cargo space.",
        "A car with a safety system that includes anti-lock brakes, stability control, and multiple airbags."
    ],
    "2012 Honda Odyssey Minivan": [
        "A car with a sleek, aerodynamic design, featuring a slightly sloping roofline.",
        "A car with a distinctive lightning bolt beltline that dips down towards the rear of the vehicle.",
        "A car with a large, prominent grille that is flanked by angular, swept-back headlights.",
        "A car with a rear window that wraps around to the sides of the vehicle.",
        "A car with sliding doors on both sides of the vehicle.",
        "A car with a rear tailgate that is slightly angled, rather than vertical.",
        "A car with a third brake light that is integrated into the rear spoiler.",
        "A car with a spacious interior that can comfortably seat up to eight passengers.",
        "A car with a dashboard that features a two-tier design, with the instrument cluster and infotainment system on the top tier.",
        "A car with a gear shift lever that is mounted on the dashboard, rather than on the floor or steering column.",
        "A car with a rear entertainment system that features a flip-down screen.",
        "A car with alloy wheels that have a five-spoke design.",
        "A car with a body-colored rearview mirror.",
        "A car with a dual exhaust system.",
        "A car with a sunroof that is located above the front seats.",
        "A car with a rearview camera that is integrated into the tailgate handle.",
        "A car with a body-colored door handles.",
        "A car with a chrome trim around the windows.",
        "A car with a roof rack for additional storage.",
        "A car with a Honda emblem in the center of the grille."
    ],
    "2012 Hyundai Accent Sedan": [
        "A car with a compact, four-door sedan body style.",
        "A car with Hyundai's \"Fluidic Sculpture\" design philosophy, which includes a flowing, aerodynamic shape.",
        "A car with a distinctive hexagonal front grille.",
        "A car with swept-back headlights that extend into the fenders.",
        "A car with a high roofline that slopes down to the trunk, giving it a coupe-like silhouette.",
        "A car with body-colored door handles and side mirrors.",
        "A car with a short rear deck and wrap-around taillights.",
        "A car with a small, compact rear end with a high-mounted brake light.",
        "A car with 14-inch steel wheels or optional 16-inch alloy wheels.",
        "A car with a relatively long wheelbase for its class, providing more interior space.",
        "A car with a small, triangular quarter window at the rear of the side windows.",
        "A car with a chrome accent line running along the bottom of the windows.",
        "A car with a single exhaust outlet on the right side.",
        "A car with a small antenna mounted at the rear of the roof.",
        "A car with a Hyundai logo prominently displayed on the front and rear."
    ],
    "2012 Hyundai Azera Sedan": [
        "A car with a large, bold front grille that is hexagonal in shape.",
        "A car with wraparound headlights that extend into the fenders.",
        "A car with a long, sleek profile and a coupe-like roofline.",
        "A car with a chrome strip that runs along the bottom of the windows and wraps around the rear.",
        "A car with dual exhaust outlets integrated into the rear bumper.",
        "A car with a high-mounted LED stop lamp.",
        "A car with a panoramic sunroof.",
        "A car with 18-inch alloy wheels.",
        "A car with a sculpted hood and a prominent crease running along the side.",
        "A car with a spacious, luxurious interior featuring a wraparound dashboard design.",
        "A car with a touchscreen navigation system in the center of the dashboard.",
        "A car with a push-button start and keyless entry.",
        "A car with heated and ventilated front seats.",
        "A car with a rearview camera and parking sensors.",
        "A car with a blue backlight for the instrument panel and controls.",
        "A car with a large trunk and a pass-through for long items.",
        "A car with a 3.3-liter V6 engine under the hood.",
        "A car with a six-speed automatic transmission.",
        "A car with a front-wheel-drive layout.",
        "A car with a Hyundai logo on the front and back."
    ],
    "2012 Hyundai Elantra Touring Hatchback": [
        "A car with a compact, five-door hatchback design.",
        "A car with a Hyundai logo on the front grille and rear.",
        "A car with a long, sloping roofline that ends in a rear spoiler.",
        "A car with a distinctive, rounded front end with large, swept-back headlights.",
        "A car with a rear window wiper, a feature common on hatchbacks.",
        "A car with a relatively high ground clearance for a compact car.",
        "A car with five-spoke alloy wheels.",
        "A car with a chrome-tipped dual exhaust.",
        "A car with a black, plastic lower body trim.",
        "A car with a rear hatch that opens upwards, revealing a large cargo area.",
        "A car with a roof-mounted antenna.",
        "A car with body-colored door handles and side mirrors.",
        "A car with a relatively long wheelbase for a compact car, providing more interior space.",
        "A car with a small, triangular window at the base of the A-pillar.",
        "A car with a Hyundai's signature hexagonal front grille.",
        "A car with a rear bumper that includes reflectors on either side.",
        "A car with a fuel filler door located on the vehicle's left side.",
        "A car with a front bumper that includes fog lights.",
        "A car with a rear defogger.",
        "A car with a side indicator on the side mirrors."
    ],
    "2012 Hyundai Genesis Sedan": [
        "A car with a large, trapezoidal front grille with horizontal chrome bars.",
        "A car with a Hyundai logo prominently displayed on the front grille.",
        "A car with sleek, swept-back headlights that are slightly angled towards the center.",
        "A car with a long, sloping hood and a high, short rear end.",
        "A car with a prominent crease running along the side, from the front wheel arch to the rear tail lights.",
        "A car with dual exhaust outlets integrated into the rear bumper.",
        "A car with a large, wide rear window and a short trunk lid.",
        "A car with 17-inch alloy wheels as standard, with larger options available.",
        "A car with a sunroof that extends over the front and rear seats.",
        "A car with LED tail lights that wrap around the sides of the vehicle.",
        "A car with side mirrors that have integrated turn signals.",
        "A car with a high beltline and a relatively low roofline, giving it a 'coke bottle' shape.",
        "A car with a chrome strip running along the bottom of the windows.",
        "A car with a rear spoiler integrated into the trunk lid.",
        "A car with a 'Genesis' badge on the right side of the trunk lid.",
        "A car with a '3.8' or '5.0' badge on the left side of the trunk lid, indicating the engine size.",
        "A car with a keyless entry system, indicated by small buttons on the door handles."
    ],
    "2012 Hyundai Santa Fe SUV": [
        "A car with a hexagonal front grille featuring horizontal chrome slats.",
        "A car with a Hyundai logo prominently displayed in the center of the front grille.",
        "A car with swept-back headlights that extend into the fenders.",
        "A car with a rounded, aerodynamic shape.",
        "A car with a high ground clearance, typical of SUVs.",
        "A car with five-spoke alloy wheels.",
        "A car with a roof rack for additional storage.",
        "A car with a rear spoiler above the back window.",
        "A car with a dual exhaust system.",
        "A car with a rear window wiper.",
        "A car with a large, square-shaped rear tailgate.",
        "A car with vertical taillights that extend from the rear bumper to the roof.",
        "A car with side mirrors that include integrated turn signals.",
        "A car with a visible antenna on the roof towards the rear.",
        "A car with a fuel cap located on the driver's side.",
        "A car with a visible 'Santa Fe' badge on the rear.",
        "A car with a body-colored bumper and door handles.",
        "A car with a visible rear parking sensor system.",
        "A car with a sunroof.",
        "A car with a visible 'Hyundai' badge on the rear."
    ],
    "2012 Hyundai Sonata Hybrid Sedan": [
        "A car with a large, hexagonal front grille.",
        "A car with Hyundai's signature logo at the center of the front grille.",
        "A car with sleek, wrap-around headlights.",
        "A car with a blue drive badge indicating it's a hybrid model.",
        "A car with a unique, aerodynamic shape to improve fuel efficiency.",
        "A car with 16-inch eco-spoke alloy wheels.",
        "A car with LED tail lights.",
        "A car with a high-mounted stop lamp.",
        "A car with chrome exterior door handles.",
        "A car with a chrome-tipped single exhaust.",
        "A car with a body-colored rear spoiler.",
        "A car with side mirror-mounted turn signal indicators.",
        "A car with solar control glass to reduce interior heat build-up.",
        "A car with projector headlights with LED accents.",
        "A car with a compact and sleek design.",
        "A car with a body-colored front and rear bumpers.",
        "A car with a rearview camera integrated into the rearview mirror.",
        "A car with a power tilt-and-slide sunroof.",
        "A car with a shark-fin style radio antenna.",
        "A car with a unique hybrid powertrain."
    ],
    "2012 Hyundai Sonata Sedan": [
        "A car with a large, trapezoidal front grille.",
        "A car with Hyundai's signature logo at the center of the front grille.",
        "A car with sleek, wrap-around headlights.",
        "A car with a long, sloping roofline that merges with the trunk.",
        "A car with a high beltline and narrow windows.",
        "A car with a chrome strip running along the bottom of the windows.",
        "A car with a sculpted hood and pronounced side creases.",
        "A car with dual exhaust outlets integrated into the rear bumper.",
        "A car with a compact, yet spacious interior.",
        "A car with a large, easy-to-read speedometer and tachometer.",
        "A car with a center console that is slightly angled towards the driver.",
        "A car with a touchscreen infotainment system in the center of the dashboard.",
        "A car with a push-button start located to the right of the steering wheel.",
        "A car with a rearview camera and parking sensors.",
        "A car with 16-inch alloy wheels.",
        "A car with a body-colored side mirrors and door handles.",
        "A car with a sunroof that extends over the front and rear seats.",
        "A car with LED taillights that wrap around the sides of the vehicle.",
        "A car with a body length of approximately 189.8 inches and a width of 72.2 inches.",
        "A car with a fuel economy of approximately 24 mpg in the city and 35 mpg on the highway."
    ],
    "2012 Hyundai Tucson SUV": [
        "A car with a hexagonal front grille featuring horizontal chrome bars.",
        "A car with swept-back headlights that extend towards the fenders.",
        "A car with a compact and sporty body design.",
        "A car with a high ground clearance and a robust stance.",
        "A car with a rear spoiler and a high-mounted brake light.",
        "A car with a roof rack for additional cargo.",
        "A car with a rear window wiper.",
        "A car with alloy wheels and a spare tire mounted under the cargo area.",
        "A car with body-colored door handles and side mirrors.",
        "A car with a dual exhaust system.",
        "A car with a Hyundai logo at the center of the front grille and on the rear.",
        "A car with a 'Tucson' badge on the lower right of the rear door.",
        "A car with a panoramic sunroof.",
        "A car with a rearview camera located above the license plate.",
        "A car with fog lights located on the lower front bumper.",
        "A car with a fuel filler door located on the passenger side.",
        "A car with a compact SUV body style.",
        "A car with a five-door body style.",
        "A car with a rear liftgate for access to the cargo area.",
        "A car with a side profile that features a rising window line towards the rear."
    ],
    "2012 Hyundai Veloster Hatchback": [
        "A car with a unique three-door design, with one large door on the driver's side and two smaller doors on the passenger side.",
        "A car with a distinctive, aggressive front grille design.",
        "A car with a rear hatchback design, featuring a split rear window and a centered exhaust.",
        "A car with a sloping roofline that gives it a coupe-like appearance.",
        "A car with a set of 17-inch alloy wheels as standard.",
        "A car with a rear spoiler and a blacked-out lower rear bumper.",
        "A car with a panoramic sunroof, which is a rare feature in its class.",
        "A car with LED headlight accents and LED taillights.",
        "A car with a body-colored rear diffuser.",
        "A car with a unique interior design, featuring a center console inspired by a sport bike.",
        "A car with a 7-inch touch screen display in the center console.",
        "A car with a digital speedometer and a tachometer.",
        "A car with a Blue Link telematics system.",
        "A car with a unique color palette, including colors like Vitamin C (orange), Century White, Ultra Black, and Marathon Blue."
    ],
    "2012 Hyundai Veracruz SUV": [
        "A car with a large, chrome grille that features the Hyundai logo in the center.",
        "A car with a sleek, rounded body design that is typical of mid-size SUVs.",
        "A car with a long, sloping hood and a short rear end.",
        "A car with a high ground clearance and large wheel arches.",
        "A car with a roof rack for additional storage.",
        "A car with a rear spoiler above the rear window.",
        "A car with dual exhaust pipes at the rear.",
        "A car with a large, rectangular rear window and a wiper attached to it.",
        "A car with projector beam headlights and fog lights located at the lower part of the front bumper.",
        "A car with side mirrors that are color-matched with the body.",
        "A car with a sunroof on the top.",
        "A car with five-spoke alloy wheels.",
        "A car with a third row of seating, visible through the rear window.",
        "A car with a rear liftgate that opens upwards.",
        "A car with a visible antenna on the roof towards the rear end.",
        "A car with a fuel filler door located on the rear quarter panel.",
        "A car with a visible Hyundai logo and 'Veracruz' nameplate on the rear."
    ],
    "2012 Infiniti G Coupe IPL": [
        "A car with a unique IPL (Infiniti Performance Line) badge on the rear.",
        "A car with a distinctive aggressive front bumper and larger air intakes.",
        "A car with a rear spoiler that is more pronounced than on other Infiniti models.",
        "A car with a dual exhaust system with chrome tips.",
        "A car with 19-inch IPL-specific graphite-finish wheels.",
        "A car with a unique red or black leather interior with red stitching.",
        "A car with aluminum trim on the center console, doors, and shifter area.",
        "A car with a sculpted, aerodynamic body shape.",
        "A car with a long, sloping roofline that ends in a short rear deck.",
        "A car with high-intensity discharge (HID) bi-functional xenon headlights.",
        "A car with LED rear brake lights and rear fog lights.",
        "A car with a distinctive Infiniti double-arch grille.",
        "A car with a \"wave-style\" hood.",
        "A car with a unique IPL-tuned high-flow exhaust.",
        "A car with a 3.7-liter V6 engine, which is unique to the IPL models.",
        "A car with a 7-speed automatic transmission with manual shift mode and Downshift Rev Matching.",
        "A car with a unique IPL-tuned suspension for improved handling and performance.",
        "A car with a distinctive Infiniti analog clock in the center of the dashboard.",
        "A car with a Bose premium audio system.",
        "A car with a unique IPL logo on the tachometer."
    ],
    "2012 Jaguar XK XKR": [
        "A car with a large chrome mesh grille at the front.",
        "A car with a leaping Jaguar emblem on the hood.",
        "A car with a sleek, aerodynamic profile.",
        "A car with a long hood and a short rear deck.",
        "A car with a distinctive side vent with 'XKR' badging.",
        "A car with a rear spoiler that automatically rises at high speeds.",
        "A car with a quad exhaust system.",
        "A car with 20-inch alloy wheels.",
        "A car with bi-xenon headlights with LED daytime running lights.",
        "A car with a luxurious interior featuring leather upholstery and wood trim.",
        "A car with a touch-screen navigation system in the center console.",
        "A car with a Bowers & Wilkins audio system.",
        "A car with a rearview camera and front and rear parking sensors.",
        "A car with a supercharged 5.0-liter V8 engine.",
        "A car with a six-speed automatic transmission.",
        "A car with a convertible or coupe body style.",
        "A car with a keyless entry and ignition system.",
        "A car with a power tilt-and-telescoping steering wheel.",
        "A car with heated and cooled front seats.",
        "A car with a distinctive 'R' logo on the rear."
    ],
    "2012 Jeep Compass SUV": [
        "A car with a seven-slot grille, a signature feature of Jeep vehicles.",
        "A car with round headlights on either side of the grille.",
        "A car with a boxy, rugged exterior design, typical of SUVs.",
        "A car with a compact size, smaller than traditional SUVs.",
        "A car with a roof rack for additional cargo.",
        "A car with a rear liftgate that opens upwards.",
        "A car with a spare tire mounted on the rear.",
        "A car with a high ground clearance, suitable for off-road driving.",
        "A car with five-spoke alloy wheels.",
        "A car with a Jeep logo on the front and rear.",
        "A car with a 'Compass' badge on the lower right side of the rear.",
        "A car with a dual-tone interior, typically black and beige.",
        "A car with a three-spoke steering wheel with control buttons.",
        "A car with a center console that includes a touchscreen display.",
        "A car with a manual or automatic transmission, indicated by the gear shift in the center console.",
        "A car with a rear window wiper.",
        "A car with a two-tone body color, with the lower part typically in black.",
        "A car with a sloping roofline towards the rear.",
        "A car with a trapezoidal wheel arch design.",
        "A car with a rear bumper that includes a step for easy access to the roof."
    ],
    "2012 Jeep Grand Cherokee SUV": [
        "A car with a seven-slot grille, a signature feature of Jeep vehicles.",
        "A car with a boxy, rugged exterior design.",
        "A car with large, round headlights flanking the grille.",
        "A car with a high ground clearance, typical of SUVs.",
        "A car with a large, prominent Jeep logo on the front.",
        "A car with a squared-off rear end and large, rectangular taillights.",
        "A car with a roof rack for additional storage.",
        "A car with five-spoke alloy wheels.",
        "A car with a rear window wiper.",
        "A car with a dual exhaust system.",
        "A car with a large, spacious interior, typical of SUVs.",
        "A car with a rear liftgate for access to the cargo area.",
        "A car with a '4x4' badge, indicating four-wheel drive.",
        "A car with a 'Grand Cherokee' badge on the sides or rear.",
        "A car with a muscular, wide stance.",
        "A car with a long, flat hood.",
        "A car with a large, prominent bumper.",
        "A car with a side step for easier access.",
        "A car with a large, rectangular side mirrors.",
        "A car with a 'Limited' or 'Overland' badge, indicating the specific trim level of the 2012 Jeep Grand Cherokee."
    ],
    "2012 Jeep Liberty SUV": [
        "A car with a seven-slot grille, a signature feature of Jeep vehicles.",
        "A car with round headlights on either side of the grille.",
        "A car with a boxy, rugged exterior design.",
        "A car with a spare tire mounted on the rear.",
        "A car with a high ground clearance, typical of SUVs.",
        "A car with a flat, vertical rear end and large, square-shaped rear windows.",
        "A car with roof rails for additional cargo capacity.",
        "A car with five-spoke alloy wheels.",
        "A car with a prominent Jeep logo on the front and back.",
        "A car with a side-hinged rear door instead of a liftgate.",
        "A car with a relatively compact size compared to other SUVs.",
        "A car with a squared-off wheel arch design.",
        "A car with a short front overhang and a long rear overhang.",
        "A car with a large, broad hood and a steeply raked windshield.",
        "A car with a two-tone interior, typically black and grey.",
        "A car with a Uconnect infotainment system on the dashboard.",
        "A car with a four-wheel drive system, a common feature in Jeep vehicles.",
        "A car with a V6 engine, as the 2012 Jeep Liberty SUV does not offer a four-cylinder engine.",
        "A car with a towing capacity of up to 5000 pounds, which is a unique feature of the 2012 Jeep Liberty SUV."
    ],
    "2012 Jeep Patriot SUV": [
        "A car with a seven-slot grille, a signature feature of Jeep vehicles.",
        "A car with round headlights on either side of the grille.",
        "A car with a boxy, rugged exterior design, typical of traditional SUVs.",
        "A car with a high ground clearance, suitable for off-road driving.",
        "A car with a compact size, smaller than most mid-size SUVs.",
        "A car with a roof rack for additional cargo storage.",
        "A car with a rear liftgate that opens upwards.",
        "A car with five-spoke alloy wheels.",
        "A car with a spare tire mounted on the rear.",
        "A car with a two-tone interior, typically black and beige.",
        "A car with a simple, straightforward dashboard design.",
        "A car with a Uconnect® infotainment system.",
        "A car with a manual transmission, although automatic is also available.",
        "A car with a four-cylinder engine.",
        "A car with a four-wheel drive system, although front-wheel drive is also available.",
        "A car with a seating capacity for five passengers.",
        "A car with a split-folding rear seat for additional cargo space.",
        "A car with fog lights located on the lower part of the front bumper.",
        "A car with a rear window wiper.",
        "A car with a fuel economy of around 23 city / 29 highway mpg."
    ],
    "2012 Jeep Wrangler SUV": [
        "A car with a seven-slot grille.",
        "A car with round headlights embedded into the grille.",
        "A car with a boxy, rugged exterior design.",
        "A car with a removable top and doors.",
        "A car with exposed door hinges.",
        "A car with a spare tire mounted on the rear.",
        "A car with a fold-down windshield.",
        "A car with trapezoidal wheel flares.",
        "A car with a high ground clearance.",
        "A car with a short wheelbase.",
        "A car with a tow hook at the back.",
        "A car with a two-door or four-door option.",
        "A car with a side-hinged tailgate.",
        "A car with a flat, vertical windshield.",
        "A car with a prominent Jeep logo on the front grille.",
        "A car with a body-on-frame construction.",
        "A car with a front and rear live axle suspension.",
        "A car with a skid plate under the fuel tank.",
        "A car with a manual transmission option.",
        "A car with a 4-wheel drive system."
    ],
    "2012 Lamborghini Aventador Coupe": [
        "A car with a low, wide stance and a distinctive wedge-shaped profile.",
        "A car with scissor doors that open upwards and outwards.",
        "A car with a large, centrally located exhaust outlet at the rear.",
        "A car with a transparent engine cover showcasing a V12 engine.",
        "A car with a front end that features large air intakes and Y-shaped headlights.",
        "A car with a rear end that includes a deployable spoiler and Y-shaped tail lights.",
        "A car with a distinctive set of 19-inch front and 20-inch rear alloy wheels.",
        "A car with a two-seater cabin layout.",
        "A car with a digital instrument cluster and a central console angled towards the driver.",
        "A car with a body made primarily of carbon fiber.",
        "A car with a seven-speed automatic transmission.",
        "A car with a pushrod suspension system.",
        "A car with a distinctive Lamborghini badge at the front and rear.",
        "A car with a rear diffuser and side air intakes that are electronically controlled.",
        "A car with a flat underbody to aid in aerodynamics."
    ],
    "2012 Lamborghini Gallardo LP 570-4 Superleggera": [
        "A car with a distinctive wedge-shaped profile.",
        "A car with a low, wide stance.",
        "A car with large air intakes in the front bumper.",
        "A car with a transparent engine cover showcasing the V10 engine.",
        "A car with a rear diffuser and a large, fixed rear wing.",
        "A car with quad exhaust tips positioned in the center of the rear bumper.",
        "A car with Y-shaped alloy wheels.",
        "A car with large, carbon-ceramic brake discs visible behind the wheels.",
        "A car with a 'Superleggera' badge on the side skirts.",
        "A car with a two-door, two-seater configuration.",
        "A car with a flat, angular rear end with distinctive taillights.",
        "A car with a small, sloping windshield.",
        "A car with scissor doors that open upwards.",
        "A car with a minimalist, driver-focused interior with carbon fiber and Alcantara trim.",
        "A car with a digital instrument cluster behind the steering wheel.",
        "A car with a small, hexagonal rear window.",
        "A car with a Lamborghini emblem on the front and rear.",
        "A car with a distinctive 'LP 570-4' badge on the rear."
    ],
    "2012 Land Rover LR2 SUV": [
        "A car with a compact, boxy shape.",
        "A car with a prominent front grille featuring two horizontal bars.",
        "A car with the Land Rover logo prominently displayed on the front grille.",
        "A car with large, rounded headlights on either side of the grille.",
        "A car with a high ground clearance.",
        "A car with a flat roofline and a rear spoiler.",
        "A car with a dual-panel sunroof.",
        "A car with a rear window that is sharply raked.",
        "A car with a split tailgate design.",
        "A car with 18-inch alloy wheels.",
        "A car with body-colored side mirrors and door handles.",
        "A car with a side vent just behind the front wheel arches.",
        "A car with a rear bumper that has integrated exhaust outlets.",
        "A car with a rear wiper on the back window.",
        "A car with a spare tire mounted under the rear of the vehicle.",
        "A car with a short front overhang and a long rear overhang.",
        "A car with a distinctive side profile with a rising beltline.",
        "A car with a robust and rugged appearance.",
        "A car with a compact SUV body style.",
        "A car with a Land Rover badge on the hood and the rear."
    ],
    "2012 Land Rover Range Rover SUV": [
        "A car with a boxy, upright design.",
        "A car with a split tailgate design.",
        "A car with a prominent grille featuring horizontal bars.",
        "A car with a 'floating' roof design, where the roof appears to be separate from the rest of the body.",
        "A car with large, rectangular headlights that are slightly rounded at the corners.",
        "A car with a high ground clearance.",
        "A car with a side vent on the front fenders.",
        "A car with a large, prominent Land Rover badge on the front and back.",
        "A car with a long, flat hood.",
        "A car with a rear window that is more vertical than slanted.",
        "A car with a large, luxurious interior visible through the windows.",
        "A car with a distinctive, rectangular rear light cluster.",
        "A car with a large, broad windshield.",
        "A car with a side profile that is almost completely straight from front to back.",
        "A car with a large, prominent 'RANGE ROVER' lettering on the hood and the tailgate.",
        "A car with a dual exhaust system.",
        "A car with a large wheelbase and alloy wheels.",
        "A car with a rear spoiler above the back window.",
        "A car with a panoramic sunroof.",
        "A car with a body-colored bumper with integrated fog lights."
    ],
    "2012 MINI Cooper Roadster Convertible": [
        "A car with a distinctive two-seat layout.",
        "A car with a manually folding soft-top roof.",
        "A car with a compact and sporty design.",
        "A car with a large central speedometer on the dashboard.",
        "A car with a short, stubby antenna on the rear.",
        "A car with a rear spoiler that is integrated into the trunk lid.",
        "A car with a front grille that is split into two sections by a body-colored bumper.",
        "A car with round headlights that are slightly recessed into the bodywork.",
        "A car with a small, round fog lights positioned on the lower part of the front bumper.",
        "A car with a dual exhaust system located in the center of the rear bumper.",
        "A car with a distinctive side profile featuring a rising beltline and a sloping rear end.",
        "A car with 15-inch alloy wheels as standard.",
        "A car with a fuel filler cap located on the right rear quarter panel.",
        "A car with a small, rectangular rear window.",
        "A car with a body-colored mirror caps.",
        "A car with a high-mounted third brake light.",
        "A car with a rear diffuser integrated into the bumper.",
        "A car with a small, round side indicators integrated into the side fenders.",
        "A car with a distinctive MINI logo on the hood and the trunk lid.",
        "A car with a unique interior design featuring toggle switches for controls."
    ],
    "2012 Maybach Landaulet Convertible": [
        "A car with a large, chrome grille that prominently features the Maybach emblem.",
        "A car with a soft-top convertible roof that only covers the rear half of the vehicle.",
        "A car with a long, luxurious body, often in a two-tone paint scheme.",
        "A car with large, multi-spoke alloy wheels.",
        "A car with a distinctive side profile, featuring a long wheelbase and a high beltline.",
        "A car with a split rear window, with the lower portion being smaller and more rectangular.",
        "A car with a high-end, luxurious interior, often featuring leather and wood trim.",
        "A car with a unique rear seating arrangement, often featuring reclining seats and a center console.",
        "A car with a distinctive rear end, featuring large, vertical taillights and a chrome strip across the trunk.",
        "A car with a V12 engine badge on the side.",
        "A car with a distinctive front end, featuring large, round headlights and a prominent hood ornament.",
        "A car with a high level of detail in the interior, including a rear-seat entertainment system and a refrigerator.",
        "A car with a unique, high-end badge on the rear, reading \"Maybach Landaulet\".",
        "A car with a distinctive silhouette, featuring a high roofline and a long, sloping rear end.",
        "A car with a unique, high-end badge on the front, reading \"Maybach\".",
        "A car with a distinctive, high-end badge on the side, reading \"Landaulet\"."
    ],
    "2012 McLaren MP4-12C Coupe": [
        "A car with a low, wide stance and aerodynamic design.",
        "A car with a distinctive front end featuring large air intakes and LED headlights.",
        "A car with a rear end that includes a diffuser and twin exhaust pipes centrally mounted.",
        "A car with a pair of dihedral doors that swing up and forward when opened.",
        "A car with a carbon fiber composite chassis.",
        "A car with a 3.8-liter twin-turbocharged V8 engine visible through a glass panel.",
        "A car with a seven-speed dual-clutch transmission.",
        "A car with a two-seat interior layout.",
        "A car with a digital instrument cluster and a central touchscreen for infotainment.",
        "A car with a 'brake steer' system, which applies braking to the inside rear wheel when the car is entering a corner too quickly.",
        "A car with a Proactive Chassis Control suspension system.",
        "A car with 19-inch front and 20-inch rear alloy wheels.",
        "A car with a distinctive 'swoosh' styling line that starts from the front wheel arch and extends to the rear.",
        "A car with a small rear spoiler that automatically adjusts for optimal aerodynamics.",
        "A car with a McLaren logo on the front hood and rear.",
        "A car with a flat underbody to improve aerodynamics.",
        "A car with a high-performance braking system featuring carbon ceramic discs.",
        "A car with a color scheme that is typically bright, such as McLaren Orange or Volcano Red."
    ],
    "2012 Mercedes-Benz C-Class Sedan": [
        "A car with a three-pointed star emblem in the center of a two-bar grille.",
        "A car with a long hood and short rear deck design.",
        "A car with a prominent crease running along the side, from the front wheel arch to the tail light.",
        "A car with dual exhaust outlets integrated into the rear bumper.",
        "A car with LED daytime running lights integrated into the headlight assembly.",
        "A car with a sunroof that extends over the rear seats.",
        "A car with a cabin that features a three-spoke steering wheel and a center console with a prominent display screen.",
        "A car with a rear design that includes wrap-around tail lights.",
        "A car with 17-inch alloy wheels.",
        "A car with side mirrors that have integrated turn signal indicators.",
        "A car with a body style that is distinctly a four-door sedan.",
        "A car with a roofline that slopes gently towards the rear, giving it a coupe-like appearance.",
        "A car with a front design that includes large air intakes in the lower bumper.",
        "A car with a rear design that includes a subtle lip spoiler on the trunk lid.",
        "A car with a cabin that features a mix of wood and metal trims.",
        "A car with a front design that includes projector-beam headlights.",
        "A car with a cabin that features a prominent center console with a rotary dial and buttons for controlling the infotainment system.",
        "A car with a cabin that features a speedometer and tachometer separated by a small digital display in the instrument cluster.",
        "A car with a cabin that features a three-spoke steering wheel with control buttons for the infotainment system and cruise control.",
        "A car with a cabin that features a dual-zone automatic climate control system."
    ],
    "2012 Mercedes-Benz E-Class Sedan": [
        "A car with a three-pointed star emblem in the center of a two-bar grille.",
        "A car with a long hood and short rear deck design.",
        "A car with a prominent crease running along the side, from the front fender to the tail light.",
        "A car with dual exhaust outlets integrated into the rear bumper.",
        "A car with LED daytime running lights positioned below the headlamps.",
        "A car with a large, wide front air intake.",
        "A car with a sunroof that extends over the rear seats.",
        "A car with a trapezoidal rear window.",
        "A car with a body-colored side mirror housing.",
        "A car with a four-door design.",
        "A car with a sloping roofline that gives it a coupe-like appearance.",
        "A car with a rear-wheel-drive layout.",
        "A car with 17-inch alloy wheels.",
        "A car with a chrome strip running along the bottom of the side windows.",
        "A car with a high-mounted third brake light.",
        "A car with a rear diffuser.",
        "A car with a chrome strip on the trunk lid.",
        "A car with a body-colored door handle with chrome accents.",
        "A car with a large, wide rear windshield.",
        "A car with a power tilt/telescoping steering column.",
        "A car with a cabin featuring a dual-zone automatic climate control system.",
        "A car with a COMAND electronics interface.",
        "A car with a 14-way power driver seat with memory functions.",
        "A car with a 7-inch display screen in the center of the dashboard.",
        "A car with a Harman Kardon sound system."
    ],
    "2012 Mercedes-Benz S-Class Sedan": [
        "A car with a large, prominent grille featuring the Mercedes-Benz emblem.",
        "A car with a long, sleek body design.",
        "A car with a distinctive, elongated hood.",
        "A car with a dual-bulb headlight design.",
        "A car with LED daytime running lights.",
        "A car with a sunroof.",
        "A car with a high beltline and a low roofline, giving it a coupe-like profile.",
        "A car with a short rear deck.",
        "A car with a dual exhaust system.",
        "A car with a large, luxurious interior.",
        "A car with a digital instrument cluster behind the steering wheel.",
        "A car with a large central display on the dashboard.",
        "A car with a three-spoke steering wheel featuring control buttons.",
        "A car with a gear selector on the steering column.",
        "A car with a large, comfortable rear seat with ample legroom.",
        "A car with a large trunk.",
        "A car with alloy wheels, often 18-inch or larger.",
        "A car with a distinctive, three-pointed star hood ornament.",
        "A car with a rear-wheel drive or 4MATIC all-wheel drive.",
        "A car with a variety of engine options, including V6, V8, and V12."
    ],
    "2012 Mercedes-Benz Sprinter Van": [
        "A car with a large, boxy shape, indicative of a cargo or passenger van.",
        "A car with a prominent three-pointed star logo on the front grille.",
        "A car with a relatively high ground clearance compared to other vans.",
        "A car with a long wheelbase and a tall roof, providing ample interior space.",
        "A car with sliding doors on the side and double doors at the rear.",
        "A car with large, rectangular headlights on either side of the grille.",
        "A car with a short hood, indicating a front-engine, rear-wheel-drive layout.",
        "A car with a wide windshield and large side windows for improved visibility.",
        "A car with a single rear wheel on each side, unlike some larger vans which have dual rear wheels.",
        "A car with a relatively plain, utilitarian design, with few decorative elements.",
        "A car with a large side mirror for better visibility.",
        "A car with a step bumper at the rear for easy access to the cargo area.",
        "A car with a visible exhaust pipe on the right side.",
        "A car with a fuel filler cap located on the right side, towards the rear.",
        "A car with a spare tire mounted under the rear of the vehicle.",
        "A car with a high-mounted brake light at the rear.",
        "A car with a visible antenna on the roof towards the front.",
        "A car with a visible VIN number located at the lower left corner of the dashboard, visible through the windshield."
    ],
    "2012 Mitsubishi Lancer Sedan": [
        "A car with a distinctive front grille featuring a split design with a large center section and two smaller sections on either side.",
        "A car with a pair of sharp, angular headlights that flank the grille.",
        "A car with a hood that features a slight bulge in the center, giving it a muscular appearance.",
        "A car with a compact, boxy shape, typical of a sedan.",
        "A car with a rear end that features a short trunk lid and large, wraparound taillights.",
        "A car with a roofline that slopes gently towards the rear, giving it a slightly sporty look.",
        "A car with a pair of fog lights located at the lower corners of the front bumper.",
        "A car with a set of five-spoke alloy wheels.",
        "A car with a small rear spoiler mounted on the trunk lid.",
        "A car with a dual exhaust system, visible at the rear.",
        "A car with side mirrors that are color-matched with the body.",
        "A car with door handles that are also color-matched with the body.",
        "A car with a fuel filler cap located on the rear right side.",
        "A car with a Mitsubishi logo prominently displayed in the center of the front grille.",
        "A car with a rear window that features a defogger and a third brake light.",
        "A car with a small antenna mounted on the rear part of the roof.",
        "A car with a Lancer badge located on the left side of the trunk lid.",
        "A car with a 2012 model year registration sticker on the windshield."
    ],
    "2012 Nissan Juke Hatchback": [
        "A car with a high-mounted front end, featuring high-intensity discharge (HID) headlights.",
        "A car with unique \"boomerang\" shaped taillights.",
        "A car with a compact, hatchback body style.",
        "A car with a distinctive, aggressive grille design.",
        "A car with a sloping roofline that gives it a coupe-like appearance.",
        "A car with a rear door handle that is integrated into the window frame, giving it a two-door appearance.",
        "A car with 17-inch alloy wheels.",
        "A car with a rear spoiler that is integrated into the roofline.",
        "A car with a distinctive center console design inspired by a motorcycle fuel tank.",
        "A car with a compact, yet spacious interior, featuring a rear seat that can fold down for additional cargo space.",
        "A car with a unique \"I-CON\" system, which provides driver information and HVAC controls.",
        "A car with a distinctive body design that features bold, muscular lines and curves.",
        "A car with a compact size, measuring less than 162 inches in length.",
        "A car with a ground clearance of approximately 7 inches.",
        "A car with a distinctive color scheme, often featuring contrasting colors on the body and the mirrors/door handles."
    ],
    "2012 Nissan Leaf Hatchback": [
        "A car with a compact, hatchback design.",
        "A car with a Nissan emblem on the front and back.",
        "A car with a unique, bulbous shape, especially noticeable in the front.",
        "A car with a charging port located in the front, center of the vehicle.",
        "A car with a blue-tinted Nissan emblem, indicating its electric nature.",
        "A car with a rear spoiler that extends over the rear window.",
        "A car with vertical, thin, and sleek LED headlights.",
        "A car with a small, rounded front grille.",
        "A car with a rear window that slopes down towards the trunk, rather than being flat.",
        "A car with a \"Zero Emission\" badge on the back and sides.",
        "A car with five-spoke alloy wheels.",
        "A car with a small, high-mounted brake light on the rear spoiler.",
        "A car with a two-tone body color, often with a lighter top and darker bottom.",
        "A car with a digital display behind the steering wheel instead of traditional analog gauges.",
        "A car with a push-button start, typical of electric vehicles.",
        "A car with a gear shift knob that is a round, palm-sized disc.",
        "A car with a flat floor, due to the lack of a traditional exhaust system."
    ],
    "2012 Nissan NV Passenger Van": [
        "A car with a boxy, upright shape, typical of a full-size van.",
        "A car with a large, chrome grille at the front.",
        "A car with high roofline, providing ample headroom inside.",
        "A car with sliding doors on the side for rear passenger entry.",
        "A car with large, rectangular-shaped headlights.",
        "A car with a long wheelbase, providing ample interior space.",
        "A car with a rear door that splits 50/50 and opens outwards.",
        "A car with a robust bumper, both at the front and rear.",
        "A car with a relatively flat hood, typical of commercial vans.",
        "A car with a Nissan emblem at the center of the front grille.",
        "A car with large, manually adjustable side mirrors.",
        "A car with a high ground clearance, typical of utility vehicles.",
        "A car with a large windshield, providing a wide field of view.",
        "A car with a rear window defroster.",
        "A car with a spare tire mounted under the body at the rear.",
        "A car with a seating capacity for up to 12 passengers.",
        "A car with a step bumper at the rear for easy access to the cargo area.",
        "A car with a tow hitch receiver at the rear.",
        "A car with steel wheels and all-season tires.",
        "A car with a side step for easy entry and exit."
    ],
    "2012 Porsche Panamera Sedan": [
        "A car with a long, sloping roofline that ends in a fastback-style tail.",
        "A car with a large, trapezoidal grille flanked by large air intakes.",
        "A car with a wide, low stance.",
        "A car with four doors, unlike many other Porsche models.",
        "A car with a rear hatch for access to the cargo area.",
        "A car with a distinctive, rounded hood and front fenders.",
        "A car with quad-LED daytime running lights.",
        "A car with a large, prominent Porsche crest on the front hood.",
        "A car with a dual twin-tube exhaust outlets.",
        "A car with a rear spoiler that extends at high speeds.",
        "A car with a full-length center console that divides the interior into four individual spaces.",
        "A car with a high beltline and a low roof, giving it a coupe-like appearance.",
        "A car with 18-inch Panamera wheels.",
        "A car with Bi-Xenon headlights.",
        "A car with a Porsche Communication Management system for navigation, audio, and communication.",
        "A car with a rear-wheel drive layout.",
        "A car with a 3.6-liter V6 engine as standard.",
        "A car with a seven-speed dual-clutch automatic transmission.",
        "A car with a top track speed of 160 mph.",
        "A car with a 0-60 mph acceleration in 6.0 seconds."
    ],
    "2012 Rolls-Royce Ghost Sedan": [
        "A car with a large, rectangular front grille with vertical slats.",
        "A car with a Spirit of Ecstasy hood ornament.",
        "A car with a long, sleek, and luxurious body design.",
        "A car with a high beltline and a low roofline.",
        "A car with a pair of round LED headlights on each side of the grille.",
        "A car with a three-box design, meaning separate compartments for the engine, passenger, and cargo.",
        "A car with a large, prominent Rolls-Royce logo on the center of the wheel hubs.",
        "A car with a pair of exhaust pipes located at the corners of the rear bumper.",
        "A car with a rear-hinged back door, also known as 'suicide doors'.",
        "A car with a large, flat hood and a short front overhang.",
        "A car with a long rear overhang, giving it a classic limousine look.",
        "A car with a two-tone paint job, often with the hood, roof, and trunk in a different color than the rest of the body.",
        "A car with a large, luxurious, and spacious interior visible through the windows.",
        "A car with a large, flat trunk lid.",
        "A car with a distinctive Rolls-Royce clock on the dashboard visible through the windshield.",
        "A car with a large, round fuel cap on the right rear side.",
        "A car with a distinctive Rolls-Royce treadplate on the door sill.",
        "A car with a large, rectangular rear window.",
        "A car with a small, triangular window at the rear of the side windows.",
        "A car with a distinctive Rolls-Royce umbrella stored in the rear door."
    ],
    "2012 Rolls-Royce Phantom Drophead Coupe Convertible": [
        "A car with a large, rectangular front grille made of hand-polished stainless steel.",
        "A car with a Spirit of Ecstasy hood ornament.",
        "A car with a long, sleek hood and a short rear deck.",
        "A car with a convertible soft top.",
        "A car with suicide doors, which are hinged at the rear rather than the front.",
        "A car with 21-inch alloy wheels.",
        "A car with rectangular LED headlights.",
        "A car with a large, round Rolls-Royce logo on the wheel hubs.",
        "A car with a high beltline that gives it a substantial, imposing look.",
        "A car with a two-tone color scheme, often with the hood and windshield surround in a different color than the rest of the body.",
        "A car with a large, flat rear end with vertical taillights.",
        "A car with a luxurious, handcrafted interior featuring high-quality leather and wood.",
        "A car with a large, round analog clock in the center of the dashboard.",
        "A car with a thin, elegant steering wheel.",
        "A car with a large, round fuel cap on the right rear side.",
        "A car with a large, round exhaust pipe on each side at the rear.",
        "A car with a high ground clearance compared to other luxury cars.",
        "A car with a large, round side mirrors.",
        "A car with a small, round rear window when the top is up.",
        "A car with a large, flat trunk lid."
    ],
    "2012 Rolls-Royce Phantom Sedan": [
        "A car with a large, rectangular, chrome grille that is slightly inclined towards the rear.",
        "A car with a Spirit of Ecstasy hood ornament.",
        "A car with rectangular LED headlights.",
        "A car with a long, flat hood and a high beltline.",
        "A car with a rear-hinged back door, also known as 'suicide doors'.",
        "A car with a large, boxy, and imposing body style.",
        "A car with a two-tone paint option, often with the hood and the upper part of the car in a different color than the lower part.",
        "A car with 21-inch alloy wheels.",
        "A car with a large, round dual exhaust tips integrated into the rear bumper.",
        "A car with a flat, upright windshield and equally flat rear glass.",
        "A car with a high ground clearance compared to other luxury sedans.",
        "A car with a long wheelbase and overall length.",
        "A car with a Rolls-Royce logo on the center of the wheel hub that remains upright even when the car is moving.",
        "A car with a large, luxurious, and spacious interior visible through the windows.",
        "A car with a visible 'RR' logo on the front, rear, and inside the car.",
        "A car with a visible chrome strip running along the lower side of the body.",
        "A car with a visible panoramic sunroof.",
        "A car with a visible analog clock on the dashboard."
    ],
    "2012 Scion xD Hatchback": [
        "A car with a compact, boxy shape.",
        "A car with a five-door hatchback design.",
        "A car with a short, stubby nose.",
        "A car with a high, flat roofline.",
        "A car with a rear window that slopes down towards the back.",
        "A car with a small, mesh grille located at the lower part of the front bumper.",
        "A car with large, multi-reflector halogen headlamps.",
        "A car with a rear bumper that integrates a black diffuser.",
        "A car with 16-inch steel wheels with full wheel covers.",
        "A car with turn signal indicators integrated into the side mirrors.",
        "A car with a rear windshield wiper.",
        "A car with a chrome exhaust tip.",
        "A car with a small rear spoiler.",
        "A car with a relatively high ground clearance for a hatchback.",
        "A car with a simple, uncluttered interior design.",
        "A car with a centrally located instrument panel.",
        "A car with a Pioneer audio system.",
        "A car with a flat-bottomed steering wheel.",
        "A car with a rear seat that can be folded flat for increased cargo space.",
        "A car with a unique, circular air vent design."
    ],
    "2012 Suzuki Kizashi Sedan": [
        "A car with a distinctive chrome grille with horizontal slats.",
        "A car with a Suzuki emblem in the center of the front grille.",
        "A car with a sleek, aerodynamic profile.",
        "A car with dual exhaust outlets integrated into the rear bumper.",
        "A car with a set of 18-inch alloy wheels.",
        "A car with projector beam headlamps.",
        "A car with a body-colored rear spoiler.",
        "A car with a sunroof.",
        "A car with a compact yet spacious interior.",
        "A car with a leather-wrapped steering wheel and shift knob.",
        "A car with a touchscreen infotainment system in the center of the dashboard.",
        "A car with a dual-zone automatic climate control system.",
        "A car with a keyless start system.",
        "A car with a rearview camera.",
        "A car with a sporty yet elegant exterior design.",
        "A car with a body-colored side mirrors with integrated turn signals.",
        "A car with a unique combination of a compact sedan size and sporty design elements.",
        "A car with a distinctive rear design featuring LED taillights.",
        "A car with a spacious trunk with a wide opening for easy loading and unloading.",
        "A car with a high-quality interior featuring soft-touch materials and metallic accents."
    ],
    "2012 Suzuki SX4 Hatchback": [
        "A car with a compact, five-door hatchback design.",
        "A car with a distinctive, high roofline.",
        "A car with a front grille that features a prominent Suzuki logo in the center.",
        "A car with a pair of large, wraparound headlights on either side of the grille.",
        "A car with a black plastic bumper that includes round fog lights.",
        "A car with a rear end that features a high-mounted, spoiler-like third brake light.",
        "A car with a rear window wiper.",
        "A car with a pair of vertical taillights on the rear end.",
        "A car with a roof rack for additional storage.",
        "A car with 16-inch alloy wheels.",
        "A car with a small, yet spacious interior due to its high roofline.",
        "A car with a dashboard that features a simple, straightforward design.",
        "A car with a center console that includes a CD player and climate controls.",
        "A car with a rear seat that can be folded down to increase cargo space.",
        "A car with a distinctive, boxy shape that sets it apart from other compact cars."
    ],
    "2012 Suzuki SX4 Sedan": [
        "A car with a compact, four-door sedan body style.",
        "A car with a distinctive, high roofline.",
        "A car with a front grille that features a horizontal bar with the manufacturer's emblem in the center.",
        "A car with large, wrap-around headlights that extend into the front fenders.",
        "A car with a short rear deck and high-mounted taillights.",
        "A car with a small rear spoiler integrated into the trunk lid.",
        "A car with 15-inch steel wheels with full covers as standard.",
        "A car with body-colored door handles and side mirrors.",
        "A car with a relatively high ground clearance for a sedan.",
        "A car with a simple, uncluttered dashboard design.",
        "A car with a three-spoke steering wheel with audio controls.",
        "A car with a center console that houses the gear shift, cup holders, and storage compartment.",
        "A car with a split-folding rear seat for increased cargo space.",
        "A car with a tachometer and speedometer housed in two large, round gauges.",
        "A car with a small, digital display between the gauges for trip information.",
        "A car with manual air conditioning controls located in the center stack.",
        "A car with a CD player and AM/FM radio as standard audio features.",
        "A car with power windows and door locks.",
        "A car with a keyless entry system.",
        "A car with a 2.0-liter, four-cylinder engine under the hood.",
        "A car with a six-speed manual transmission as standard, with an optional continuously variable transmission (CVT).",
        "A car with front-wheel drive as standard, with an optional all-wheel drive."
    ],
    "2012 Tesla Model S Sedan": [
        "A car with a sleek, aerodynamic design and a low, wide stance.",
        "A car with a large, distinctive 17-inch touchscreen display in the center of the dashboard.",
        "A car with a panoramic glass roof.",
        "A car with door handles that are flush with the body of the car.",
        "A car with a front trunk, also known as a 'frunk', in addition to a rear trunk.",
        "A car with a lack of a front grille, which is common in most internal combustion engine cars.",
        "A car with a distinctive T logo on the front and rear.",
        "A car with a long, sloping rear roofline, similar to a fastback design.",
        "A car with LED daytime running lights.",
        "A car with a large, horizontal, tablet-like display in the center of the dashboard.",
        "A car with a minimalist, uncluttered interior design.",
        "A car with a charging port located behind a panel in the car's left rear taillight.",
        "A car with a five-door liftback design.",
        "A car with a rear underbody diffuser for improved aerodynamics.",
        "A car with a lack of exhaust pipes, indicating it's an electric vehicle.",
        "A car with a high-performance variant that features red brake calipers.",
        "A car with optional 21-inch wheels.",
        "A car with a dual motor badge on the back if it's an all-wheel-drive version.",
        "A car with a small rear-facing jump seat in the back, making it a seven-seater.",
        "A car with a distinctive, futuristic design that stands out from traditional sedans."
    ],
    "2012 Toyota 4Runner SUV": [
        "A car with a rugged, boxy shape that is characteristic of traditional SUVs.",
        "A car with a large, prominent front grille with horizontal slats.",
        "A car with a Toyota emblem in the center of the front grille.",
        "A car with a high ground clearance and large wheel arches.",
        "A car with a rear liftgate that includes a power window, which is a unique feature among SUVs.",
        "A car with a roof rack for additional cargo storage.",
        "A car with a spare tire mounted underneath the cargo area at the rear.",
        "A car with a pair of fog lights located on the lower part of the front bumper.",
        "A car with a side-hinged rear door instead of a liftgate.",
        "A car with a set of 17-inch, 6-spoke alloy wheels.",
        "A car with a pair of roof rails for additional cargo.",
        "A car with a muscular and aggressive stance, indicative of its off-road capabilities.",
        "A car with a pair of large, wrap-around taillights.",
        "A car with a pair of power-adjustable, heated outside mirrors.",
        "A car with a pair of integrated front and rear mudguards.",
        "A car with a color-keyed rear spoiler with LED center high-mount stop light.",
        "A car with a pair of projector-beam headlights with smoked trim.",
        "A car with a pair of color-keyed front and rear bumpers with silver accents.",
        "A car with a pair of chrome door handles.",
        "A car with a pair of privacy glass on the rear side, quarter, and liftgate windows.",
        "A car with a pair of aerodynamic variable intermittent windshield wipers.",
        "A car with a pair of color-keyed fender flares and rocker panels with silver accents.",
        "A car with a pair of unique 4Runner badging on the C-pillar."
    ],
    "2012 Toyota Camry Sedan": [
        "A car with a sleek, aerodynamic design.",
        "A car with a large, prominent grille at the front.",
        "A car with a Toyota emblem in the center of the grille.",
        "A car with angular, wrap-around headlights.",
        "A car with a long, horizontal tail light design.",
        "A car with a body that measures around 189.2 inches in length.",
        "A car with a wheelbase of approximately 109.3 inches.",
        "A car with 16-inch steel wheels as standard.",
        "A car with a slightly curved roofline.",
        "A car with a high rear deck.",
        "A car with a dual exhaust system.",
        "A car with body-colored door handles and side mirrors.",
        "A car with a small antenna on the rear part of the roof.",
        "A car with a spacious, five-seater interior.",
        "A car with a large, centrally located infotainment screen on the dashboard.",
        "A car with a three-spoke steering wheel with control buttons.",
        "A car with a gear shift located in the center console.",
        "A car with a digital speedometer located in the instrument cluster.",
        "A car with a push-button start feature.",
        "A car with a sunroof, depending on the trim level."
    ],
    "2012 Toyota Corolla Sedan": [
        "A car with a compact, four-door sedan body style.",
        "A car with a front-engine, front-wheel-drive layout.",
        "A car with a chrome-accented grille.",
        "A car with a pair of halogen headlamps.",
        "A car with a body-colored front and rear bumper.",
        "A car with 15-inch steel wheels with full wheel covers.",
        "A car with body-colored power side mirrors.",
        "A car with a high-mounted stop lamp.",
        "A car with a chrome-tipped exhaust.",
        "A car with a rear defogger.",
        "A car with a black interior and fabric-trimmed seats.",
        "A car with a tilt-and-telescopic steering wheel.",
        "A car with a 60/40 split fold-down rear seat.",
        "A car with a 1.8-liter, 4-cylinder engine.",
        "A car with a 4-speed automatic or a 5-speed manual transmission.",
        "A car with power windows and door locks.",
        "A car with an AM/FM CD player with MP3/WMA playback capability.",
        "A car with six speakers.",
        "A car with a remote keyless entry system.",
        "A car with a multi-information display.",
        "A car with a cruise control.",
        "A car with a center console with storage compartment.",
        "A car with dual front airbags, front seat-mounted side airbags, and front and rear side curtain airbags.",
        "A car with an anti-lock brake system.",
        "A car with electronic brake-force distribution and brake assist.",
        "A car with a vehicle stability control and traction control.",
        "A car with a tire pressure monitor system."
    ],
    "2012 Toyota Sequoia SUV": [
        "A car with a large, boxy shape, typical of full-size SUVs.",
        "A car with a prominent front grille featuring two horizontal chrome bars.",
        "A car with a Toyota emblem in the center of the front grille.",
        "A car with large, rectangular headlights on either side of the grille.",
        "A car with a high ground clearance and large wheel arches.",
        "A car with a flat, vertical rear end with large, rectangular taillights.",
        "A car with a roof rack on top.",
        "A car with a rear spoiler above the back window.",
        "A car with a split tailgate, where the window and the lower part can be opened separately.",
        "A car with a side profile that shows three rows of windows, indicating a three-row seating arrangement.",
        "A car with 5-spoke alloy wheels.",
        "A car with a side mirror that includes integrated turn signals.",
        "A car with a visible tow hitch at the back, indicating its towing capabilities.",
        "A car with a sunroof on the top.",
        "A car with a running board along the bottom of the side doors for easier access.",
        "A car with a 'Sequoia' badge on the back.",
        "A car with a rear wiper on the back window.",
        "A car with a visible antenna on the roof towards the rear end."
    ],
    "2012 Volkswagen Beetle Hatchback": [
        "A car with a rounded, almost bubble-like shape.",
        "A car with a front end that slopes down towards the bumper.",
        "A car with a rear spoiler that is integrated into the body.",
        "A car with a flat roofline that extends straight back to the rear of the vehicle.",
        "A car with large, circular headlights.",
        "A car with a small, oval-shaped grille located at the bottom of the front end.",
        "A car with a Volkswagen logo prominently displayed on the front and back.",
        "A car with two doors and a hatchback-style trunk.",
        "A car with a fuel cap located on the passenger side of the vehicle.",
        "A car with a compact, yet spacious interior.",
        "A car with a dashboard that mirrors the exterior color of the vehicle.",
        "A car with a glove box designed to look like a vintage suitcase.",
        "A car with 17-inch alloy wheels.",
        "A car with a rear window that is almost horizontal.",
        "A car with a distinctive, rounded rear end.",
        "A car with a single exhaust pipe located on the driver's side.",
        "A car with side mirrors that are color-matched to the body of the vehicle.",
        "A car with a small, rear window wiper.",
        "A car with a panoramic sunroof.",
        "A car with a flat-bottomed steering wheel."
    ],
    "2012 Volkswagen Golf Hatchback": [
        "A car with a compact, hatchback design.",
        "A car with a Volkswagen emblem on the front and back.",
        "A car with a horizontal two-bar front grille.",
        "A car with a rounded roofline.",
        "A car with a rear roof spoiler.",
        "A car with five-spoke alloy wheels.",
        "A car with body-colored door handles and side mirrors.",
        "A car with a single exhaust pipe on the left side.",
        "A car with a rear windshield wiper.",
        "A car with halogen headlights.",
        "A car with a small antenna on the rear roof.",
        "A car with a relatively flat hood and rear.",
        "A car with a high-mounted third brake light.",
        "A car with a black interior and cloth seats.",
        "A car with a three-spoke steering wheel with control buttons.",
        "A car with a center console that includes a touch screen display.",
        "A car with a manual or automatic transmission.",
        "A car with a fuel cap on the right side.",
        "A car with a split folding rear seat.",
        "A car with a cargo area cover in the trunk."
    ],
    "2012 Volvo C30 Hatchback": [
        "A car with a compact, two-door hatchback design.",
        "A car with a unique glass hatch rear end.",
        "A car with a distinctive shoulder line that runs from the headlights to the taillights.",
        "A car with a front grille that features a large Volvo emblem in the center.",
        "A car with a rear end that is almost vertical, unlike most hatchbacks.",
        "A car with a dual exhaust system located in the center of the rear bumper.",
        "A car with a small rear window and large C-pillars.",
        "A car with a front end that features a V-shaped hood and large headlights.",
        "A car with 17-inch alloy wheels as standard.",
        "A car with a roof spoiler above the rear window.",
        "A car with a unique 'waterfall' design in the center console.",
        "A car with a seating capacity for four passengers.",
        "A car with a T5 badge on the rear, indicating a turbocharged 5-cylinder engine.",
        "A car with a body that measures approximately 167 inches in length.",
        "A car with a panoramic sunroof, which is a rare feature in hatchbacks.",
        "A car with a rear windshield wiper.",
        "A car with a high-mounted third brake light.",
        "A car with a small, compact rear cargo area.",
        "A car with a distinctive, boxy yet sporty design, which is a signature of Volvo."
    ],
    "2012 smart fortwo Convertible": [
        "A car with a compact, two-seater design.",
        "A car with a convertible roof.",
        "A car with a short, almost square body shape.",
        "A car with a rear-mounted engine.",
        "A car with a tridion safety cell visible on the exterior, often in a contrasting color to the body panels.",
        "A car with large, round headlights.",
        "A car with a small, smiling grille.",
        "A car with a short hood and a nearly vertical windshield.",
        "A car with a single windshield wiper.",
        "A car with a rear window that is nearly as wide as the car itself.",
        "A car with a small luggage compartment at the rear.",
        "A car with 15-inch alloy wheels.",
        "A car with body-colored bumpers.",
        "A car with a high-mounted brake light at the rear.",
        "A car with a small, round fuel cap on the passenger side.",
        "A car with a short wheelbase and minimal overhangs.",
        "A car with a rear-wheel drive layout.",
        "A car with a small, compact interior with two seats only.",
        "A car with a semi-automatic transmission, with no clutch pedal.",
        "A car with a digital speedometer and rev counter on the dashboard."
    ],
    "2012 Ram C/V Cargo Van Minivan": [
        "A car with a large, boxy shape typical of a minivan.",
        "A car with a prominent front grille featuring the Ram logo.",
        "A car with a sliding door on each side for rear passenger or cargo access.",
        "A car with a rear liftgate for easy cargo loading and unloading.",
        "A car with a long, flat roofline.",
        "A car with a relatively high ground clearance for a minivan.",
        "A car with a large windshield and tall, rectangular side windows.",
        "A car with a short hood and a front end that slopes downward.",
        "A car with a pair of halogen headlamps on either side of the grille.",
        "A car with a pair of fog lamps located at the lower part of the front bumper.",
        "A car with a pair of vertical taillights at the rear corners.",
        "A car with a solid, unglazed panel in place of rear side windows, indicating its use for cargo.",
        "A car with 16-inch steel wheels.",
        "A car with black door handles and side mirrors.",
        "A car with a single exhaust pipe located on the right side.",
        "A car with a visible antenna on the roof.",
        "A car with a body-colored front and rear bumper."
    ]
}