{
    "annual crop land": [
        "A satellite image which shows a patchwork of different colors, indicating different crops or stages of growth.",
        "A satellite image which displays a regular, geometric pattern, suggesting human-made agricultural fields.",
        "A satellite image which reveals large, flat areas with little variation in color or texture, indicating a lack of natural features like mountains or forests.",
        "A satellite image which shows areas of bright green, indicating healthy, growing crops.",
        "A satellite image which displays areas of brown or yellow, suggesting harvested or fallow fields.",
        "A satellite image which reveals a lack of urban structures such as buildings or roads.",
        "A satellite image which shows a network of small, straight lines, indicating irrigation systems or access roads.",
        "A satellite image which displays a change in color or texture over time, suggesting seasonal crop rotation.",
        "A satellite image which reveals areas of water bodies or wetlands nearby, which could be used for irrigation.",
        "A satellite image which shows a lack of dense, dark green areas, indicating a lack of forested regions.",
        "A satellite image which displays a lack of high-altitude features like mountains or hills.",
        "A satellite image which reveals a lack of sandy or light-colored areas, indicating a lack of desert regions.",
        "A satellite image which shows a lack of snow or ice, indicating it's not a polar region.",
        "A satellite image which displays a lack of dark blue, open spaces, indicating it's not an ocean or large body of water.",
        "A satellite image which reveals a lack of densely packed, gray or brown areas, indicating a lack of urban or built-up regions."
    ],
    "forest": [
        "A satellite image which displays a vast expanse of green, indicating dense vegetation.",
        "A satellite image which shows a lack of urban development or infrastructure.",
        "A satellite image which exhibits a high degree of texture due to the tree canopy.",
        "A satellite image which reveals a lack of geometric patterns that are typically associated with agricultural fields.",
        "A satellite image which shows a lack of straight lines or right angles, as nature tends not to follow these patterns.",
        "A satellite image which displays a variety of green shades, indicating different types of trees and vegetation.",
        "A satellite image which shows areas of dark green, indicating older, mature trees.",
        "A satellite image which reveals areas of lighter green, suggesting younger trees or areas of new growth.",
        "A satellite image which exhibits no significant color changes throughout the year, unlike agricultural fields.",
        "A satellite image which shows a lack of regular, repeating patterns that would suggest human-made structures.",
        "A satellite image which displays a high level of moisture content, as forests tend to be in areas with high rainfall.",
        "A satellite image which reveals a lack of roads or transportation networks.",
        "A satellite image which shows a high degree of biodiversity, indicated by a variety of colors and textures.",
        "A satellite image which exhibits a lack of large, open water bodies, unlike coastal or riverine areas.",
        "A satellite image which shows a lack of uniformity in color and texture, unlike desert or tundra regions.",
        "A satellite image which reveals a high level of carbon storage, indicated by dense vegetation.",
        "A satellite image which displays a lack of human activity, such as smoke from factories or lights from cities.",
        "A satellite image which shows a high degree of wildlife activity, indicated by clearings or paths through the vegetation.",
        "A satellite image which exhibits a lack of soil exposure, unlike areas with extensive farming or mining activities.",
        "A satellite image which reveals a high degree of leaf area index, indicated by dense canopy cover."
    ],
    "highway or road": [
        "A satellite image which shows long, linear structures that may be straight or curved.",
        "A satellite image which displays clear, consistent paths cutting through various types of terrain.",
        "A satellite image which reveals structures with uniform width extending over large distances.",
        "A satellite image which presents distinct color contrasts between the path (road) and the surrounding landscape.",
        "A satellite image which shows paths that connect different populated areas or points of interest.",
        "A satellite image which exhibits junctions, intersections, or roundabouts.",
        "A satellite image which displays paths that may cross over bodies of water via bridges.",
        "A satellite image which reveals paths that tunnel through mountains or hills.",
        "A satellite image which shows paths that may have adjacent structures such as toll booths, rest areas, or gas stations.",
        "A satellite image which presents paths that may be surrounded by barriers or medians.",
        "A satellite image which exhibits paths that may have parallel lines indicating multiple lanes.",
        "A satellite image which shows paths that may have adjacent parking lots or service areas.",
        "A satellite image which reveals paths that may be accompanied by street lights or signs.",
        "A satellite image which displays paths that may have adjacent greenery or landscaping.",
        "A satellite image which presents paths that may have adjacent pedestrian or bicycle paths.",
        "A satellite image which shows paths that may have adjacent railway lines or airports.",
        "A satellite image which reveals paths that may have adjacent buildings or residential areas.",
        "A satellite image which exhibits paths that may have adjacent industrial areas or factories.",
        "A satellite image which shows paths that may have adjacent agricultural fields or forests.",
        "A satellite image which displays paths that may have adjacent bodies of water or coastal lines."
    ],
    "industrial buildings or commercial buildings": [
        "A satellite image which shows large, rectangular or square buildings closely packed together.",
        "A satellite image which displays extensive paved areas for parking and loading docks.",
        "A satellite image which reveals uniform, geometric building structures, often in a grid-like pattern.",
        "A satellite image which shows large open spaces or yards for storage of goods.",
        "A satellite image which displays structures with large rooftops, often made of metal or other reflective materials.",
        "A satellite image which reveals smokestacks or cooling towers, indicative of manufacturing or power generation.",
        "A satellite image which shows rail lines or shipping docks, suggesting the transport of goods.",
        "A satellite image which displays large, flat areas of concrete or asphalt, often used for vehicle movement and storage.",
        "A satellite image which reveals areas of bare ground or soil, often seen around construction or storage sites.",
        "A satellite image which shows distinct boundaries or fences around the property.",
        "A satellite image which displays large, outdoor tanks or reservoirs, often used for storage of liquids or gases.",
        "A satellite image which reveals a lack of vegetation, as industrial areas often have little to no greenery.",
        "A satellite image which shows straight, wide roads for easy access of heavy vehicles.",
        "A satellite image which displays a lack of residential buildings in the immediate vicinity.",
        "A satellite image which reveals a close proximity to major transportation routes, such as highways or railways.",
        "A satellite image which shows a high level of night-time illumination, indicative of 24-hour operations.",
        "A satellite image which displays a lack of natural features like rivers, forests, or hills within the area.",
        "A satellite image which reveals a high degree of land modification, such as grading or leveling.",
        "A satellite image which shows a close proximity to ports or airports, suggesting the import or export of goods.",
        "A satellite image which displays a high degree of spatial organization, with buildings and infrastructure arranged in a systematic manner."
    ],
    "pasture land": [
        "A satellite image which shows large, open areas of green or brown, indicating grass or hay fields.",
        "A satellite image which displays a lack of dense forestation or urban development.",
        "A satellite image which reveals a patchwork of fields, often in different shades of green or brown, indicating different types of grass or stages of growth.",
        "A satellite image which shows clear, straight lines or geometric shapes, suggesting man-made boundaries such as fences or roads.",
        "A satellite image which displays small, scattered structures, possibly indicating barns, stables, or other farm buildings.",
        "A satellite image which reveals areas of lighter coloration, possibly indicating paths worn by livestock.",
        "A satellite image which shows bodies of water, such as ponds or streams, which are often found in pasture lands for livestock hydration.",
        "A satellite image which displays areas of darker green, possibly indicating well-watered or fertile areas.",
        "A satellite image which reveals a lack of significant elevation changes, as pasture lands are typically flat or gently rolling.",
        "A satellite image which shows areas of bare soil or mud, possibly indicating high-traffic areas or overgrazed fields.",
        "A satellite image which displays a lack of significant infrastructure, such as highways or large buildings, which are more common in urban areas.",
        "A satellite image which reveals a lack of dense, continuous canopy cover, distinguishing it from forested areas.",
        "A satellite image which shows a lack of bright, artificial colors, distinguishing it from industrial or commercial areas.",
        "A satellite image which displays a lack of regular, grid-like patterns, distinguishing it from residential or urban areas.",
        "A satellite image which reveals a lack of large, open bodies of water, distinguishing it from coastal or lake regions."
    ],
    "permanent crop land": [
        "A satellite image which shows a consistent pattern of vegetation throughout the year.",
        "A satellite image which displays a uniform color indicating a single type of crop.",
        "A satellite image which reveals a grid-like or systematic pattern, suggesting human-made crop fields.",
        "A satellite image which shows a high level of greenness, indicating healthy vegetation.",
        "A satellite image which exhibits a lack of significant changes in the landscape over time.",
        "A satellite image which shows a lack of natural features such as forests, mountains, or bodies of water.",
        "A satellite image which displays a high level of reflectance in the near-infrared band, indicating healthy vegetation.",
        "A satellite image which shows a clear distinction between the crop land and the surrounding areas.",
        "A satellite image which reveals irrigation systems or other agricultural infrastructure.",
        "A satellite image which shows a lack of urban structures or buildings.",
        "A satellite image which displays a high level of brightness in the red band, indicating chlorophyll absorption.",
        "A satellite image which shows a lack of seasonal snow cover or ice.",
        "A satellite image which reveals a lack of significant topographic variation, suggesting a flat terrain.",
        "A satellite image which shows a high level of reflectance in the green band, indicating chlorophyll reflection.",
        "A satellite image which displays a low level of reflectance in the blue band, indicating less water absorption.",
        "A satellite image which shows a lack of significant changes in the vegetation pattern over multiple seasons.",
        "A satellite image which reveals a lack of bare soil or non-vegetated areas.",
        "A satellite image which shows a high level of reflectance in the shortwave infrared band, indicating moisture content.",
        "A satellite image which displays a lack of significant changes in the color of the vegetation over time.",
        "A satellite image which shows a lack of significant changes in the brightness of the vegetation over time."
    ],
    "residential buildings or homes or apartments": [
        "A satellite image which shows a dense arrangement of small to medium-sized structures, often rectangular or square in shape.",
        "A satellite image which displays a grid-like pattern, indicative of streets and avenues.",
        "A satellite image which reveals structures with similar shapes and sizes, suggesting a planned or uniform construction.",
        "A satellite image which shows areas of green space, such as gardens or parks, interspersed among the buildings.",
        "A satellite image which displays areas of lighter coloration, indicative of driveways or parking lots.",
        "A satellite image which reveals clusters of buildings separated by open spaces, suggesting yards or communal areas.",
        "A satellite image which shows a network of thin, connecting lines, indicative of residential roads and pathways.",
        "A satellite image which displays patches of blue, suggesting swimming pools in the backyards of homes.",
        "A satellite image which reveals shadows cast by structures, indicating the presence of multi-story buildings.",
        "A satellite image which shows a mix of grey, brown, and green colors, indicative of rooftops, roads, and vegetation respectively.",
        "A satellite image which displays a lack of large, open spaces, suggesting the absence of agricultural or industrial land use.",
        "A satellite image which reveals a lack of large, uniform structures, suggesting the absence of commercial or industrial buildings.",
        "A satellite image which shows a lack of straight, wide lines, suggesting the absence of highways or major roads.",
        "A satellite image which displays a lack of large bodies of water, suggesting the absence of lakes, rivers, or coastal areas.",
        "A satellite image which reveals a lack of dark, uniform areas, suggesting the absence of forests or large parks."
    ],
    "river": [
        "A satellite image which shows a long, winding, and narrow body of water.",
        "A satellite image which displays a body of water that branches out into smaller streams or tributaries.",
        "A satellite image which reveals a water body that changes in width along its course.",
        "A satellite image which presents a water body that often appears darker than the surrounding land.",
        "A satellite image which exhibits a water body that is surrounded by vegetation or greenery.",
        "A satellite image which portrays a water body that cuts through various types of terrain, such as mountains, forests, or plains.",
        "A satellite image which demonstrates a water body that may have sandbars or islands within its course.",
        "A satellite image which illustrates a water body that may have a delta or estuary at one end.",
        "A satellite image which depicts a water body that may be accompanied by man-made structures like bridges or dams.",
        "A satellite image which represents a water body that may have settlements or cities along its banks.",
        "A satellite image which shows a water body that may have a different color or texture due to sediment or pollution.",
        "A satellite image which displays a water body that may have ice or snow along its course in colder regions.",
        "A satellite image which reveals a water body that may have boats or ships visible, indicating navigable waters.",
        "A satellite image which presents a water body that may have floodplains visible during certain seasons.",
        "A satellite image which exhibits a water body that may have wetlands or marshes at its edges.",
        "A satellite image which portrays a water body that may have a visible flow direction based on the presence of ripples or waves.",
        "A satellite image which demonstrates a water body that may have a visible change in width or course over time in a series of images.",
        "A satellite image which illustrates a water body that may have a visible impact on the surrounding vegetation, such as a greener area along its course.",
        "A satellite image which depicts a water body that may have a visible impact on the surrounding terrain, such as erosion or carving of the landscape.",
        "A satellite image which represents a water body that may have a visible seasonal variation, such as drying up in certain seasons or flooding in others."
    ],
    "lake or sea": [
        "A satellite image which shows a large, continuous body of water.",
        "A satellite image which displays a distinct color difference between land and water bodies.",
        "A satellite image which reveals a smooth, uniform texture, indicative of water surfaces.",
        "A satellite image which shows a lack of infrastructure or buildings, common in bodies of water.",
        "A satellite image which displays a clear reflection of sunlight, a characteristic of water bodies.",
        "A satellite image which shows irregular or curved boundaries, typical of natural water bodies.",
        "A satellite image which reveals a lack of vegetation, common in large bodies of water.",
        "A satellite image which shows islands or land masses surrounded by water.",
        "A satellite image which displays varying shades of blue or green, indicative of water depth.",
        "A satellite image which shows sediment plumes, common in areas where rivers meet seas or lakes.",
        "A satellite image which reveals wave patterns or ripples, typical of water surfaces.",
        "A satellite image which shows ice caps or icebergs, common in polar seas or lakes.",
        "A satellite image which displays a lack of roads or transportation networks, typical of water bodies.",
        "A satellite image which shows a contrast in temperature, with water bodies often appearing cooler.",
        "A satellite image which reveals the presence of marine life, such as coral reefs or seaweed clusters.",
        "A satellite image which shows the presence of boats or ships, common in seas or large lakes.",
        "A satellite image which displays a lack of topographic variation, typical of water surfaces.",
        "A satellite image which reveals the presence of water currents or eddies, indicative of seas or large lakes.",
        "A satellite image which shows the presence of coastal features such as beaches, cliffs, or deltas.",
        "A satellite image which displays a lack of human-made structures, common in large bodies of water."
    ],
    "brushland or shrubland": [
        "A satellite image which shows a dominant green color, indicating the presence of chlorophyll in plants.",
        "A satellite image which displays a uniform texture, suggesting a consistent type of vegetation.",
        "A satellite image which lacks the presence of large, solid structures such as buildings or roads.",
        "A satellite image which shows a lack of shadows, indicating the absence of tall structures like trees or buildings.",
        "A satellite image which exhibits a lack of water bodies, as herbaceous vegetation typically doesn't grow in water.",
        "A satellite image which shows a lack of significant color variation, suggesting a single type of vegetation.",
        "A satellite image which lacks the presence of bright white spots, indicating the absence of snow or ice.",
        "A satellite image which shows a lack of dark patches, suggesting the absence of bare soil or rock formations.",
        "A satellite image which lacks the presence of linear patterns, indicating the absence of man-made structures or roads.",
        "A satellite image which shows a lack of brown patches, suggesting the absence of dead or dying vegetation.",
        "A satellite image which lacks the presence of blue or grey patches, indicating the absence of urban areas or concrete structures.",
        "A satellite image which shows a lack of sharp edges or straight lines, suggesting the absence of agricultural fields or man-made structures.",
        "A satellite image which lacks the presence of irregular or scattered patches, indicating the absence of mixed vegetation or forested areas.",
        "A satellite image which shows a lack of bright red or orange patches, suggesting the absence of areas affected by fire or drought.",
        "A satellite image which lacks the presence of circular patterns, indicating the absence of irrigated agricultural fields."
    ]
}