{
    "707-320": [
        "An aircraft with four engines mounted on the wings.",
        "An aircraft with a narrow-body fuselage.",
        "An aircraft with a swept-wing design.",
        "An aircraft with a distinctive nose cone shape.",
        "An aircraft with a tail fin that has a slight forward lean.",
        "An aircraft with a length of approximately 152 feet.",
        "An aircraft with a wingspan of approximately 145 feet.",
        "An aircraft with a T-tail configuration, where the horizontal stabilizer is mounted on top of the vertical stabilizer.",
        "An aircraft with a circular cross-section of the fuselage.",
        "An aircraft with a noticeable 'hump' or 'bump' at the front of the aircraft, which is the cockpit.",
        "An aircraft with a relatively low ground clearance, meaning the body of the plane is closer to the ground compared to other aircraft.",
        "An aircraft with a seating capacity of up to 189 passengers.",
        "An aircraft with a range of approximately 4,000 to 6,000 nautical miles.",
        "An aircraft with a cruising speed of approximately 600 mph.",
        "An aircraft with a distinctive '7' series Boeing design.",
        "An aircraft with a high-bypass turbofan engine.",
        "An aircraft with a relatively long and slim body compared to other aircraft of similar capacity.",
        "An aircraft with a traditional tricycle landing gear configuration.",
        "An aircraft with a relatively small diameter of the engine nacelles.",
        "An aircraft with a noticeable absence of winglets at the wingtips."
    ],
    "727-200": [
        "An aircraft with three engines, one on each side of the rear fuselage and the third in the tail.",
        "An aircraft with a T-tail, where the horizontal stabilizer is mounted on top of the vertical stabilizer.",
        "An aircraft with a distinctive S-duct air intake for the tail engine.",
        "An aircraft with a high-lift wing and powerful slats and flaps that allow it to operate from relatively short runways.",
        "An aircraft with a built-in airstair in the rear under the tail engine.",
        "An aircraft with a length of approximately 153 feet (47 meters).",
        "An aircraft with a wingspan of approximately 108 feet (33 meters).",
        "An aircraft with a narrow-body fuselage design.",
        "An aircraft with a 5-abreast seating configuration in economy class.",
        "An aircraft with a retractable landing gear system.",
        "An aircraft with a clean, uncluttered under-wing area due to the placement of engines at the rear.",
        "An aircraft with a maximum capacity of around 189 passengers in a single-class layout.",
        "An aircraft with a distinctive noise profile due to its three high-bypass turbofan engines.",
        "An aircraft with a circular cross-section of the fuselage.",
        "An aircraft with a relatively low-slung appearance when on the ground due to its landing gear design.",
        "An aircraft with a cockpit window layout consisting of five panes, with two main panes on each side and a smaller one in the center.",
        "An aircraft with a noticeable lack of winglets or sharklets on the wingtips.",
        "An aircraft with a relatively straight wing design, without a significant sweepback angle."
    ],
    "737-200": [
        "An aircraft with two engines mounted on the rear of the fuselage.",
        "An aircraft with a narrow-body, single-aisle configuration.",
        "An aircraft with a pointed nose and a relatively short body compared to other models.",
        "An aircraft with a T-tail, where the horizontal stabilizer is mounted on top of the vertical stabilizer.",
        "An aircraft with a clean, uncluttered under-wing area due to the absence of engines.",
        "An aircraft with a relatively low ground clearance, making the engines appear close to the ground.",
        "An aircraft with a four-window cockpit, which is less than other models like the 737-800 which has six.",
        "An aircraft with a single over-wing emergency exit on each side for the standard version.",
        "An aircraft with a distinctive 'eyebrow' window above the main cockpit windows, a feature that was common on early 737 models.",
        "An aircraft with a relatively short landing gear compared to other models.",
        "An aircraft with a lack of winglets, which are common on newer 737 models.",
        "An aircraft with a classic analog cockpit, as opposed to the glass cockpits found in newer models."
    ],
    "737-300": [
        "An aircraft with a length of approximately 33.4 meters.",
        "An aircraft with a wingspan of about 28.9 meters.",
        "An aircraft with a tail height of approximately 11.1 meters.",
        "An aircraft with two underwing turbofan engines.",
        "An aircraft with a narrow-body, single-aisle cabin layout.",
        "An aircraft with a pointed nose and a relatively small cockpit window area.",
        "An aircraft with a distinctive 'hamster pouch' engine design, where the bottom of the engine casing is flattened.",
        "An aircraft with a capacity of around 149 passengers in a two-class layout.",
        "An aircraft with a T-tail configuration, where the horizontal stabilizer is mounted on top of the vertical stabilizer.",
        "An aircraft with a clean, uncluttered undercarriage with two main landing gear assemblies.",
        "An aircraft with a relatively low ground clearance compared to other jet airliners.",
        "An aircraft with no winglets on the wing tips, unlike later 737 models.",
        "An aircraft with a single over-wing emergency exit on each side in most configurations.",
        "An aircraft with a relatively short fuselage compared to later 737 models.",
        "An aircraft with a classic analog cockpit, as opposed to the glass cockpits found in newer aircraft."
    ],
    "737-400": [
        "An aircraft with a length of approximately 119 feet 7 inches, which is longer than the 737-300 and shorter than the 737-800.",
        "An aircraft with a wingspan of 94 feet 9 inches, which is common to all classic 737 series.",
        "An aircraft with a tail height of 36 feet 6 inches, similar to other 737 classic series.",
        "An aircraft with two underwing engines, a common feature of all 737 series.",
        "An aircraft with a capacity of around 168 passengers in a two-class layout, which is more than the 737-300 and less than the 737-800.",
        "An aircraft with a distinctive 'eyebrow window' above the main cockpit windows, a feature common to older 737 models.",
        "An aircraft with six cabin doors, three on each side, which is one more than the 737-300 and one less than the 737-800.",
        "An aircraft with two overwing emergency exits on each side, a feature common to all 737 series.",
        "An aircraft with a 'clean wing' design, lacking winglets, which is common to the classic 737 series.",
        "An aircraft with a relatively short and stubby fuselage compared to other narrow-body aircraft.",
        "An aircraft with a classic 737 nose cone, which is more rounded and less pointed than the later 737 Next Generation series.",
        "An aircraft with a two-wheel nose landing gear and a four-wheel main landing gear, a common feature of all 737 series.",
        "An aircraft with a CFM56-3 series engine, which is larger and sits higher off the ground than the engines on the original 737 series.",
        "An aircraft with a 'two-crew' glass cockpit, which is less advanced than the 'Next Generation' 737 series.",
        "An aircraft with a relatively low ground clearance, a characteristic feature of the 737 series."
    ],
    "737-500": [
        "An aircraft with a length of approximately 101 feet (31 meters).",
        "An aircraft with a wingspan of about 93 feet (28.35 meters).",
        "An aircraft with two underwing turbofan engines.",
        "An aircraft with a tail height of approximately 36 feet (11 meters).",
        "An aircraft with a single-aisle, narrow-body design.",
        "An aircraft with a pointed nose and a rounded tail.",
        "An aircraft with a 'dolphin-shaped' fuselage.",
        "An aircraft with a seating capacity of around 132 passengers in a two-class layout.",
        "An aircraft with a cockpit window design that includes two main windows on each side, with a smaller window below the main windows.",
        "An aircraft with a T-tail configuration, where the horizontal stabilizer is mounted on top of the vertical stabilizer.",
        "An aircraft with a relatively short body compared to other 737 models.",
        "An aircraft with a small winglet or none at all, unlike the newer 737 models which have larger, upturned winglets.",
        "An aircraft with two sets of landing gear, each with two wheels, located under the fuselage and a set of two wheels under the nose.",
        "An aircraft with a relatively low ground clearance compared to other aircraft models.",
        "An aircraft with a door configuration of one forward and one aft passenger door on each side, and two overwing emergency exits on each side."
    ],
    "737-600": [
        "An aircraft with a length of approximately 102 feet, shorter than other 737 models.",
        "An aircraft with a wingspan of approximately 112 feet.",
        "An aircraft with a twin-engine configuration.",
        "An aircraft with a single-aisle, narrow-body design.",
        "An aircraft with a distinctive 'hamster pouch' engine design, where the bottom of the engine is flattened.",
        "An aircraft with a tail height of approximately 41 feet.",
        "An aircraft with a seating capacity of around 130 passengers in a two-class layout.",
        "An aircraft with a cockpit window design that includes two panes on each side, with a distinctive 'eyebrow' window above.",
        "An aircraft with a pointed nose and a relatively high ground clearance.",
        "An aircraft with a T-tail configuration, where the horizontal stabilizer is mounted on top of the vertical stabilizer.",
        "An aircraft with winglets on the tips of the wings, which are optional and not present on all 737-600s.",
        "An aircraft with two exit doors on each side, located at the front and rear of the passenger cabin.",
        "An aircraft with a relatively short fuselage compared to other 737 models.",
        "An aircraft with a 'clean wing' design, where the flaps and slats are fully retracted when not in use.",
        "An aircraft with a high-bypass turbofan engine, specifically the CFM56-7 series.",
        "An aircraft with a circular cross-section of the fuselage.",
        "An aircraft with a relatively small number of windows compared to other 737 models, due to its shorter length.",
        "An aircraft with a standard Boeing cockpit layout, with four large display screens.",
        "An aircraft with a relatively low maximum takeoff weight compared to other 737 models.",
        "An aircraft with a cruise speed of approximately Mach 0.785."
    ],
    "737-700": [
        "An aircraft with a length of approximately 33.6 meters.",
        "An aircraft with a wingspan of about 34.3 meters.",
        "An aircraft with a tail height of approximately 12.5 meters.",
        "An aircraft with two underwing engines.",
        "An aircraft with a single-aisle cabin layout.",
        "An aircraft with a pointed nose and a rounded tail.",
        "An aircraft with a total of six cabin doors, three on each side.",
        "An aircraft with two overwing emergency exits on each side.",
        "An aircraft with a 'hamster pouch' rear cargo door.",
        "An aircraft with a relatively small diameter fuselage compared to other jet airliners.",
        "An aircraft with a flat-bottomed fuselage.",
        "An aircraft with a distinctive 'eyebrow' window above the cockpit.",
        "An aircraft with a winglet at the end of each wing, which is a distinctive upward curve.",
        "An aircraft with a relatively high ground clearance for its engines.",
        "An aircraft with a T-tail configuration, where the horizontal stabilizer is mounted on top of the vertical stabilizer.",
        "An aircraft with a relatively short distance between the nose gear and the main landing gear.",
        "An aircraft with a two-wheel nose landing gear and a four-wheel main landing gear.",
        "An aircraft with a relatively narrow body, typically seating six passengers in a row with an aisle in the middle.",
        "An aircraft with a 'clean' wing underside with no engine attachments or pylons visible.",
        "An aircraft with a relatively short and stubby appearance compared to other jet airliners."
    ],
    "737-800": [
        "An aircraft with two engines mounted under the wings.",
        "An aircraft with a single aisle in the cabin.",
        "An aircraft with a pointed nose cone.",
        "An aircraft with a length of approximately 129 feet (39.5 meters).",
        "An aircraft with a wingspan of approximately 117 feet (35.8 meters).",
        "An aircraft with winglets at the tip of the wings, which are upwardly curved.",
        "An aircraft with a tail fin that has a slight forward lean.",
        "An aircraft with a relatively low ground clearance.",
        "An aircraft with a total of six cabin doors, three on each side.",
        "An aircraft with two overwing emergency exits on each side.",
        "An aircraft with a 'clean' underbelly with no bulges or protrusions.",
        "An aircraft with a flat rear end, without any auxiliary power unit (APU) exhaust cone.",
        "An aircraft with a cockpit window design that includes two main windows on each side, with a smaller window below the main windows.",
        "An aircraft with a relatively short and stubby appearance compared to other narrow-body jets.",
        "An aircraft with a circular cross-section of the fuselage.",
        "An aircraft with a high bypass ratio turbofan engines.",
        "An aircraft with a 'no step' zone marked on the wings.",
        "An aircraft with a landing gear consisting of two main wheels on each of the two main legs and two wheels on the nose gear."
    ],
    "737-900": [
        "An aircraft with a length of approximately 138 feet 2 inches, making it the longest variant in the 737 series.",
        "An aircraft with a low-wing design, with wings located beneath the fuselage.",
        "An aircraft with two underwing engines, which are typically CFM56-7 engines.",
        "An aircraft with a single aisle and a narrow body design.",
        "An aircraft with a pointed nose and a rounded tail.",
        "An aircraft with a tail height of approximately 41 feet 2 inches.",
        "An aircraft with a capacity to seat between 178 to 220 passengers in a two-class layout.",
        "An aircraft with a distinctive 'flat-bottomed' look due to its low ground clearance.",
        "An aircraft with two sets of main landing gear, each with two wheels, located under the wings.",
        "An aircraft with a smaller, two-wheel nose landing gear located under the front of the fuselage.",
        "An aircraft with a split winglet design at the end of its wings, a feature of the latest 737-900ER variant.",
        "An aircraft with a total of six cabin doors, three on each side of the fuselage.",
        "An aircraft with two overwing emergency exits on each side, a unique feature of the 737-900 variant.",
        "An aircraft with a flight deck that is located above the passenger compartment.",
        "An aircraft with a T-tail configuration, where the tailplane is mounted at the top of the fin."
    ],
    "747-100": [
        "An aircraft with a hump-like upper deck towards the front of the plane.",
        "An aircraft with four engines, two under each wing.",
        "An aircraft with a length of approximately 231 feet (70.5 meters).",
        "An aircraft with a wingspan of approximately 196 feet (59.6 meters).",
        "An aircraft with a distinctive 37.5 degree wing sweep, allowing for higher speed travel.",
        "An aircraft with a twin-aisle wide-body design.",
        "An aircraft with a total of ten windows on the upper deck, five on each side.",
        "An aircraft with a tail height of approximately 63 feet (19.3 meters).",
        "An aircraft with a nose door, indicating its ability to carry freight.",
        "An aircraft with a Pratt & Whitney JT9D-3A engine type.",
        "An aircraft with a horizontal stabilizer located at the top of the tail.",
        "An aircraft with a maximum takeoff weight of 735,000 pounds (333,400 kilograms).",
        "An aircraft with a cruising speed of approximately 0.84 Mach.",
        "An aircraft with a range of approximately 5,300 nautical miles (9,800 kilometers).",
        "An aircraft with a seating capacity of up to 366 passengers in a typical two-class layout.",
        "An aircraft with a distinctive Boeing logo on the tail."
    ],
    "747-200": [
        "An aircraft with a distinctive hump on the front part of the fuselage, which is the upper deck.",
        "An aircraft with four engines, two under each wing.",
        "An aircraft with a length of approximately 231 feet and 10 inches.",
        "An aircraft with a wingspan of approximately 195 feet and 8 inches.",
        "An aircraft with a tail height of approximately 63 feet and 5 inches.",
        "An aircraft with a 3-4-3 seating configuration in economy class.",
        "An aircraft with a 2-3-2 seating configuration in the upper deck.",
        "An aircraft with a nose cargo door, indicating it may be a combi model.",
        "An aircraft with a range of approximately 6,857 nautical miles.",
        "An aircraft with a maximum takeoff weight of approximately 833,000 pounds.",
        "An aircraft with a cruise speed of approximately Mach 0.84.",
        "An aircraft with Pratt & Whitney JT9D-7 engines, General Electric CF6-50E or Rolls-Royce RB211-524 engines.",
        "An aircraft with a total of 10 doors, five on each side of the main deck.",
        "An aircraft with a distinctive 'wingtip' design, which is a small vertical fin at the end of the wing.",
        "An aircraft with a two-crew cockpit layout.",
        "An aircraft with a total passenger capacity of approximately 480 in a two-class layout.",
        "An aircraft with a landing gear configuration of two sets of four-wheel bogies and a two-wheel nose unit."
    ],
    "747-300": [
        "An aircraft with a hump-like upper deck structure towards the front, which is longer than those found on earlier 747 models.",
        "An aircraft with a length of 231 feet and 10 inches, which is longer than many other commercial aircraft.",
        "An aircraft with a wingspan of 195 feet and 8 inches, which is wider than many other commercial aircraft.",
        "An aircraft with four engines, two on each wing.",
        "An aircraft with a distinctive 'winglet' at the end of each wing, which is not present on earlier 747 models.",
        "An aircraft with a tail height of 63 feet and 5 inches, which is taller than many other commercial aircraft.",
        "An aircraft with a maximum takeoff weight of 833,000 pounds, which is heavier than many other commercial aircraft.",
        "An aircraft with a cruising speed of 0.85 Mach, which is faster than many other commercial aircraft.",
        "An aircraft with a range of 7,260 nautical miles, which is longer than many other commercial aircraft.",
        "An aircraft with a seating capacity of up to 624 passengers in a two-class layout, which is larger than many other commercial aircraft.",
        "An aircraft with a distinctive nose cargo door, which is not present on many other commercial aircraft.",
        "An aircraft with a three-bogie landing gear system, which is not common in many other commercial aircraft.",
        "An aircraft with a total of 10 cabin doors, five on each side.",
        "An aircraft with a distinctive 'double bubble' fuselage, which is wider on the top than on the bottom.",
        "An aircraft with a cockpit that is located on the upper deck, which is not common in many other commercial aircraft."
    ],
    "747-400": [
        "An aircraft with a hump in the front that extends along approximately one-third of the entire length of the aircraft.",
        "An aircraft with four engines, two under each wing.",
        "An aircraft with a wingspan of approximately 211 feet.",
        "An aircraft with a length of approximately 231 feet.",
        "An aircraft with winglets on the tips of the wings, which are angled upwards.",
        "An aircraft with 10 windows on the upper deck on each side.",
        "An aircraft with a total of 16 main landing gear wheels, with four sets of four wheels.",
        "An aircraft with a tail height of approximately 63 feet.",
        "An aircraft with a distinctive 'double-decker' appearance due to the upper deck.",
        "An aircraft with a nose cargo door, which is a unique feature for cargo versions.",
        "An aircraft with a flight deck that is located on the upper deck of the aircraft.",
        "An aircraft with a maximum takeoff weight of approximately 875,000 pounds.",
        "An aircraft with a cruising speed of approximately 570 mph.",
        "An aircraft with a range of approximately 7,670 nautical miles.",
        "An aircraft with a seating capacity of up to 660 passengers in a high-density configuration.",
        "An aircraft with a two-aisle cabin layout.",
        "An aircraft with a distinctive 'hump' that starts directly above the cockpit and extends to the middle of the fuselage.",
        "An aircraft with a logo light on the tail to illuminate the airline's logo at night.",
        "An aircraft with a four-wheel nose landing gear.",
        "An aircraft with a total of three air stair doors: one at the front, one at the back, and one on the upper deck."
    ],
    "757-200": [
        "An aircraft with a length of approximately 155 feet.",
        "An aircraft with a narrow body and twin-engine jetliner.",
        "An aircraft with a distinctive nose shape that is pointed and sleek.",
        "An aircraft with a T-tail and rear-mounted engines.",
        "An aircraft with a wingspan of approximately 124 feet.",
        "An aircraft with a high-bypass turbofan engine mounted on pylons under the wings.",
        "An aircraft with a seating capacity of around 200 passengers in a two-class layout.",
        "An aircraft with a single aisle in the passenger cabin.",
        "An aircraft with a range of approximately 3,900 to 4,100 nautical miles.",
        "An aircraft with a high undercarriage and engines that appear too large for its body.",
        "An aircraft with a 'dolphin' shaped fuselage, where the top of the fuselage is curved from the nose to the tail.",
        "An aircraft with a cockpit window design that has a unique 'eyebrow' window above the main side windows.",
        "An aircraft with a tail cone that is more rounded and less conical than other aircraft.",
        "An aircraft with a door layout of one before the wings and two after the wings on each side.",
        "An aircraft with a relatively low ground clearance compared to other similar-sized aircraft.",
        "An aircraft with a wing design that includes winglets on the tips for improved aerodynamics.",
        "An aircraft with a fuselage diameter of approximately 12 feet.",
        "An aircraft with a total of seven cabin doors, three on each side and one at the rear.",
        "An aircraft with a cruise speed of approximately Mach 0.8.",
        "An aircraft with a maximum takeoff weight of approximately 255,000 pounds."
    ],
    "757-300": [
        "An aircraft with a length of approximately 178.7 feet, making it one of the longest single-aisle twinjets.",
        "An aircraft with a distinctive nose shape that is pointed and sleek.",
        "An aircraft with two high-bypass turbofan engines mounted under the wings.",
        "An aircraft with a T-tail, where the horizontal stabilizer is mounted on top of the vertical stabilizer.",
        "An aircraft with a narrow body and a single aisle, accommodating six passengers in each row with a 3-3 configuration.",
        "An aircraft with a large, upwardly angled winglets on the tips of its wings.",
        "An aircraft with a total of eight doors, four on each side.",
        "An aircraft with a relatively high ground clearance, allowing for larger engines underneath the wings.",
        "An aircraft with a capacity to carry between 243 to 295 passengers.",
        "An aircraft with a cockpit that has a similar layout to other Boeing aircraft, such as the 767 and 777.",
        "An aircraft with a range of approximately 3,395 nautical miles.",
        "An aircraft with a cruising speed of Mach 0.8.",
        "An aircraft with a distinctive 'dolphin' shaped fuselage."
    ],
    "767-200": [
        "An aircraft with a length of approximately 159 feet (48.5 meters).",
        "An aircraft with a twin-engine design.",
        "An aircraft with a wide-body fuselage.",
        "An aircraft with a twin-aisle cabin layout.",
        "An aircraft with a slightly angled tail fin.",
        "An aircraft with a rear fuselage that tapers to a point.",
        "An aircraft with a wingspan of approximately 156 feet (47.6 meters).",
        "An aircraft with a distinctive 'dolphin' shaped nose.",
        "An aircraft with a seating capacity of around 181 to 255 passengers.",
        "An aircraft with a cockpit window layout of six panes, three per side.",
        "An aircraft with a high bypass ratio turbofan engines mounted under the wings.",
        "An aircraft with a conventional tail unit featuring a single vertical stabilizer and horizontal stabilizers.",
        "An aircraft with a landing gear configuration of two main landing gear assemblies and a nose gear.",
        "An aircraft with a range of approximately 3,900 to 6,385 nautical miles.",
        "An aircraft with a cruise speed of approximately Mach 0.80.",
        "An aircraft with a maximum takeoff weight of approximately 315,000 to 395,000 pounds.",
        "An aircraft with a door configuration of one at the front, one over the wing, and one at the rear on each side.",
        "An aircraft with a relatively low ground clearance compared to other wide-body aircraft.",
        "An aircraft with a circular cross-section of the fuselage.",
        "An aircraft with a relatively short body compared to other wide-body aircraft."
    ],
    "767-300": [
        "An aircraft with a length of approximately 180 feet, which is longer than the 767-200.",
        "An aircraft with two underwing turbofan engines.",
        "An aircraft with a twin-aisle wide-body configuration.",
        "An aircraft with a slightly swept-back wing design.",
        "An aircraft with a tail height of approximately 52 feet.",
        "An aircraft with a distinctive 'double-bubble' fuselage cross-section.",
        "An aircraft with a seating capacity of around 210 to 290 passengers in a two-class layout.",
        "An aircraft with a range of approximately 5,980 nautical miles.",
        "An aircraft with a cockpit that sits above the main cabin, providing a hump-like appearance.",
        "An aircraft with a conventional tail unit featuring a single vertical stabilizer and two horizontal stabilizers.",
        "An aircraft with a total of ten doors, five on each side of the fuselage.",
        "An aircraft with a landing gear configuration of two main landing gear assemblies and a nose gear.",
        "An aircraft with a wingspan of approximately 156 feet.",
        "An aircraft with a distinctive Boeing-style cockpit window design.",
        "An aircraft with a maximum takeoff weight of approximately 412,000 pounds.",
        "An aircraft with a cruise speed of approximately Mach 0.80.",
        "An aircraft with a high bypass ratio turbofan engines, either General Electric CF6, Pratt & Whitney PW4000, or Rolls-Royce RB211.",
        "An aircraft with a fuselage diameter of approximately 16.5 feet.",
        "An aircraft with a wing sweep of 31.5 degrees at quarter chord.",
        "An aircraft with a T-tail configuration, where the horizontal stabilizer is mounted on top of the vertical stabilizer."
    ],
    "767-400": [
        "An aircraft with a length of approximately 201 feet, making it longer than other 767 variants.",
        "An aircraft with a wingspan of about 170 feet.",
        "An aircraft with a distinctive 'raked' wingtip design, which extends the wings further than other 767 models.",
        "An aircraft with two underwing engines.",
        "An aircraft with a twin-aisle wide-body design.",
        "An aircraft with a tail height of approximately 55 feet.",
        "An aircraft with a total of 10 doors, five on each side of the fuselage.",
        "An aircraft with a cockpit window design that is similar to other Boeing models, but the overall length and wing design distinguish it from others.",
        "An aircraft with a capacity to seat between 240 and 304 passengers in a two-class layout.",
        "An aircraft with a distinctive landing gear configuration of two main landing gears, each with six wheels.",
        "An aircraft with a fuselage diameter of approximately 16.5 feet.",
        "An aircraft with a range of approximately 5,625 nautical miles, which can be a clue if the photo provides context about its flight distance.",
        "An aircraft with a T-tail configuration, where the horizontal stabilizer is mounted on top of the vertical stabilizer.",
        "An aircraft with a slightly curved nose, which is a common feature in many Boeing aircraft.",
        "An aircraft with a two-crew glass cockpit, which is a common feature in many modern commercial aircraft."
    ],
    "777-200": [
        "An aircraft with two large engines, one under each wing.",
        "An aircraft with a long, cylindrical fuselage.",
        "An aircraft with a distinctive, sloping forehead on the nose.",
        "An aircraft with a wingspan of approximately 199 feet.",
        "An aircraft with a length of approximately 209 feet.",
        "An aircraft with a tail height of approximately 61 feet.",
        "An aircraft with a seating capacity of up to 314 to 396 passengers.",
        "An aircraft with a twin-aisle cabin layout.",
        "An aircraft with a total of six doors, three on each side.",
        "An aircraft with a wheel configuration of two sets of six wheels each on the main landing gear and two wheels on the nose gear.",
        "An aircraft with wingtips that are slightly raked back but not upturned.",
        "An aircraft with a circular cross-section of the fuselage.",
        "An aircraft with a relatively flat lower fuselage compared to other aircraft.",
        "An aircraft with a cockpit window layout of two main windows on each side, with a smaller window below the main windows.",
        "An aircraft with a high bypass ratio turbofan engines.",
        "An aircraft with a relatively large distance between the trailing edge of the wing and the tailplane.",
        "An aircraft with a tail cone that tapers to a point.",
        "An aircraft with a relatively large diameter of the engine nacelles.",
        "An aircraft with a high-mounted horizontal stabilizer on the tail."
    ],
    "777-300": [
        "An aircraft with a length of approximately 242 feet, making it one of the longest passenger aircraft in the world.",
        "An aircraft with two large, high-bypass turbofan engines.",
        "An aircraft with a wide-body, twin-aisle cabin layout.",
        "An aircraft with a distinctive tail cone design.",
        "An aircraft with a large, circular fuselage cross-section.",
        "An aircraft with a wingspan of approximately 199 feet.",
        "An aircraft with a total of six wheels on each of its two main landing gears.",
        "An aircraft with a slightly sloped nose.",
        "An aircraft with a seating capacity of up to 396 passengers in a two-class layout.",
        "An aircraft with a range of approximately 7,370 nautical miles.",
        "An aircraft with wingtips that are raked back instead of winglets.",
        "An aircraft with a cockpit window layout of six panes, three per side.",
        "An aircraft with a 'triple seven' inscription near the front of the aircraft.",
        "An aircraft with a large cargo capacity, with two main cargo doors on the right side of the aircraft.",
        "An aircraft with a high-mounted horizontal stabilizer on the tail.",
        "An aircraft with a high bypass ratio, which can be identified by the large size of the engine nacelles compared to the size of the engine cores.",
        "An aircraft with a T-tail configuration, where the horizontal stabilizer is mounted at the top of the vertical stabilizer.",
        "An aircraft with a wide, spacious interior, often with a 3-3-3 or 3-4-3 seating configuration in economy class.",
        "An aircraft with a high cruising speed, typically around Mach 0.84.",
        "An aircraft with a distinctive 'hump' at the front of the aircraft, similar to the Boeing 747, but less pronounced."
    ],
    "A300B4": [
        "An aircraft with a length of approximately 177 feet.",
        "An aircraft with a wingspan of about 147 feet.",
        "An aircraft with two underwing turbofan engines.",
        "An aircraft with a twin-aisle wide-body configuration.",
        "An aircraft with a distinctive 'dolphin' shaped nose.",
        "An aircraft with a tail height of approximately 54 feet.",
        "An aircraft with a seating capacity of around 266 to 361 passengers in a two-class layout.",
        "An aircraft with a circular cross-section fuselage.",
        "An aircraft with a conventional tail unit featuring a single vertical stabilizer.",
        "An aircraft with a relatively low-wing design.",
        "An aircraft with four-wheel bogie main landing gear.",
        "An aircraft with a cockpit that accommodates two crew members.",
        "An aircraft with a range of approximately 4,000 nautical miles.",
        "An aircraft with a maximum takeoff weight of about 165,000 kg.",
        "An aircraft with a cruise speed of approximately Mach 0.78.",
        "An aircraft with a typical exit layout of four doors on each side of the fuselage.",
        "An aircraft with a noticeable lack of winglets or sharklets on the wingtips.",
        "An aircraft with a relatively straight wing design, without a significant sweepback angle.",
        "An aircraft with a high-mounted horizontal stabilizer on the tail."
    ],
    "A310": [
        "An aircraft with a length of approximately 153 feet.",
        "An aircraft with a wingspan of about 144 feet.",
        "An aircraft with two engines mounted under the wings.",
        "An aircraft with a twin-aisle wide-body configuration.",
        "An aircraft with a slightly swept-back wing design.",
        "An aircraft with a distinctive 'Airbus' nose shape.",
        "An aircraft with a tail height of approximately 51 feet.",
        "An aircraft with a circular fuselage cross-section.",
        "An aircraft with a seating capacity of around 200 in a two-class configuration.",
        "An aircraft with a range of approximately 5,150 nautical miles.",
        "An aircraft with a T-tail configuration, where the horizontal stabilizer is mounted on top of the vertical stabilizer.",
        "An aircraft with a relatively short fuselage compared to other wide-body aircraft.",
        "An aircraft with a cockpit window layout typical of Airbus, with six panes and a downward-curving forward edge.",
        "An aircraft with a high-bypass turbofan engine.",
        "An aircraft with a conventional tail design, with the horizontal stabilizer mounted at the base of the vertical stabilizer.",
        "An aircraft with a two-wheel nose landing gear and four-wheel bogie main landing gear.",
        "An aircraft with a maximum takeoff weight of approximately 364,000 pounds.",
        "An aircraft with a cruise speed of approximately Mach 0.80.",
        "An aircraft with a service ceiling of approximately 41,000 feet.",
        "An aircraft with a typical Airbus cockpit layout, with side-stick controls and a glass cockpit."
    ],
    "A318": [
        "An aircraft with a length of approximately 31.44 meters.",
        "An aircraft with a wingspan of about 34.10 meters.",
        "An aircraft with a height of roughly 12.56 meters.",
        "An aircraft with a single-aisle cabin.",
        "An aircraft with two underwing turbofan engines.",
        "An aircraft with a twin-engine configuration.",
        "An aircraft with a circular fuselage cross-section.",
        "An aircraft with a T-tail and rear-mounted engines.",
        "An aircraft with a low-wing design.",
        "An aircraft with a seating capacity of around 107 to 132 passengers in a two-class layout.",
        "An aircraft with a cockpit window layout of six panes, with two main panes on each side and two smaller ones.",
        "An aircraft with a swept-back wing design.",
        "An aircraft with a bulbous nose.",
        "An aircraft with a relatively short body compared to other members of the same family.",
        "An aircraft with a standard Airbus A320 family door configuration of one over the wing and one at the front and rear on each side.",
        "An aircraft with wingtip fences on the end of its wings.",
        "An aircraft with a relatively small horizontal stabilizer compared to other members of the same family.",
        "An aircraft with a high bypass ratio turbofan engines.",
        "An aircraft with a retractable tricycle landing gear.",
        "An aircraft with a relatively short distance between the front and rear landing gears."
    ],
    "A319": [
        "An aircraft with two engines mounted under the wings.",
        "An aircraft with a single aisle in the cabin.",
        "An aircraft with a rounded nose.",
        "An aircraft with a tail cone that ends in a point.",
        "An aircraft with wingtip fences on the end of the wings.",
        "An aircraft with a length of approximately 111 feet.",
        "An aircraft with a wingspan of approximately 111 feet.",
        "An aircraft with a height of approximately 38 feet.",
        "An aircraft with a capacity of around 124 to 156 passengers.",
        "An aircraft with four cabin doors, two at the front and two at the rear.",
        "An aircraft with a T-tail, where the horizontal stabilizer is mounted on top of the vertical stabilizer.",
        "An aircraft with a circular cross-section of the fuselage.",
        "An aircraft with a relatively short body compared to other members of the same family.",
        "An aircraft with a high-mounted wing design.",
        "An aircraft with a relatively low ground clearance.",
        "An aircraft with a uniform, cylindrical fuselage from nose to tail.",
        "An aircraft with a cockpit window design that includes six windows.",
        "An aircraft with a relatively small diameter of the engine nacelles.",
        "An aircraft with a landing gear configuration of two main wheels on each gear.",
        "An aircraft with a relatively small distance between the two engines."
    ],
    "A320": [
        "An aircraft with a single aisle and twin engines mounted under the wings.",
        "An aircraft with a rounded nose and a bulbous forehead.",
        "An aircraft with a tail cone that has a slight upward angle.",
        "An aircraft with a wingspan of approximately 36 meters.",
        "An aircraft with a length of approximately 37.6 meters.",
        "An aircraft with wingtip fences that are upward and downward pointed.",
        "An aircraft with a capacity of around 150 to 180 passengers in a two-class configuration.",
        "An aircraft with four cabin doors on each side.",
        "An aircraft with a circular cross-section fuselage.",
        "An aircraft with a cockpit window layout of two main windows and two small side windows.",
        "An aircraft with a high-mounted horizontal stabilizer on the tail.",
        "An aircraft with a maximum range of approximately 6,100 kilometers.",
        "An aircraft with a cruise speed of approximately 828 km/h.",
        "An aircraft with a distinctive 'Airbus' nose shape, which is more rounded than pointed.",
        "An aircraft with a relatively low ground clearance due to the placement of its engines.",
        "An aircraft with a uniform, cylindrical body from nose to tail.",
        "An aircraft with a landing gear configuration of two main wheels on each of the two main landing gear legs and two wheels on the nose gear.",
        "An aircraft with a flight deck designed for a two-person operation.",
        "An aircraft with a high degree of commonality with other Airbus aircraft, particularly the A319, A321, and A318.",
        "An aircraft with a digital fly-by-wire control system."
    ],
    "A321": [
        "An aircraft with a length of approximately 146 feet.",
        "An aircraft with a single aisle in the cabin.",
        "An aircraft with two engines mounted under the wings.",
        "An aircraft with a narrow-body fuselage.",
        "An aircraft with a distinctive 'Airbus' nose shape.",
        "An aircraft with a high-mounted tail.",
        "An aircraft with a seating capacity of up to 240 passengers.",
        "An aircraft with a range of approximately 3,700 nautical miles.",
        "An aircraft with a wingtip fence design on the end of its wings.",
        "An aircraft with a circular cross-section of the fuselage.",
        "An aircraft with a twin-wheel nose landing gear.",
        "An aircraft with four cabin doors on each side of the fuselage.",
        "An aircraft with a slightly swept-back wing design.",
        "An aircraft with a tail cone that has a small, round, 'bullet' shape.",
        "An aircraft with a cockpit window layout that is unique to Airbus.",
        "An aircraft with a high aspect ratio wing design for fuel efficiency.",
        "An aircraft with a relatively low ground clearance due to the under-wing engine placement.",
        "An aircraft with a uniform, cylindrical body from nose to tail.",
        "An aircraft with a relatively large vertical stabilizer compared to the overall size of the aircraft.",
        "An aircraft with a standard Airbus flight deck layout."
    ],
    "A330-200": [
        "An aircraft with a length of approximately 59 meters.",
        "An aircraft with a wingspan of about 60.3 meters.",
        "An aircraft with two engines mounted under the wings.",
        "An aircraft with a twin-aisle wide-body configuration.",
        "An aircraft with a circular fuselage cross-section.",
        "An aircraft with a slightly bulbous nose.",
        "An aircraft with a tail height of approximately 17.9 meters.",
        "An aircraft with a swept-back wing design.",
        "An aircraft with winglets at the end of each wing.",
        "An aircraft with a seating capacity of around 200-300 passengers.",
        "An aircraft with a range of approximately 13,450 kilometers.",
        "An aircraft with a T-tail configuration, where the horizontal stabilizer is mounted on top of the vertical stabilizer.",
        "An aircraft with a cockpit window layout of six panes, with two main panes and two smaller ones on each side.",
        "An aircraft with a double-wheel landing gear configuration.",
        "An aircraft with a typical cruise speed of Mach 0.82.",
        "An aircraft with a maximum takeoff weight of approximately 242 tonnes.",
        "An aircraft with a characteristic Airbus nose, which is more rounded and less pointed than other manufacturers.",
        "An aircraft with a four-door configuration on each side of the fuselage.",
        "An aircraft with a relatively low engine to ground clearance.",
        "An aircraft with a fuselage diameter of approximately 5.64 meters."
    ],
    "A330-300": [
        "An aircraft with a length of approximately 63.7 meters.",
        "An aircraft with a wingspan of about 60.3 meters.",
        "An aircraft with a tail height of approximately 16.8 meters.",
        "An aircraft with two engines mounted under the wings.",
        "An aircraft with a circular fuselage cross-section.",
        "An aircraft with a slightly bulbous nose.",
        "An aircraft with a twin-aisle cabin layout.",
        "An aircraft with a seating capacity of around 277 to 440 passengers.",
        "An aircraft with a swept-back wing design.",
        "An aircraft with winglets at the tip of the wings.",
        "An aircraft with a conventional tail design.",
        "An aircraft with a cockpit window layout of six panes.",
        "An aircraft with a noticeable underbelly fairing near the main landing gear.",
        "An aircraft with a main landing gear consisting of four wheels on each bogie.",
        "An aircraft with a noticeable 'Airbus' hump on the upper fuselage near the tail.",
        "An aircraft with a door layout of four on each side of the fuselage.",
        "An aircraft with a range of approximately 5,000 to 7,200 nautical miles.",
        "An aircraft with a cruising speed of around Mach 0.82.",
        "An aircraft with a distinctive Airbus A330-300 logo near the front of the fuselage.",
        "An aircraft with a maximum takeoff weight of approximately 242 tonnes."
    ],
    "A340-200": [
        "An aircraft with four engines mounted on pylons under the wings.",
        "An aircraft with a long, slender fuselage.",
        "An aircraft with a twin-aisle wide-body configuration.",
        "An aircraft with a low-wing design.",
        "An aircraft with a conventional tail unit featuring a single vertical stabilizer and rudder.",
        "An aircraft with a circular cross-section of the fuselage.",
        "An aircraft with a wing sweep of about 30 degrees.",
        "An aircraft with a noticeable hump at the front where the cockpit is located.",
        "An aircraft with a length of approximately 194 feet (59.4 meters).",
        "An aircraft with a wingspan of approximately 197 feet (60 meters).",
        "An aircraft with a range of around 7,500 nautical miles.",
        "An aircraft with a seating capacity of around 260 to 300 passengers in a typical three-class configuration.",
        "An aircraft with a noticeable 'Airbus' nose - a common feature in Airbus aircraft.",
        "An aircraft with wingtip fences on the end of its wings.",
        "An aircraft with a four-wheel bogie arrangement on each of its main landing gears.",
        "An aircraft with a glass cockpit and side-stick controllers.",
        "An aircraft with a high bypass ratio turbofan engines.",
        "An aircraft with a relatively low noise level compared to other aircraft of its size.",
        "An aircraft with a high level of fuel efficiency.",
        "An aircraft with a high level of passenger comfort due to its wide-body design."
    ],
    "A340-300": [
        "An aircraft with four engines, two under each wing.",
        "An aircraft with a long, slender fuselage.",
        "An aircraft with a twin-aisle cabin layout.",
        "An aircraft with a circular cross-section of the fuselage.",
        "An aircraft with a wing sweep of about 30 degrees.",
        "An aircraft with a T-tail configuration, where the horizontal stabilizer is mounted on top of the vertical stabilizer.",
        "An aircraft with a fully painted wingtip, unlike the winglets seen on some other aircraft.",
        "An aircraft with a nose that is relatively short and rounded.",
        "An aircraft with a cockpit window layout that consists of six panes.",
        "An aircraft with a main landing gear configuration of two bogies, each with four wheels.",
        "An aircraft with a length of approximately 63.7 meters.",
        "An aircraft with a wingspan of approximately 60.3 meters.",
        "An aircraft with a height of approximately 16.7 meters.",
        "An aircraft with a maximum takeoff weight of around 271,000 kilograms.",
        "An aircraft with a range of approximately 7,400 nautical miles.",
        "An aircraft with a cruising speed of around Mach 0.82.",
        "An aircraft with a seating capacity of around 295 passengers in a typical three-class layout.",
        "An aircraft with a logo light above the last window on each side of the fuselage.",
        "An aircraft with a small hump at the front of the fuselage, just above the cockpit windows.",
        "An aircraft with a relatively low ground clearance compared to other long-haul aircraft."
    ],
    "A340-500": [
        "An aircraft with four engines, two under each wing.",
        "An aircraft with a long, slender fuselage.",
        "An aircraft with a twin-aisle cabin layout.",
        "An aircraft with a circular cross-section of the fuselage.",
        "An aircraft with a wing sweep of about 30 degrees.",
        "An aircraft with a distinctive hump at the front of the aircraft, which is the cockpit.",
        "An aircraft with a tailplane that has a slight dihedral angle.",
        "An aircraft with a large vertical stabilizer and rudder.",
        "An aircraft with winglets at the end of each wing.",
        "An aircraft with a four-wheel bogie under each wing and a two-wheel nose gear.",
        "An aircraft with a length of approximately 68 meters.",
        "An aircraft with a wingspan of approximately 63.45 meters.",
        "An aircraft with a height of approximately 17.53 meters.",
        "An aircraft with a range of approximately 16,000 kilometers.",
        "An aircraft with a seating capacity of around 375 passengers in a two-class configuration.",
        "An aircraft with a maximum takeoff weight of approximately 380,000 kilograms.",
        "An aircraft with Rolls-Royce Trent 553/556 engines.",
        "An aircraft with a cruising speed of approximately 900 km/h.",
        "An aircraft with a service ceiling of approximately 41,000 feet.",
        "An aircraft with a distinctive Airbus nose shape, which is more rounded and bulbous than other manufacturers' aircraft."
    ],
    "A340-600": [
        "An aircraft with four engines mounted on underwing pylons.",
        "An aircraft with a long, slender fuselage, making it one of the longest passenger aircraft in the world.",
        "An aircraft with a twin-aisle cabin layout, also known as a wide-body aircraft.",
        "An aircraft with a distinctive 'hump' forward of the wings, which is the cockpit and first class section.",
        "An aircraft with a circular cross-section of the fuselage.",
        "An aircraft with a large, high tail fin and smaller horizontal stabilizers on either side of the tail.",
        "An aircraft with winglets at the tips of the wings, which are small, upward-curving structures.",
        "An aircraft with a four-wheel bogie under each wing and a two-wheel nose landing gear.",
        "An aircraft with a logo light on the tail fin, which illuminates the airline's logo in flight.",
        "An aircraft with passenger windows that are evenly spaced along the length of the fuselage.",
        "An aircraft with a door layout of four on each side of the aircraft, with the first one located just behind the cockpit.",
        "An aircraft with a smooth, unbroken line from the nose to the tail, without any sudden changes in height.",
        "An aircraft with a relatively low ground clearance, meaning the body of the aircraft is quite close to the ground.",
        "An aircraft with a cockpit window layout of six panes, with two main front windows and two smaller side windows on each side.",
        "An aircraft with the engines having a noticeable gap between them and the fuselage."
    ],
    "A380": [
        "An aircraft with four engines, two under each wing.",
        "An aircraft with a full-length double-deck, which is unique among commercial aircraft.",
        "An aircraft with a bulbous forward fuselage.",
        "An aircraft with a wingspan of approximately 261 feet.",
        "An aircraft with a tail height of approximately 79 feet.",
        "An aircraft with a distinctive curved, upward-sloping wingtip design.",
        "An aircraft with a maximum takeoff weight of over 1.2 million pounds.",
        "An aircraft with a total seating capacity between 525 and 853 passengers, depending on the configuration.",
        "An aircraft with a range of over 8,000 nautical miles.",
        "An aircraft with a distinctive \"hump\" at the front, but unlike the Boeing 747, this \"hump\" extends along the entire length of the fuselage.",
        "An aircraft with a large, circular logo on the tail fin.",
        "An aircraft with a cockpit located on the lower deck, which differentiates it from the Boeing 747 where the cockpit is on the upper deck.",
        "An aircraft with a relatively short and stubby landing gear compared to the overall size of the aircraft.",
        "An aircraft with a total of 16 cabin doors, eight on each side.",
        "An aircraft with a high-capacity cargo hold, capable of carrying substantial amounts of cargo in addition to passengers.",
        "An aircraft with a distinctive noise-reduction design, making it one of the quietest aircraft in the skies.",
        "An aircraft with a large, spacious interior, often featuring amenities such as bars, lounges, and duty-free shops.",
        "An aircraft with a unique wing design that includes a significant amount of wing flex during flight.",
        "An aircraft with a fuselage width of approximately 23.4 feet on the main deck and 19.4 feet on the upper deck.",
        "An aircraft with a total length of approximately 238 feet."
    ],
    "ATR-42": [
        "An aircraft with a high-wing, twin-turboprop design.",
        "An aircraft with a short, rounded fuselage.",
        "An aircraft with a T-tail configuration.",
        "An aircraft with two engines mounted under the wings.",
        "An aircraft with a length of approximately 74 feet.",
        "An aircraft with a wingspan of approximately 80 feet.",
        "An aircraft with a capacity of around 40-50 passengers.",
        "An aircraft with a cockpit that accommodates two crew members.",
        "An aircraft with a conventional landing gear with two main wheels and a nose wheel.",
        "An aircraft with a circular cross-section of the fuselage.",
        "An aircraft with a relatively low cruising speed, typically around 300 knots.",
        "An aircraft with a distinctive nose shape, which is pointed and slightly downward sloping.",
        "An aircraft with a relatively short range, typically around 1,000 nautical miles.",
        "An aircraft with a small number of cabin windows, typically around 20 on each side.",
        "An aircraft with propellers that have six blades each.",
        "An aircraft with a single aisle in the passenger cabin.",
        "An aircraft with a relatively low height, typically around 25 feet.",
        "An aircraft with a small cargo door at the rear of the fuselage.",
        "An aircraft with a relatively quiet operation due to its turboprop engines.",
        "An aircraft with a distinctive logo or livery of an airline that operates ATR-42s."
    ],
    "ATR-72": [
        "An aircraft with a high-wing, twin-engine turboprop design.",
        "An aircraft with a length of approximately 27.2 meters.",
        "An aircraft with a wingspan of approximately 27.1 meters.",
        "An aircraft with a T-tail configuration.",
        "An aircraft with a capacity of around 70-78 passengers.",
        "An aircraft with six-blade propellers.",
        "An aircraft with a rounded nose and cockpit windows.",
        "An aircraft with a fuselage that is cylindrical in shape.",
        "An aircraft with two Pratt & Whitney Canada PW100 engines.",
        "An aircraft with a landing gear configuration of two main wheels and a nose wheel.",
        "An aircraft with a maximum takeoff weight of around 23,000 kilograms.",
        "An aircraft with a cruising speed of approximately 510 km/h.",
        "An aircraft with a range of approximately 1,500 kilometers.",
        "An aircraft with a service ceiling of approximately 7,620 meters.",
        "An aircraft with a typical 2-2 seating configuration in the passenger cabin.",
        "An aircraft with a single aisle running down the center of the cabin.",
        "An aircraft with a rear-mounted galley and two lavatories.",
        "An aircraft with a cargo compartment located in the forward section of the aircraft.",
        "An aircraft with a distinctive 'ATR' logo on the tail."
    ],
    "An-12": [
        "An aircraft with four turboprop engines, two on each wing.",
        "An aircraft with a high-mounted wing design.",
        "An aircraft with a distinctive glass nose, which can be used for navigation and observation.",
        "An aircraft with a tail turret for defensive purposes.",
        "An aircraft with a rear cargo ramp that can open in flight for airdrops.",
        "An aircraft with a tail design that includes a high fin and rudder with a slightly swept back angle.",
        "An aircraft with a fuselage that is cylindrical and relatively long.",
        "An aircraft with a tricycle landing gear system.",
        "An aircraft with a blunt nose and a slightly humped appearance.",
        "An aircraft with a cockpit that is located forward of the wings and above the cargo area.",
        "An aircraft with a relatively large vertical stabilizer compared to the size of the aircraft.",
        "An aircraft with a clear 'greenhouse' style nose, which is a distinguishing feature.",
        "An aircraft with a wingspan that is almost equal to its length.",
        "An aircraft with a relatively low ground clearance, making it easier to load and unload cargo.",
        "An aircraft with a unique exhaust system where the exhaust from the engines is directed over the wings."
    ],
    "BAE 146-200": [
        "An aircraft with four jet engines mounted on the rear of the fuselage.",
        "An aircraft with a high-wing design, where the wings are mounted on top of the fuselage.",
        "An aircraft with a T-tail configuration, where the horizontal stabilizer is mounted on top of the vertical stabilizer.",
        "An aircraft with a short, stubby fuselage and a relatively wide body.",
        "An aircraft with a unique noise reduction system, visible as a large exhaust at the rear of each engine.",
        "An aircraft with a large, square-shaped tail.",
        "An aircraft with a relatively short landing gear.",
        "An aircraft with a capacity of around 85-100 passengers.",
        "An aircraft with a length of approximately 28.6 meters.",
        "An aircraft with a wingspan of approximately 26.2 meters.",
        "An aircraft with a distinctive 'double-bubble' fuselage design, giving it a rounded, bulbous appearance.",
        "An aircraft with a high-mounted wing, allowing for unobstructed cargo and passenger doors.",
        "An aircraft with a relatively low cruising speed compared to similar-sized jet aircraft.",
        "An aircraft with a large, square-shaped cargo door at the rear of the fuselage.",
        "An aircraft with a relatively quiet operation due to its unique engine design and noise suppression system.",
        "An aircraft with a short takeoff and landing capability, identifiable by its large, powerful flaps.",
        "An aircraft with a unique air brake design, visible as a large panel that extends upwards from the rear of the fuselage during landing.",
        "An aircraft with a relatively high-mounted cockpit, providing a good view for the pilots.",
        "An aircraft with a distinctive 'clean' wing design, with no engine pylons or fuel tanks disrupting the wing's shape.",
        "An aircraft with a relatively large distance between the front and rear landing gear, providing stability during takeoff and landing."
    ],
    "BAE 146-300": [
        "An aircraft with four engines mounted on the rear of the fuselage.",
        "An aircraft with a high-wing design, where the wings are attached to the top of the fuselage.",
        "An aircraft with a T-tail configuration, where the horizontal stabilizer is mounted on top of the vertical stabilizer.",
        "An aircraft with a short, stubby appearance due to its relatively short fuselage and large diameter.",
        "An aircraft with a unique noise reduction system, visible as a large exhaust at the rear of each engine.",
        "An aircraft with a large, square-shaped main cabin door located at the front of the aircraft.",
        "An aircraft with a total of six cabin doors, three on each side of the fuselage.",
        "An aircraft with a capacity of around 100 passengers, indicating a relatively small size for a commercial jet.",
        "An aircraft with a distinctive 'double-bubble' fuselage design, giving it a wide cross-section.",
        "An aircraft with a relatively high ground clearance, due to its tall landing gear.",
        "An aircraft with a lack of winglets or other wingtip devices.",
        "An aircraft with a relatively short range, typically used for regional flights.",
        "An aircraft with a high rate of climb, due to its powerful engines and light weight.",
        "An aircraft with a large, square-shaped cargo door at the rear of the fuselage.",
        "An aircraft with a relatively quiet operation, due to its unique engine design and noise reduction system."
    ],
    "BAE-125": [
        "An aircraft with a low-wing monoplane design.",
        "An aircraft with a T-tail configuration.",
        "An aircraft with two rear-mounted engines.",
        "An aircraft with a swept wing design.",
        "An aircraft with a circular cross-section fuselage.",
        "An aircraft with a length of approximately 15-21 meters, depending on the variant.",
        "An aircraft with a wingspan of approximately 14-16 meters, depending on the variant.",
        "An aircraft with a distinctive nose shape, being pointed and slightly drooped.",
        "An aircraft with a cockpit that has a large, four-piece windshield.",
        "An aircraft with a capacity for 2 crew members and typically 8-14 passengers, depending on the variant.",
        "An aircraft with a retractable tricycle landing gear.",
        "An aircraft with a high cruising speed, typically around 800 km/h.",
        "An aircraft with a range of approximately 3,000 kilometers, depending on the variant.",
        "An aircraft with a service ceiling of around 12,500 meters.",
        "An aircraft with a relatively short and wide body compared to its length.",
        "An aircraft with a small wing area relative to its size.",
        "An aircraft with a relatively large tailplane compared to its size.",
        "An aircraft with a distinctive engine nacelle design, being long and slim.",
        "An aircraft with a relatively high aspect ratio, indicating long, narrow wings.",
        "An aircraft with a relatively high wing loading, indicating a strong structure."
    ],
    "Beechcraft 1900": [
        "An aircraft with a T-tail configuration.",
        "An aircraft with two turboprop engines mounted on the wings.",
        "An aircraft with a high-wing design.",
        "An aircraft with a long, cylindrical fuselage.",
        "An aircraft with a large, distinctive vertical stabilizer.",
        "An aircraft with a retractable tricycle landing gear.",
        "An aircraft with a cockpit that seats two pilots.",
        "An aircraft with a capacity of 19 passengers in its standard configuration.",
        "An aircraft with a distinctive oval-shaped cabin cross-section.",
        "An aircraft with a relatively short nose.",
        "An aircraft with a length of approximately 17.6 meters.",
        "An aircraft with a wingspan of approximately 17.6 meters.",
        "An aircraft with a height of approximately 4.5 meters.",
        "An aircraft with a large cargo door at the rear of the fuselage.",
        "An aircraft with a relatively flat underside.",
        "An aircraft with a straight leading edge on the wings.",
        "An aircraft with a slight dihedral angle on the wings.",
        "An aircraft with four-bladed propellers.",
        "An aircraft with a single passenger door on the left side of the fuselage.",
        "An aircraft with a relatively small horizontal stabilizer compared to the vertical stabilizer."
    ],
    "Boeing 717": [
        "An aircraft with two engines mounted at the rear of the fuselage.",
        "An aircraft with a T-tail, where the horizontal stabilizer is mounted on top of the vertical stabilizer.",
        "An aircraft with a relatively short, stubby fuselage compared to other commercial jets.",
        "An aircraft with a single-aisle, narrow-body design.",
        "An aircraft with a cockpit windshield that has four panes of glass.",
        "An aircraft with a slightly pointed nose cone.",
        "An aircraft with a capacity of around 100-130 passengers.",
        "An aircraft with a wingspan of approximately 93 feet.",
        "An aircraft with a length of approximately 124 feet.",
        "An aircraft with a distinctive 'eyebrow' window above the main cockpit windows.",
        "An aircraft with a high-mounted wing design.",
        "An aircraft with a relatively low ground clearance.",
        "An aircraft with a circular cross-section of the fuselage.",
        "An aircraft with a relatively small diameter of the fuselage compared to other commercial jets.",
        "An aircraft with a total of five cabin doors, two at the front, two at the rear, and one over the wing.",
        "An aircraft with a maximum cruising speed of approximately 500 knots.",
        "An aircraft with a range of approximately 2,060 nautical miles.",
        "An aircraft with a service ceiling of approximately 37,000 feet.",
        "An aircraft with a distinctive Boeing logo on the tail."
    ],
    "C-130": [
        "An aircraft with four turboprop engines.",
        "An aircraft with a high wing design, where the wings are mounted above the fuselage.",
        "An aircraft with a distinctive T-tail, where the horizontal stabilizer is mounted on top of the vertical stabilizer.",
        "An aircraft with a rear loading ramp that can be opened in flight for airdrops.",
        "An aircraft with a boxy, straight fuselage that is wider at the front and tapers slightly towards the rear.",
        "An aircraft with a short, stubby nose and a cockpit with extensive window area.",
        "An aircraft with a rugged landing gear design for operations from unprepared surfaces.",
        "An aircraft with a relatively low cruising speed and short takeoff and landing capability.",
        "An aircraft with a large, bulbous radome under the nose for weather radar.",
        "An aircraft with a length of approximately 97 feet and a wingspan of approximately 132 feet.",
        "An aircraft with a distinctive sound produced by its four turboprop engines, often described as a growl or roar.",
        "An aircraft with a crew of three: two pilots and a loadmaster.",
        "An aircraft with a capacity to carry up to 92 passengers or 64 airborne troops.",
        "An aircraft with a capability to carry a wide variety of cargo, including vehicles and palletized equipment.",
        "An aircraft with a range of approximately 2,000 nautical miles with a standard payload.",
        "An aircraft with a service ceiling of approximately 33,000 feet.",
        "An aircraft with a maximum takeoff weight of approximately 155,000 pounds.",
        "An aircraft with a distinctive grey or green camouflage paint scheme, often used by military forces."
    ],
    "C-47": [
        "An aircraft with a low-wing monoplane design.",
        "An aircraft with two radial piston engines mounted on each wing.",
        "An aircraft with a tailwheel-type landing gear.",
        "An aircraft with a distinctive, rounded cockpit windshield.",
        "An aircraft with a fuselage that is cylindrical and tapers towards the rear.",
        "An aircraft with a tail unit featuring a single vertical stabilizer and rudder.",
        "An aircraft with rectangular-shaped wings.",
        "An aircraft with a length of approximately 19.6 meters and a wingspan of about 29.6 meters.",
        "An aircraft with a large, side-opening cargo door.",
        "An aircraft with a seating capacity for around 28 passengers.",
        "An aircraft with a cockpit designed for a two-person flight crew.",
        "An aircraft with a maximum speed of around 224 mph (360 km/h).",
        "An aircraft with a range of approximately 1,600 miles (2,600 km).",
        "An aircraft with a service ceiling of around 26,400 feet (8,050 m).",
        "An aircraft with a distinctive, protruding nose cone.",
        "An aircraft with a military green or silver color scheme, often seen in historical photos.",
        "An aircraft with a maximum takeoff weight of around 31,000 pounds (14,000 kg).",
        "An aircraft with a payload capacity of approximately 6,000 pounds (2,700 kg).",
        "An aircraft with a cruising speed of around 160 mph (260 km/h).",
        "An aircraft with a distinctive, iconic design that played a significant role in World War II."
    ],
    "CRJ-200": [
        "An aircraft with two engines mounted on the rear part of the fuselage.",
        "An aircraft with a T-tail configuration, where the horizontal stabilizer is mounted on top of the vertical stabilizer.",
        "An aircraft with a narrow, tube-like fuselage.",
        "An aircraft with a low-wing design, where the wings are attached at the bottom of the fuselage.",
        "An aircraft with a pointed nose and a relatively short body length.",
        "An aircraft with small, circular windows evenly spaced along the length of the fuselage.",
        "An aircraft with a single-aisle cabin layout, typically seating around 50 passengers.",
        "An aircraft with tricycle landing gear, with two main wheels retracting into the fuselage and a single nose wheel.",
        "An aircraft with winglets at the tips of the wings, which are small, upward-curving extensions.",
        "An aircraft with a relatively small size compared to other commercial jets.",
        "An aircraft with a cockpit windshield divided into four sections.",
        "An aircraft with a small, rounded tail cone at the rear end of the fuselage.",
        "An aircraft with no over-wing exits, but two doors at the front and rear of the aircraft.",
        "An aircraft with a high-mounted engine design, where the engines are attached to the rear fuselage and not the wings.",
        "An aircraft with a relatively short distance between the nose and the cockpit windows."
    ],
    "CRJ-700": [
        "An aircraft with a length of approximately 106 feet.",
        "An aircraft with a wingspan of about 76 feet.",
        "An aircraft with a T-tail configuration.",
        "An aircraft with two engines mounted on the rear fuselage.",
        "An aircraft with a narrow body design.",
        "An aircraft with a pointed nose and a sleek, streamlined design.",
        "An aircraft with a seating capacity of around 70 passengers.",
        "An aircraft with a single-aisle cabin layout.",
        "An aircraft with a low-wing design.",
        "An aircraft with a tricycle landing gear configuration.",
        "An aircraft with a relatively small size compared to other commercial jets.",
        "An aircraft with a circular cross-section of the fuselage.",
        "An aircraft with a cockpit window design that includes four main windows.",
        "An aircraft with a relatively short distance between the wings and tail.",
        "An aircraft with a small winglet at the tip of each wing.",
        "An aircraft with a high-speed cruise of Mach 0.78.",
        "An aircraft with a range of approximately 1,378 nautical miles.",
        "An aircraft with a service ceiling of 41,000 feet.",
        "An aircraft with a distinctive CRJ series design, which includes a long, slender fuselage and a T-tail."
    ],
    "CRJ-900": [
        "An aircraft with a length of approximately 36.4 meters.",
        "An aircraft with a wingspan of about 24.85 meters.",
        "An aircraft with a T-tail and rear-mounted engines.",
        "An aircraft with a narrow body and a single aisle.",
        "An aircraft with a pointed nose and a sleek, streamlined design.",
        "An aircraft with two engines mounted on the rear fuselage.",
        "An aircraft with a capacity of around 90 passengers.",
        "An aircraft with a high-wing design, where wings are attached to the top of the fuselage.",
        "An aircraft with a tricycle landing gear configuration.",
        "An aircraft with a slightly swept wing design.",
        "An aircraft with a small hump at the front of the fuselage, just behind the cockpit.",
        "An aircraft with a relatively low ground clearance.",
        "An aircraft with a cockpit window design that includes four main windows and two smaller ones below.",
        "An aircraft with a small winglet at the tip of each wing.",
        "An aircraft with a circular cross-section of the fuselage.",
        "An aircraft with a relatively short distance between the wings and the tail.",
        "An aircraft with a slim and elongated fuselage.",
        "An aircraft with a small horizontal stabilizer located at the top of the tail.",
        "An aircraft with a relatively large vertical stabilizer compared to the size of the aircraft.",
        "An aircraft with a door configuration of one at the front and one over the wing on each side."
    ],
    "Cessna 172": [
        "An aircraft with a high-wing monoplane design.",
        "An aircraft with a single propeller at the front.",
        "An aircraft with a tricycle landing gear.",
        "An aircraft with a rounded tail and stabilizers.",
        "An aircraft with a four-seat, single-engine configuration.",
        "An aircraft with a clear, bubble-like cockpit canopy.",
        "An aircraft with a relatively small size compared to commercial jets.",
        "An aircraft with a fixed-pitch propeller.",
        "An aircraft with a rectangular wing shape.",
        "An aircraft with a small, circular exhaust port on the right side.",
        "An aircraft with a single door on the passenger side, and a smaller baggage door behind it.",
        "An aircraft with a straight, un-swept wing design.",
        "An aircraft with a small, rounded vertical stabilizer.",
        "An aircraft with a horizontal stabilizer located at the top of the tail section.",
        "An aircraft with a relatively short nose.",
        "An aircraft with a cockpit that offers panoramic visibility.",
        "An aircraft with a simple, uncluttered instrument panel.",
        "An aircraft with a yoke rather than a stick for control.",
        "An aircraft with a white or light-colored paint job, often with a stripe or other simple design elements.",
        "An aircraft with a propeller that is directly connected to the engine, without a reduction gear."
    ],
    "Cessna 208": [
        "An aircraft with a single turboprop engine mounted in the nose.",
        "An aircraft with a high-wing design, meaning the wings are attached to the top of the fuselage.",
        "An aircraft with a fixed tricycle landing gear.",
        "An aircraft with a large, boxy fuselage that can accommodate up to 14 passengers.",
        "An aircraft with a T-tail, where the horizontal stabilizer is mounted on top of the vertical stabilizer.",
        "An aircraft with a large cargo door on the left side of the fuselage.",
        "An aircraft with a relatively short nose, compared to the overall length of the aircraft.",
        "An aircraft with a cockpit that has large windows, providing a good view for the pilots.",
        "An aircraft with a propeller that has three blades.",
        "An aircraft with a relatively flat bottom, which is a characteristic of many cargo planes.",
        "An aircraft with a small dorsal fin extending from the top of the fuselage to the tail.",
        "An aircraft with rectangular-shaped wings, which are a common feature of Cessna aircraft.",
        "An aircraft with exhaust pipes that are visible on the right side of the engine cowling.",
        "An aircraft with a relatively long and wide cabin, which is a characteristic of many utility aircraft.",
        "An aircraft with a single door for passengers, located on the right side of the fuselage.",
        "An aircraft with a small window at the rear of the cabin, which is a characteristic of the Cessna 208."
    ],
    "Cessna 525": [
        "An aircraft with a low-wing monoplane design.",
        "An aircraft with a T-tail configuration.",
        "An aircraft with a retractable tricycle landing gear.",
        "An aircraft with two rear-mounted turbofan engines.",
        "An aircraft with a pressurized cabin that can accommodate up to eight passengers.",
        "An aircraft with a length of approximately 42.9 feet (13.1 meters).",
        "An aircraft with a wingspan of about 43.9 feet (13.4 meters).",
        "An aircraft with a height of approximately 13.8 feet (4.2 meters).",
        "An aircraft with a circular cross-section fuselage.",
        "An aircraft with a swept wing design.",
        "An aircraft with a cockpit that accommodates two crew members.",
        "An aircraft with a single door on the left side of the fuselage for passenger entry.",
        "An aircraft with a small baggage compartment door located on the right side of the fuselage.",
        "An aircraft with a relatively flat nose and straight-edged engine nacelles.",
        "An aircraft with a maximum cruising speed of approximately 414 knots.",
        "An aircraft with a range of about 1,300 nautical miles.",
        "An aircraft with a service ceiling of approximately 41,000 feet.",
        "An aircraft with a distinctive 'Cessna' logo on the tail."
    ],
    "Cessna 560": [
        "An aircraft with a low-wing monoplane design.",
        "An aircraft with a T-tail configuration.",
        "An aircraft with two rear-mounted Pratt & Whitney Canada JT15D-5D turbofan engines.",
        "An aircraft with a retractable tricycle landing gear.",
        "An aircraft with a pressurized cabin that can accommodate up to 9 passengers.",
        "An aircraft with a length of approximately 16 meters.",
        "An aircraft with a wingspan of approximately 17.1 meters.",
        "An aircraft with a height of approximately 4.6 meters.",
        "An aircraft with a swept-back wing design.",
        "An aircraft with a circular cross-section fuselage.",
        "An aircraft with a cockpit that accommodates two crew members.",
        "An aircraft with a maximum cruising speed of 431 knots.",
        "An aircraft with a range of approximately 2,100 nautical miles.",
        "An aircraft with a service ceiling of 45,000 feet.",
        "An aircraft with a distinctive oval-shaped cabin windows.",
        "An aircraft with a relatively short nose.",
        "An aircraft with a small dorsal fin extending from the top of the tail to the fuselage.",
        "An aircraft with a relatively flat underside.",
        "An aircraft with a high-mounted horizontal stabilizer on the tail.",
        "An aircraft with a relatively large vertical stabilizer."
    ],
    "Challenger 600": [
        "An aircraft with a low swept-wing design.",
        "An aircraft with a T-tail configuration.",
        "An aircraft with two rear fuselage mounted engines.",
        "An aircraft with a length of approximately 68.2 feet (20.8 meters).",
        "An aircraft with a wingspan of approximately 64.3 feet (19.6 meters).",
        "An aircraft with a height of approximately 20.7 feet (6.3 meters).",
        "An aircraft with a large, spacious cabin, typically configured for 9-12 passengers.",
        "An aircraft with a distinctive round fuselage cross-section.",
        "An aircraft with a range of approximately 3,100 nautical miles.",
        "An aircraft with a cruising speed of approximately 528 mph (850 km/h).",
        "An aircraft with a maximum takeoff weight of approximately 41,250 lbs (18,727 kg).",
        "An aircraft with a distinctive nose shape, often described as 'pointed'.",
        "An aircraft with a large, rounded cockpit window design.",
        "An aircraft with a retractable tricycle landing gear.",
        "An aircraft with a high-mounted horizontal stabilizer on the tail.",
        "An aircraft with a vertical stabilizer that has a slight forward tilt at the top.",
        "An aircraft with a relatively short distance between the wing and the tail.",
        "An aircraft with a flat bottomed fuselage.",
        "An aircraft with a relatively large distance between the engines and the tail.",
        "An aircraft with a noticeable lack of winglets or wingtip devices."
    ],
    "DC-10": [
        "An aircraft with three engines, one mounted at the base of the vertical stabilizer and the other two under the wings.",
        "An aircraft with a double-aisle wide-body fuselage.",
        "An aircraft with a distinctive \"kink\" in the leading edge of the tail fin.",
        "An aircraft with a horizontal stabilizer mounted on top of the vertical stabilizer, forming a T-tail.",
        "An aircraft with a large cargo door at the rear of the fuselage.",
        "An aircraft with a slightly swept-back wing design.",
        "An aircraft with a cockpit window arrangement of six panes, with two additional small windows below the main front windows.",
        "An aircraft with a landing gear configuration of two main landing gears, each with four wheels, and a two-wheel nose gear.",
        "An aircraft with a circular intake for the tail engine, located above the fuselage.",
        "An aircraft with a relatively short and wide body compared to other wide-body jets.",
        "An aircraft with a noticeable bulge at the front of the aircraft, where the cockpit is located.",
        "An aircraft with a high-mounted horizontal stabilizer, which is above the level of the fuselage top.",
        "An aircraft with a pair of rear-mounted underwing engines that are slightly angled outward.",
        "An aircraft with a lack of winglets on the wingtips.",
        "An aircraft with a relatively flat underside of the fuselage."
    ],
    "DC-3": [
        "An aircraft with a low-wing monoplane design.",
        "An aircraft with two radial piston engines, one on each wing.",
        "An aircraft with a tailwheel-type landing gear.",
        "An aircraft with a distinctive, rounded fuselage.",
        "An aircraft with a twin tail configuration.",
        "An aircraft with a cockpit that accommodates two crew members.",
        "An aircraft with a length of approximately 64 feet and a wingspan of 95 feet.",
        "An aircraft with a distinctive nose, often described as \"dolphin-shaped\".",
        "An aircraft with a capacity to carry 21 to 32 passengers.",
        "An aircraft with a large, square-shaped cargo door on the left side.",
        "An aircraft with a metal construction, primarily aluminum.",
        "An aircraft with a cruising speed of around 207 mph.",
        "An aircraft with a range of approximately 1,500 miles.",
        "An aircraft with three-bladed propellers.",
        "An aircraft with a maximum takeoff weight of around 26,900 pounds.",
        "An aircraft with a service ceiling of approximately 23,200 feet.",
        "An aircraft with a distinctive, streamlined shape for its era.",
        "An aircraft with a relatively short, stout appearance.",
        "An aircraft with a tricycle landing gear in some modified versions.",
        "An aircraft with a large, circular exhaust port on each engine."
    ],
    "DC-6": [
        "An aircraft with four piston engines, two on each wing.",
        "An aircraft with a round, bulbous nose.",
        "An aircraft with a tail that has a single vertical stabilizer and horizontal stabilizers located at the base of the tail.",
        "An aircraft with a long, cylindrical fuselage.",
        "An aircraft with a high-wing design, where the wings are attached at the top of the fuselage.",
        "An aircraft with a tricycle landing gear configuration, with a single wheel on each of the two main gears and the nose gear.",
        "An aircraft with propellers that have three blades.",
        "An aircraft with oval windows running along the length of the fuselage.",
        "An aircraft with a cockpit that has a large number of windows, including side windows.",
        "An aircraft with exhaust stacks protruding from the nacelles, one for each engine.",
        "An aircraft with a relatively straight leading edge on the wing.",
        "An aircraft with a wing that tapers slightly towards the tip.",
        "An aircraft with a noticeable dihedral angle, meaning the wings are angled upward from the root to the tip.",
        "An aircraft with a cockpit located at the front of the fuselage, just above the nose gear.",
        "An aircraft with a silver, unpainted finish, which was common for DC-6 aircraft.",
        "An aircraft with a length of about 100-105 feet and a wingspan of about 117-118 feet, which are the typical dimensions for a DC-6."
    ],
    "DC-8": [
        "An aircraft with four engines mounted on underwing pylons.",
        "An aircraft with a narrow-body, single-aisle cabin.",
        "An aircraft with a pointed nose and a cockpit window layout of six panes.",
        "An aircraft with a T-tail, where the horizontal stabilizer is mounted on top of the vertical stabilizer.",
        "An aircraft with a rear-mounted airstair door.",
        "An aircraft with a long, cylindrical fuselage.",
        "An aircraft with a relatively low ground clearance, with engines close to the ground.",
        "An aircraft with a clean, uncluttered undercarriage with four-wheel bogies.",
        "An aircraft with a slight upward angle at the end of the wings when viewed from the front or back.",
        "An aircraft with a noticeable 'kink' in the leading edge of the wing, near the fuselage.",
        "An aircraft with a small dorsal fin extending from the top of the fuselage to the tail.",
        "An aircraft with a lack of winglets or other modern aerodynamic features on the wings.",
        "An aircraft with a relatively long and thin body compared to its overall size.",
        "An aircraft with a four-window layout on each side of the cockpit.",
        "An aircraft with a single passenger door on the left side of the front fuselage."
    ],
    "DC-9-30": [
        "An aircraft with two rear-mounted engines.",
        "An aircraft with a T-tail configuration, where the tailplane is mounted on top of the fin.",
        "An aircraft with a narrow-body fuselage design.",
        "An aircraft with a length of approximately 119 feet (36.4 meters).",
        "An aircraft with a wingspan of about 93 feet (28.5 meters).",
        "An aircraft with a single aisle in the cabin.",
        "An aircraft with five-abreast seating in the main cabin.",
        "An aircraft with a pointed nose and a relatively short fuselage.",
        "An aircraft with a capacity of around 115 passengers.",
        "An aircraft with a range of approximately 1,500 nautical miles.",
        "An aircraft with a cruising speed of about 490 knots.",
        "An aircraft with a distinctive 'eyebrow' window above the main cockpit windows.",
        "An aircraft with a low-wing configuration.",
        "An aircraft with a relatively short landing gear.",
        "An aircraft with a clean, uncluttered under-wing area due to the rear-mounted engines.",
        "An aircraft with a small dorsal fin extending from the top of the tail towards the main body.",
        "An aircraft with a relatively small horizontal stabilizer compared to the vertical stabilizer.",
        "An aircraft with a lack of winglets or wingtip devices.",
        "An aircraft with a relatively straight leading edge of the wing.",
        "An aircraft with a noticeable dihedral angle, where the wings are angled upward from the root to the tip."
    ],
    "DH-82": [
        "An aircraft with a biplane design, meaning it has two wings stacked one above the other.",
        "An aircraft with a distinct open cockpit design, where the pilot and passenger sit in separate compartments.",
        "An aircraft with a fixed tailwheel undercarriage, which means the small wheel is located at the rear of the aircraft.",
        "An aircraft with a single propeller at the front.",
        "An aircraft with a fuselage that is narrow and elongated.",
        "An aircraft with a distinctive hump-shaped upper wing, which is a characteristic feature of the DH-82.",
        "An aircraft with ailerons only on the upper wings.",
        "An aircraft with a rudder that extends above and below the fuselage.",
        "An aircraft with a relatively small size, as the DH-82 is not a large aircraft.",
        "An aircraft with a wooden construction, which gives it a unique appearance compared to metal aircraft.",
        "An aircraft with a distinctive engine cowling, which partially covers the engine at the front of the aircraft.",
        "An aircraft with a relatively simple design, as the DH-82 was designed for training purposes and thus lacks the complexity of some other aircraft.",
        "An aircraft with a distinctive tail design, with the horizontal stabilizer located halfway up the vertical stabilizer.",
        "An aircraft with a unique exhaust system, which is located on the right side of the aircraft and extends back towards the tail.",
        "An aircraft with a fuel tank located in the upper wing, which is a unique feature of the DH-82.",
        "An aircraft with a distinctive rigging system, with wires running between the upper and lower wings and the fuselage to provide structural support."
    ],
    "DHC-1": [
        "An aircraft with a low-wing monoplane design.",
        "An aircraft with a fixed conventional landing gear.",
        "An aircraft with a single engine mounted in the nose.",
        "An aircraft with a two-seat tandem cockpit.",
        "An aircraft with a fuselage that is slender and elongated.",
        "An aircraft with a tailwheel-type landing gear.",
        "An aircraft with a clear canopy covering the cockpit.",
        "An aircraft with a propeller in the front.",
        "An aircraft with a tailplane that has a single vertical stabilizer.",
        "An aircraft with wings that have a slight dihedral angle.",
        "An aircraft with a cockpit that has dual controls.",
        "An aircraft with a metal airframe covered in fabric.",
        "An aircraft with a relatively small size compared to commercial planes.",
        "An aircraft with ailerons that cover almost the entire trailing edge of the wing.",
        "An aircraft with a relatively short nose.",
        "An aircraft with exhaust pipes protruding from the lower side of the engine cowling.",
        "An aircraft with a rounded rudder at the tail end.",
        "An aircraft with a cockpit that is positioned towards the front of the fuselage.",
        "An aircraft with a propeller that has two blades.",
        "An aircraft with a small wheel located at the tail end."
    ],
    "DHC-6": [
        "An aircraft with a high-wing configuration.",
        "An aircraft with twin turboprop engines mounted on the wings.",
        "An aircraft with a short, stubby fuselage.",
        "An aircraft with a T-tail, where the horizontal stabilizer is mounted on top of the vertical stabilizer.",
        "An aircraft with a tricycle landing gear.",
        "An aircraft with a rear-loading ramp door.",
        "An aircraft with a cockpit that has a wrap-around windshield for improved visibility.",
        "An aircraft with a capacity to seat 19 passengers.",
        "An aircraft with the ability to take off and land on short runways.",
        "An aircraft with the capability to operate from unprepared surfaces like grass or gravel.",
        "An aircraft with a distinctive nose-down attitude when on the ground.",
        "An aircraft with large, rectangular windows along the length of the fuselage.",
        "An aircraft with a relatively slow cruising speed compared to similar-sized aircraft.",
        "An aircraft with a high level of noise in the cabin due to the proximity of the engines to the cabin.",
        "An aircraft with a reputation for reliability and versatility, often used in remote areas."
    ],
    "DHC-8-100": [
        "An aircraft with a high-wing, twin-turboprop configuration.",
        "An aircraft with a T-tail design.",
        "An aircraft with a length of approximately 73 feet.",
        "An aircraft with a wingspan of about 85 feet.",
        "An aircraft with a short, stubby fuselage.",
        "An aircraft with a seating capacity of around 37 passengers.",
        "An aircraft with a distinctive nose-down attitude when on the ground.",
        "An aircraft with two Pratt & Whitney Canada PW120A engines.",
        "An aircraft with a four-bladed propeller on each engine.",
        "An aircraft with a retractable tricycle landing gear.",
        "An aircraft with a square-shaped tail cone.",
        "An aircraft with a cockpit that accommodates two crew members.",
        "An aircraft with a single passenger door located at the front, on the left side.",
        "An aircraft with a cargo door located at the rear, on the right side.",
        "An aircraft with a maximum cruising speed of approximately 310 mph.",
        "An aircraft with a range of about 1,200 miles.",
        "An aircraft with a service ceiling of approximately 25,000 feet.",
        "An aircraft with a distinctive noise signature due to its turboprop engines.",
        "An aircraft with a relatively high aspect ratio wing, which is straight and un-swept.",
        "An aircraft with a relatively large vertical stabilizer compared to its overall size."
    ],
    "DHC-8-300": [
        "An aircraft with a high-wing, twin-turboprop configuration.",
        "An aircraft with a T-tail design.",
        "An aircraft with a length of approximately 26 meters.",
        "An aircraft with a wingspan of approximately 27.4 meters.",
        "An aircraft with a capacity to seat between 50 to 56 passengers.",
        "An aircraft with a short, stubby fuselage.",
        "An aircraft with two Pratt & Whitney Canada PW123 engines.",
        "An aircraft with a tricycle landing gear.",
        "An aircraft with a noticeable elongation compared to its predecessor models.",
        "An aircraft with a four-bladed propeller on each engine.",
        "An aircraft with a cruising speed of approximately 528 km/h.",
        "An aircraft with a range of approximately 2,000 kilometers.",
        "An aircraft with a service ceiling of approximately 25,000 feet.",
        "An aircraft with a rectangular cabin window design.",
        "An aircraft with a cockpit that accommodates two crew members.",
        "An aircraft with a rear-mounted lavatory and a forward galley.",
        "An aircraft with a single passenger aisle.",
        "An aircraft with a relatively low ground clearance.",
        "An aircraft with a distinctive noise-reduction feature known as the 'Q-Tip' propeller design.",
        "An aircraft with a relatively high aspect ratio wing, which is beneficial for fuel efficiency."
    ],
    "DR-400": [
        "An aircraft with a low-wing monoplane design.",
        "An aircraft with a tricycle landing gear.",
        "An aircraft with a distinctive cranked wing design.",
        "An aircraft with a large, clear canopy that extends over the top of the fuselage.",
        "An aircraft with a single propeller at the front.",
        "An aircraft with a fuselage that is largely constructed of wood.",
        "An aircraft with a T-tail configuration.",
        "An aircraft with a four-seat cabin.",
        "An aircraft with ailerons that are located at the wing tips.",
        "An aircraft with a wing that has a significant dihedral angle on the outer panels.",
        "An aircraft with a rear window behind the rear seats.",
        "An aircraft with a relatively long nose.",
        "An aircraft with a rectangular-shaped vertical stabilizer.",
        "An aircraft with a horizontal stabilizer located at the top of the vertical stabilizer.",
        "An aircraft with a single engine located in the nose.",
        "An aircraft with a relatively wide cabin for its size.",
        "An aircraft with a high visibility cockpit due to its large canopy.",
        "An aircraft with a relatively short landing gear.",
        "An aircraft with a wing that has a constant chord and no sweep.",
        "An aircraft with a propeller that is typically two-bladed."
    ],
    "Dornier 328": [
        "An aircraft with a high-wing configuration.",
        "An aircraft with a T-tail design.",
        "An aircraft with two turboprop engines mounted on the wings.",
        "An aircraft with a short, stubby fuselage.",
        "An aircraft with a large, rounded nose.",
        "An aircraft with a tricycle landing gear.",
        "An aircraft with a capacity of approximately 30 passengers.",
        "An aircraft with a distinctive, large vertical stabilizer.",
        "An aircraft with a cockpit that has a four-window arrangement.",
        "An aircraft with a relatively short wingspan compared to its body length.",
        "An aircraft with a unique engine design where the propellers are located at the front of the engine nacelles.",
        "An aircraft with a relatively flat underside of the fuselage.",
        "An aircraft with a noticeable gap between the fuselage and the wing.",
        "An aircraft with a unique wing design that tapers towards the tip.",
        "An aircraft with a relatively large horizontal stabilizer compared to its vertical stabilizer.",
        "An aircraft with a unique exhaust design at the rear of the engine nacelles.",
        "An aircraft with a relatively high ground clearance.",
        "An aircraft with a unique door design located at the front of the aircraft.",
        "An aircraft with a unique window arrangement with larger windows at the front and smaller ones at the rear.",
        "An aircraft with a unique tail design where the horizontal stabilizers are located at the top of the vertical stabilizer."
    ],
    "E-170": [
        "An aircraft with a length of approximately 29.9 meters.",
        "An aircraft with a wingspan of about 26 meters.",
        "An aircraft with a height of roughly 9.67 meters.",
        "An aircraft with two underwing-mounted engines.",
        "An aircraft with a T-tail configuration.",
        "An aircraft with a low-wing design.",
        "An aircraft with a narrow-body fuselage.",
        "An aircraft with a seating capacity of around 70-80 passengers in a typical two-class configuration.",
        "An aircraft with a cockpit window design that includes four main windows with a unique shape.",
        "An aircraft with a relatively short, stubby appearance compared to other regional jets.",
        "An aircraft with a single aisle in the passenger cabin.",
        "An aircraft with a total of four cabin doors, two at the front and two at the rear.",
        "An aircraft with a relatively large distance between the nose landing gear and the main landing gear.",
        "An aircraft with a circular cross-section of the fuselage.",
        "An aircraft with winglets at the tip of the wings.",
        "An aircraft with a smooth nose design, lacking any significant protrusions or bumps.",
        "An aircraft with a relatively small diameter of the jet engines.",
        "An aircraft with a high-mounted horizontal stabilizer on the tail.",
        "An aircraft with a relatively short distance between the two engines.",
        "An aircraft with a noticeable upward angle of the wings when viewed from the front or rear."
    ],
    "E-190": [
        "An aircraft with a length of approximately 36.24 meters.",
        "An aircraft with a wingspan of about 28.72 meters.",
        "An aircraft with a height of roughly 10.57 meters.",
        "An aircraft with two underwing-mounted engines.",
        "An aircraft with a T-tail configuration.",
        "An aircraft with a narrow-body fuselage.",
        "An aircraft with a twin-aisle cabin layout.",
        "An aircraft with a seating capacity of around 100 passengers in a two-class configuration.",
        "An aircraft with a cockpit window layout of four panes per side, with the lower two significantly larger than the upper two.",
        "An aircraft with a relatively low nose gear compared to the main landing gear.",
        "An aircraft with a slightly swept-back wing design.",
        "An aircraft with a circular cross-section of the fuselage.",
        "An aircraft with a single-aisle cabin layout.",
        "An aircraft with a relatively short distance between the trailing edge of the wing and the tail.",
        "An aircraft with a high-wing design, where the wings are mounted on top of the fuselage.",
        "An aircraft with a small winglet at the tip of each wing.",
        "An aircraft with a relatively large distance between the two engines.",
        "An aircraft with a relatively small diameter of the engines compared to the fuselage.",
        "An aircraft with a relatively large distance between the ground and the bottom of the fuselage.",
        "An aircraft with a relatively short distance between the nose and the cockpit windows."
    ],
    "E-195": [
        "An aircraft with a length of approximately 38.65 meters.",
        "An aircraft with a wingspan of about 28.72 meters.",
        "An aircraft with a height of approximately 10.55 meters.",
        "An aircraft with two underwing-mounted turbofan engines.",
        "An aircraft with a T-tail configuration, where the tailplane is mounted on top of the fin.",
        "An aircraft with a low-wing monoplane design.",
        "An aircraft with a narrow-body fuselage that typically seats four passengers in a row (two on each side of the aisle).",
        "An aircraft with a slightly pointed nose and a rounded tail.",
        "An aircraft with a large, circular engine nacelle.",
        "An aircraft with a tricycle landing gear configuration.",
        "An aircraft with a capacity of around 100-124 passengers.",
        "An aircraft with a cockpit that has a large windshield divided into four panels.",
        "An aircraft with a relatively short distance between the wings and the tail.",
        "An aircraft with a smooth, streamlined shape and a modern appearance.",
        "An aircraft with winglets at the tips of the wings for improved aerodynamics.",
        "An aircraft with a single aisle in the passenger cabin.",
        "An aircraft with a relatively high cruising speed of approximately 870 km/h.",
        "An aircraft with a range of around 3,704 kilometers.",
        "An aircraft with a service ceiling of approximately 12,500 meters.",
        "An aircraft with a relatively quiet operation due to its high-bypass ratio turbofan engines."
    ],
    "EMB-120": [
        "An aircraft with a low-wing monoplane design.",
        "An aircraft with two turboprop engines mounted on the wings.",
        "An aircraft with a T-tail configuration.",
        "An aircraft with a retractable tricycle landing gear.",
        "An aircraft with a length of approximately 20 meters.",
        "An aircraft with a wingspan of approximately 19.78 meters.",
        "An aircraft with a capacity to carry up to 30 passengers.",
        "An aircraft with a cockpit designed for two crew members.",
        "An aircraft with a circular fuselage cross-section.",
        "An aircraft with a pointed nose and a slightly sloping forehead.",
        "An aircraft with a relatively short and stubby body compared to its wingspan.",
        "An aircraft with a maximum cruising speed of approximately 298 knots.",
        "An aircraft with a range of approximately 1,575 nautical miles.",
        "An aircraft with Pratt & Whitney Canada PW118/118A/118B engines.",
        "An aircraft with a service ceiling of approximately 32,000 feet.",
        "An aircraft with a distinctive exhaust port on the side of each engine.",
        "An aircraft with a relatively small size compared to commercial jet airliners.",
        "An aircraft with a high-mounted horizontal stabilizer on the tail.",
        "An aircraft with a single aisle in the passenger cabin.",
        "An aircraft with a relatively large vertical stabilizer compared to its overall size."
    ],
    "ERJ 135": [
        "An aircraft with a length of approximately 26.33 meters.",
        "An aircraft with a wingspan of about 20.04 meters.",
        "An aircraft with a T-tail configuration.",
        "An aircraft with two rear-mounted turbofan engines.",
        "An aircraft with a narrow, tubular fuselage.",
        "An aircraft with a low-wing design.",
        "An aircraft with a seating capacity of around 37 passengers.",
        "An aircraft with a cockpit designed for two crew members.",
        "An aircraft with a swept-wing design.",
        "An aircraft with a tricycle landing gear configuration.",
        "An aircraft with a high-speed cruise of Mach 0.78.",
        "An aircraft with a range of approximately 1,750 nautical miles.",
        "An aircraft with a service ceiling of 37,000 feet.",
        "An aircraft with a single aisle and 2-1 seating configuration in the passenger cabin.",
        "An aircraft with a small, rounded nose.",
        "An aircraft with a relatively short body compared to other regional jets.",
        "An aircraft with a small number of windows, typically around 16 on each side.",
        "An aircraft with a relatively small diameter of the fuselage, typically around 2 meters.",
        "An aircraft with a high aspect ratio wing, which is long and narrow.",
        "An aircraft with a relatively small horizontal stabilizer located at the top of the vertical stabilizer."
    ],
    "ERJ 145": [
        "An aircraft with a long, narrow fuselage and a T-tail.",
        "An aircraft with two engines mounted on the rear of the fuselage.",
        "An aircraft with a low-wing design.",
        "An aircraft with a pointed nose and a slightly swept wing design.",
        "An aircraft with a capacity of around 50 passengers.",
        "An aircraft with a single aisle and a 2-1 seating configuration.",
        "An aircraft with a length of approximately 98 feet.",
        "An aircraft with a wingspan of approximately 66 feet.",
        "An aircraft with a height of approximately 22 feet.",
        "An aircraft with a small, circular cross-section of the fuselage.",
        "An aircraft with a tricycle landing gear configuration.",
        "An aircraft with a relatively high cruising speed of around 833 km/h.",
        "An aircraft with a range of approximately 2,870 kilometers.",
        "An aircraft with a small number of cabin windows, typically around 22 on each side.",
        "An aircraft with a distinctive 'ERJ 145' marking near the front of the fuselage.",
        "An aircraft with a relatively high tail, due to its T-tail design.",
        "An aircraft with a small, rounded tail cone.",
        "An aircraft with a relatively flat underside of the fuselage.",
        "An aircraft with a cockpit window design that includes a distinctive 'eyebrow' window above the main windows.",
        "An aircraft with a relatively high wing aspect ratio, indicating efficient cruise performance."
    ],
    "Embraer Legacy 600": [
        "An aircraft with a low-wing monoplane design.",
        "An aircraft with a T-tail configuration.",
        "An aircraft with two rear-mounted Rolls-Royce AE 3007/A1P turbofan engines.",
        "An aircraft with a length of approximately 26.33 meters.",
        "An aircraft with a wingspan of approximately 21.17 meters.",
        "An aircraft with a height of approximately 6.76 meters.",
        "An aircraft with a swept wing design.",
        "An aircraft with a circular cross-section fuselage.",
        "An aircraft with a winglet on each wing tip.",
        "An aircraft with a capacity to carry up to 13 passengers in its standard configuration.",
        "An aircraft with a cockpit designed for two crew members.",
        "An aircraft with a range of approximately 3,250 nautical miles.",
        "An aircraft with a maximum cruising speed of approximately 834 km/h.",
        "An aircraft with a retractable tricycle landing gear.",
        "An aircraft with a large, spacious cabin, often visible through multiple windows on each side.",
        "An aircraft with a door located at the front left side of the fuselage.",
        "An aircraft with a relatively short nose and a slightly bulbous forehead.",
        "An aircraft with a high-mounted horizontal stabilizer on the tail.",
        "An aircraft with a small ventral fin at the base of the tail."
    ],
    "Eurofighter Typhoon": [
        "An aircraft with a twin-engine, delta wing design.",
        "An aircraft with canards, small forward wings, located in front of the main wings.",
        "An aircraft with a twin tail fin configuration.",
        "An aircraft with a bubble canopy for increased visibility.",
        "An aircraft with a sharp nose cone, indicative of its radar system.",
        "An aircraft with a trapezoidal wing shape.",
        "An aircraft with two rectangular air intakes on either side of the fuselage.",
        "An aircraft with a noticeable cockpit hump, giving it a distinctive profile.",
        "An aircraft with a relatively short and wide fuselage.",
        "An aircraft with a single pilot seat in most variants.",
        "An aircraft with a high-mounted wing design.",
        "An aircraft with a noticeable lack of external weapons pylons, as it carries its weapons internally.",
        "An aircraft with a flat underside, with no protruding parts.",
        "An aircraft with a sleek, streamlined design for high-speed performance.",
        "An aircraft with a noticeable lack of wingtip devices like winglets or raked wingtips.",
        "An aircraft with a relatively large vertical stabilizer compared to its overall size.",
        "An aircraft with a semi-recessed wheel design when the landing gear is deployed.",
        "An aircraft with a noticeable exhaust nozzle at the rear for each of its two engines.",
        "An aircraft with a high thrust-to-weight ratio, indicated by its large engines relative to its size.",
        "An aircraft with a distinctive 'cranked delta' wing design, where the wings have a noticeable kink partway along their span."
    ],
    "F-16A/B": [
        "An aircraft with a single-engine, multirole, supersonic design.",
        "An aircraft with a frameless bubble canopy for superior visibility.",
        "An aircraft with a side-mounted control stick to ease control while maneuvering.",
        "An aircraft with a reclined seat to reduce the effect of g-forces on the pilot.",
        "An aircraft with a single tail fin and stabilizers.",
        "An aircraft with a nose that is slightly pointed downwards.",
        "An aircraft with a blended wing body design.",
        "An aircraft with an air intake on the body's underside, just below the cockpit.",
        "An aircraft with a relatively small and lightweight design for a fighter jet.",
        "An aircraft with a thin, swept-back wing design.",
        "An aircraft with a trapezoidal wing shape.",
        "An aircraft with a pair of horizontal stabilizers near the tail.",
        "An aircraft with a single afterburning turbofan engine.",
        "An aircraft with a radar dome located in the nose.",
        "An aircraft with two underwing hardpoints for carrying additional fuel tanks or missiles.",
        "An aircraft with a landing gear that retracts into the body.",
        "An aircraft with a high-mounted exhaust nozzle at the rear.",
        "An aircraft with a relatively small radar cross-section for a fighter jet.",
        "An aircraft with a fly-by-wire control system.",
        "An aircraft with a M61 Vulcan cannon mounted internally on the left side of the fuselage."
    ],
    "F/A-18": [
        "An aircraft with twin engines mounted on either side of the fuselage.",
        "An aircraft with a twin-tail configuration, with the tail fins angled outward.",
        "An aircraft with a leading-edge extension that runs from the wing root to below the cockpit.",
        "An aircraft with a bubble canopy that provides 360-degree visibility for the pilot.",
        "An aircraft with a trapezoidal wing shape.",
        "An aircraft with a nose that is sharply pointed.",
        "An aircraft with a rectangular air intake under the wings.",
        "An aircraft with a noticeable hump behind the cockpit, known as a \"turtleback\".",
        "An aircraft with a single pilot seat in the F/A-18E/F Super Hornet variant, and a tandem two-seat configuration in the F/A-18B/D Hornet variant.",
        "An aircraft with a landing gear designed for carrier operations, characterized by a dual-wheel nose gear and single-wheel main gear.",
        "An aircraft with a grey or blue camouflage paint scheme typically used by the U.S. Navy and Marine Corps.",
        "An aircraft with folding wings for storage aboard aircraft carriers.",
        "An aircraft with hardpoints under the wings and fuselage for carrying weapons and other payloads.",
        "An aircraft with a refueling probe extending from the front of the cockpit.",
        "An aircraft with a rectangular exhaust nozzles.",
        "An aircraft with a radar dome located in the nose."
    ],
    "Falcon 2000": [
        "An aircraft with a twin-engine setup.",
        "An aircraft with a swept-wing design.",
        "An aircraft with a T-tail configuration.",
        "An aircraft with a low-wing monoplane design.",
        "An aircraft with a circular cross-section fuselage.",
        "An aircraft with a cockpit window design that includes four main windows and two smaller ones.",
        "An aircraft with a length of approximately 20 meters.",
        "An aircraft with a wingspan of approximately 19 meters.",
        "An aircraft with a distinctive S-duct air intake for the engines.",
        "An aircraft with a maximum takeoff weight of around 42,200 pounds.",
        "An aircraft with a seating capacity for 8-10 passengers in its standard configuration.",
        "An aircraft with a range of approximately 3,450 nautical miles.",
        "An aircraft with a cruising speed of around 528 knots.",
        "An aircraft with a cabin height of approximately 1.88 meters.",
        "An aircraft with a cabin width of approximately 2.34 meters.",
        "An aircraft with a cabin length of approximately 7.98 meters.",
        "An aircraft with a distinctive landing gear configuration of two main wheels and a nose wheel.",
        "An aircraft with a high-speed cruise capability of Mach 0.85.",
        "An aircraft with a service ceiling of 47,000 feet.",
        "An aircraft with a distinctive oval-shaped cabin windows."
    ],
    "Falcon 900": [
        "An aircraft with a trijet design, having three engines.",
        "An aircraft with a T-tail configuration, where the tailplane is mounted on top of the fin.",
        "An aircraft with a low-wing design, where the wings are mounted below the fuselage.",
        "An aircraft with a swept-wing design, where the wings are angled back from the fuselage.",
        "An aircraft with a large, oval-shaped cabin windows.",
        "An aircraft with a long, sleek fuselage.",
        "An aircraft with a winglet on each wing tip, which are small, upward-curving extensions.",
        "An aircraft with a retractable tricycle landing gear.",
        "An aircraft with a cockpit window design that includes four main windows and two small side windows.",
        "An aircraft with a rear-mounted engine configuration, where the engines are located at the back of the fuselage.",
        "An aircraft with a relatively short nose compared to the overall length of the aircraft.",
        "An aircraft with a high-speed cruise of Mach 0.84-0.87.",
        "An aircraft with a range of approximately 4,750 nautical miles.",
        "An aircraft with a capacity to carry up to 19 passengers.",
        "An aircraft with a length of approximately 20.21 meters.",
        "An aircraft with a wingspan of approximately 19.33 meters.",
        "An aircraft with a height of approximately 7.55 meters."
    ],
    "Fokker 100": [
        "An aircraft with a T-tail and rear-mounted engines.",
        "An aircraft with a narrow-body and twin-engine jet layout.",
        "An aircraft with a fuselage diameter of 3.30 meters.",
        "An aircraft with a length of approximately 35.53 meters.",
        "An aircraft with a wingspan of 28.08 meters.",
        "An aircraft with a wing design that lacks winglets.",
        "An aircraft with a seating arrangement for 85-100 passengers in a two-class layout.",
        "An aircraft with a cockpit designed for two crew members.",
        "An aircraft with a total of five cabin doors, two at the front, two over the wings, and one at the rear.",
        "An aircraft with a high-mounted horizontal stabilizer on the tail.",
        "An aircraft with a characteristic \"Fokker\" eyebrow windows above the main cockpit windows.",
        "An aircraft with a maximum cruising speed of 845 km/h.",
        "An aircraft with a range of approximately 2,100 kilometers.",
        "An aircraft with Rolls-Royce Tay turbofan engines.",
        "An aircraft with a low-wing monoplane design.",
        "An aircraft with a retractable tricycle landing gear.",
        "An aircraft with a circular cross-section fuselage."
    ],
    "Fokker 50": [
        "An aircraft with a high-wing configuration.",
        "An aircraft with two turboprop engines mounted on the wings.",
        "An aircraft with a T-tail design.",
        "An aircraft with a rounded nose.",
        "An aircraft with a length of approximately 25.25 meters.",
        "An aircraft with a wingspan of approximately 29 meters.",
        "An aircraft with a capacity to seat around 50 passengers.",
        "An aircraft with a conventional retractable tricycle landing gear.",
        "An aircraft with a short fuselage and a relatively large tail.",
        "An aircraft with a cockpit that has a large windshield divided into four sections.",
        "An aircraft with a single passenger door located at the front left side of the fuselage.",
        "An aircraft with a cargo door located at the rear left side of the fuselage.",
        "An aircraft with four-bladed propellers.",
        "An aircraft with a relatively flat underside of the fuselage.",
        "An aircraft with a small horizontal stabilizer located at the top of the vertical stabilizer.",
        "An aircraft with a relatively wide cabin for its size.",
        "An aircraft with a maximum takeoff weight of approximately 20,820 kilograms.",
        "An aircraft with a cruising speed of approximately 530 km/h.",
        "An aircraft with a range of approximately 2,055 kilometers.",
        "An aircraft with a service ceiling of approximately 7,620 meters."
    ],
    "Fokker 70": [
        "An aircraft with a length of approximately 38.1 meters.",
        "An aircraft with a wingspan of about 28.1 meters.",
        "An aircraft with a T-tail and rear-mounted engines.",
        "An aircraft with two Rolls-Royce Tay turbofan engines.",
        "An aircraft with a narrow-body and a twin-engine jet layout.",
        "An aircraft with a low-wing monoplane design.",
        "An aircraft with a capacity to carry around 70-85 passengers.",
        "An aircraft with a characteristic 'Fokker' eyebrow windows above the cockpit.",
        "An aircraft with a fuselage diameter of approximately 3.30 meters.",
        "An aircraft with a high-speed cruise of Mach 0.77.",
        "An aircraft with a range of approximately 2,040 nautical miles.",
        "An aircraft with a characteristic pointed nose and a slightly bulbous cockpit.",
        "An aircraft with a 2+3 seating arrangement in economy class.",
        "An aircraft with a total of four cabin doors, two at the front and two at the rear.",
        "An aircraft with a service ceiling of 35,000 feet.",
        "An aircraft with a landing gear configuration of two main wheels on each of the two main gear struts and two wheels on the nose gear.",
        "An aircraft with a relatively short and stubby appearance compared to other regional jets.",
        "An aircraft with a digital flight deck that can be operated by two crew members.",
        "An aircraft with a characteristic 'Fokker' logo on the tail."
    ],
    "Global Express": [
        "An aircraft with a low-wing monoplane design.",
        "An aircraft with a swept-wing design.",
        "An aircraft with a T-tail configuration.",
        "An aircraft with two rear-mounted Rolls-Royce BR710 turbofan engines.",
        "An aircraft with a long, streamlined fuselage.",
        "An aircraft with a large, oval-shaped cabin window.",
        "An aircraft with a pointed nose and a slightly curved tail.",
        "An aircraft with a winglet on each wing tip.",
        "An aircraft with a tricycle landing gear.",
        "An aircraft with a range of over 6,000 nautical miles.",
        "An aircraft with a maximum speed of Mach 0.89.",
        "An aircraft with a capacity to carry up to 19 passengers.",
        "An aircraft with a high cruising altitude, capable of flying above weather systems.",
        "An aircraft with a spacious cabin, often equipped with luxury amenities.",
        "An aircraft with a length of approximately 99 feet and a wingspan of 94 feet.",
        "An aircraft with a distinctive Bombardier logo on the tail."
    ],
    "Gulfstream IV": [
        "An aircraft with a low-wing monoplane design.",
        "An aircraft with two Rolls-Royce Tay turbofan engines mounted on the rear fuselage.",
        "An aircraft with a swept wing design, with a sweep angle of 24.2 degrees.",
        "An aircraft with a T-tail configuration, where the horizontal stabilizer is mounted on top of the vertical stabilizer.",
        "An aircraft with a length of approximately 88 feet and a wingspan of about 77.8 feet.",
        "An aircraft with a large, oval-shaped cabin window design.",
        "An aircraft with a retractable tricycle landing gear.",
        "An aircraft with a maximum range of approximately 4,220 nautical miles.",
        "An aircraft with a seating capacity of up to 19 passengers.",
        "An aircraft with a cruising speed of about 528 mph.",
        "An aircraft with a distinctive, elongated fuselage.",
        "An aircraft with a maximum takeoff weight of approximately 73,600 pounds.",
        "An aircraft with a high cruising altitude, capable of reaching up to 45,000 feet.",
        "An aircraft with a glass cockpit, featuring advanced avionics systems.",
        "An aircraft with a luxurious, spacious interior, often including a full galley, lavatory, and ample luggage space."
    ],
    "Gulfstream V": [
        "An aircraft with a low-wing monoplane design.",
        "An aircraft with two Rolls-Royce BR710 engines mounted on the rear part of the fuselage.",
        "An aircraft with a swept-back wing design.",
        "An aircraft with a T-tail configuration.",
        "An aircraft with a long, sleek, and streamlined fuselage.",
        "An aircraft with a large, oval-shaped cabin window.",
        "An aircraft with a length of approximately 96 feet and a wingspan of 93 feet.",
        "An aircraft with a high-speed cruise of Mach 0.885.",
        "An aircraft with a maximum range of 6,500 nautical miles.",
        "An aircraft with a seating capacity of up to 19 passengers.",
        "An aircraft with a distinctive nose shape, slightly pointed and rounded.",
        "An aircraft with a tricycle landing gear system.",
        "An aircraft with a maximum takeoff weight of 90,500 pounds.",
        "An aircraft with a high-mounted horizontal stabilizer on the tail.",
        "An aircraft with a maximum operating altitude of 51,000 feet.",
        "An aircraft with a large, spacious, and luxurious cabin interior.",
        "An aircraft with a cockpit equipped with a Honeywell SPZ-8500 avionics suite.",
        "An aircraft with a maximum speed of 675 mph.",
        "An aircraft with a long-range business jet category.",
        "An aircraft with a total of 14 oval windows on each side of the fuselage."
    ],
    "Hawk T1": [
        "An aircraft with a single, central air intake located beneath the fuselage.",
        "An aircraft with a low-mounted, swept-back wing design.",
        "An aircraft with a single vertical stabilizer and rudder.",
        "An aircraft with a tandem seating arrangement for two, with the rear seat elevated for better visibility.",
        "An aircraft with a tricycle landing gear configuration.",
        "An aircraft with a pair of small, wingtip-mounted fuel tanks.",
        "An aircraft with a clear, bubble-style canopy that opens to the right.",
        "An aircraft with a relatively short and stubby fuselage.",
        "An aircraft with a Rolls-Royce Adour turbofan engine.",
        "An aircraft with a pair of small, rectangular airbrakes located on the upper surface of the wings.",
        "An aircraft with a noticeable hump on the back, just behind the cockpit.",
        "An aircraft with a small, pointed nose cone.",
        "An aircraft with a pair of underwing pylons for carrying external payloads.",
        "An aircraft with a black and white, or red and white color scheme, often used by the Royal Air Force's Red Arrows display team.",
        "An aircraft with a relatively small size, typically around 11.85 meters in length.",
        "An aircraft with a maximum speed of Mach 0.84 (1,028 km/h, 638 mph).",
        "An aircraft with a service ceiling of 13,565 meters (44,500 feet)."
    ],
    "Il-76": [
        "An aircraft with four high-bypass turbofan engines mounted on pylons beneath the wings.",
        "An aircraft with a high-mounted wing with an anhedral (downward slope) angle.",
        "An aircraft with a T-tail, where the horizontal stabilizer is mounted on top of the vertical stabilizer.",
        "An aircraft with a glassed-in nose, allowing for a navigator's position with a clear view ahead.",
        "An aircraft with a large cargo door at the rear of the fuselage, which opens upwards to allow for loading and unloading.",
        "An aircraft with a broad, slightly oval fuselage cross-section.",
        "An aircraft with a retractable tricycle landing gear, with each unit carrying multiple wheels.",
        "An aircraft with a distinctive 'beak' or 'nose' shape, which is more pointed than many other cargo aircraft.",
        "An aircraft with a large dorsal fairing, or 'hump', on the fuselage, which houses various systems.",
        "An aircraft with a noticeable lack of winglets or wingtip devices.",
        "An aircraft with a large, rectangular air intake for each engine, located forward of the wing leading edge.",
        "An aircraft with a tail gunner's position, a feature not commonly found on modern aircraft.",
        "An aircraft with a relatively short, stubby appearance compared to its overall size.",
        "An aircraft with a large, flat underside to the fuselage, indicative of its cargo-carrying role.",
        "An aircraft with a noticeable gap between the engines on each wing, with the engines themselves being quite close to the fuselage.",
        "An aircraft with a relatively high ground clearance, allowing for easier loading and unloading of cargo."
    ],
    "L-1011": [
        "An aircraft with a third engine intake located at the base of the tail.",
        "An aircraft with a distinctive S-duct air intake for the tail engine.",
        "An aircraft with a wide-body fuselage design.",
        "An aircraft with a T-tail configuration.",
        "An aircraft with a low-wing design.",
        "An aircraft with a trijet layout, having three engines.",
        "An aircraft with a unique circular shape around the tail engine.",
        "An aircraft with two underwing engines.",
        "An aircraft with a long, slender fuselage.",
        "An aircraft with a cockpit window design that includes four panes on each side.",
        "An aircraft with a large, rounded nose.",
        "An aircraft with a landing gear configuration of two main landing gears, each with four wheels.",
        "An aircraft with a slightly swept-back wing design.",
        "An aircraft with a noticeable lack of winglets.",
        "An aircraft with a high-capacity, wide-body interior layout.",
        "An aircraft with a relatively short and wide tail fin compared to other wide-body jets.",
        "An aircraft with a noticeable bulge at the rear of the fuselage for the tail engine.",
        "An aircraft with a relatively flat underside of the fuselage.",
        "An aircraft with a four-door configuration on each side of the fuselage.",
        "An aircraft with a unique 'whale-like' shape when viewed from the side."
    ],
    "MD-11": [
        "An aircraft with three engines, one under each wing and the third in the tail.",
        "An aircraft with a distinctive 'hump' at the front of the fuselage, similar to a smaller version of the Boeing 747.",
        "An aircraft with a T-tail, where the horizontal stabilizer is mounted on top of the vertical stabilizer.",
        "An aircraft with a long, slender fuselage and a relatively high aspect ratio wing.",
        "An aircraft with winglets at the tips of the wings, which are angled upwards.",
        "An aircraft with a two-crew cockpit, which is a departure from the three-crew cockpit of its predecessor, the DC-10.",
        "An aircraft with a large cargo door at the front of the fuselage, if it's a freighter variant.",
        "An aircraft with a characteristic 'pinched' or 'waisted' look to the fuselage, just ahead of the wings.",
        "An aircraft with a relatively low-slung undercarriage, with the body of the plane closer to the ground than many other wide-body jets.",
        "An aircraft with a distinctive 'double-bubble' cross-section, where the fuselage is wider below the cabin floor than above it.",
        "An aircraft with a unique configuration of windows, with two rows of windows on the upper deck and a single row on the lower deck.",
        "An aircraft with a distinctive 'sawtooth' pattern on the trailing edge of the wings, which is a noise reduction feature.",
        "An aircraft with a relatively short, stubby nose compared to other wide-body jets.",
        "An aircraft with a unique configuration of landing gear, with a set of four wheels on each main landing gear and two wheels on the nose gear.",
        "An aircraft with a unique configuration of doors, with one large door at the front, two smaller doors over the wings, and one large door at the rear."
    ],
    "MD-80": [
        "An aircraft with a T-tail configuration, where the tailplane is mounted on top of the fin.",
        "An aircraft with a rear-mounted twin-engine setup.",
        "An aircraft with a long, slender fuselage.",
        "An aircraft with a five-abreast seating configuration in the main cabin.",
        "An aircraft with a single-aisle design.",
        "An aircraft with a distinctive, pointed nose cone.",
        "An aircraft with a relatively low ground clearance.",
        "An aircraft with a characteristic 'eyebrow' or 'Mad Dog' cockpit windows.",
        "An aircraft with a rear airstair for boarding and deplaning.",
        "An aircraft with a relatively quiet forward cabin due to the rear engine placement.",
        "An aircraft with a high-mounted horizontal stabilizer.",
        "An aircraft with a narrow body design.",
        "An aircraft with a relatively short wingspan compared to its body length.",
        "An aircraft with a lack of winglets on most models.",
        "An aircraft with a two-wheel nose landing gear and four-wheel main landing gear.",
        "An aircraft with a slightly angled landing gear when viewed from the side.",
        "An aircraft with a unique engine sound, often described as a 'buzzsaw' noise.",
        "An aircraft with a small diameter fuselage, giving it a 'tube-like' appearance.",
        "An aircraft with a cockpit that has a more 'vintage' look compared to newer aircraft models.",
        "An aircraft with a relatively small number of passenger windows compared to its length."
    ],
    "MD-87": [
        "An aircraft with a length of approximately 130 feet, shorter than many other commercial jets.",
        "An aircraft with a T-tail configuration, where the tailplane is mounted on top of the fin.",
        "An aircraft with two rear-mounted engines.",
        "An aircraft with a distinctive 'eyebrow' or 'third-eye' window above the cockpit.",
        "An aircraft with a slightly angled landing gear.",
        "An aircraft with a fuselage diameter of approximately 11 feet.",
        "An aircraft with a wingspan of around 107 feet.",
        "An aircraft with a noticeable 'pinched' or 'waisted' effect at the rear of the fuselage, just ahead of the engine mounts.",
        "An aircraft with a capacity of around 130-170 passengers, depending on the seating configuration.",
        "An aircraft with a range of approximately 2,370 nautical miles.",
        "An aircraft with a high-speed cruise of around Mach 0.76.",
        "An aircraft with a service ceiling of 37,000 feet.",
        "An aircraft with a distinctive air intake or 'scoop' on the underside of the fuselage, towards the tail.",
        "An aircraft with a relatively short, stubby appearance compared to other commercial jets.",
        "An aircraft with a 'clean wing' design, with no winglets or other major protrusions.",
        "An aircraft with a relatively small number of cabin windows, typically around 30 on each side.",
        "An aircraft with a cockpit window layout of six panes, two main front windows, two side windows, and two smaller eyebrow windows.",
        "An aircraft with a single aisle in the passenger cabin.",
        "An aircraft with a relatively low ground clearance, due to its short landing gear.",
        "An aircraft with a distinctive 'double-bubble' cross-section, giving the fuselage a characteristic shape."
    ],
    "MD-90": [
        "An aircraft with two rear-mounted engines.",
        "An aircraft with a T-tail configuration.",
        "An aircraft with a longer fuselage compared to other MD series aircraft.",
        "An aircraft with a pointed nose cone.",
        "An aircraft with a single aisle in the cabin.",
        "An aircraft with five abreast seating in the cabin.",
        "An aircraft with a glass cockpit, which is a distinctive feature compared to older MD series aircraft.",
        "An aircraft with a slightly angled wingtip, but without winglets.",
        "An aircraft with a small dorsal fin extending from the top of the tail.",
        "An aircraft with a clean, unbroken line from nose to tail, without any hump or bump in the fuselage.",
        "An aircraft with a relatively low stance, with the fuselage closer to the ground compared to other similar-sized aircraft.",
        "An aircraft with a circular cross-section of the fuselage.",
        "An aircraft with a relatively short distance between the trailing edge of the wing and the tail.",
        "An aircraft with a high bypass ratio engines, which are larger and more circular in shape compared to older low bypass ratio engines.",
        "An aircraft with a relatively large distance between the two engines, compared to other twin-engine rear-mounted aircraft.",
        "An aircraft with a relatively small vertical stabilizer, compared to the overall size of the aircraft.",
        "An aircraft with a relatively large horizontal stabilizer, compared to the overall size of the aircraft.",
        "An aircraft with a relatively large size of the cockpit windows, compared to other MD series aircraft.",
        "An aircraft with a relatively small size of the passenger windows, compared to other similar-sized aircraft.",
        "An aircraft with a relatively large size of the cargo door, compared to other MD series aircraft."
    ],
    "Metroliner": [
        "An aircraft with a low-wing monoplane design.",
        "An aircraft with a T-tail configuration.",
        "An aircraft with two turboprop engines mounted on the wings.",
        "An aircraft with a long, narrow, and tube-like fuselage.",
        "An aircraft with a retractable tricycle landing gear.",
        "An aircraft with a cockpit that accommodates two crew members.",
        "An aircraft with a single passenger door on the left side of the fuselage.",
        "An aircraft with a length of approximately 20 meters.",
        "An aircraft with a wingspan of approximately 17 meters.",
        "An aircraft with a capacity of up to 19 passengers.",
        "An aircraft with a high-speed cruise of approximately 295 knots.",
        "An aircraft with a range of approximately 1,000 nautical miles.",
        "An aircraft with a service ceiling of approximately 25,000 feet.",
        "An aircraft with a distinctive pointed nose.",
        "An aircraft with a relatively small diameter fuselage compared to its length.",
        "An aircraft with a windshield divided into four sections.",
        "An aircraft with a relatively flat bottomed fuselage.",
        "An aircraft with a small, rounded tail cone.",
        "An aircraft with a relatively straight leading edge on the wings.",
        "An aircraft with a noticeable dihedral angle on the wings."
    ],
    "Model B200": [
        "An aircraft with a T-tail design.",
        "An aircraft with a low-wing monoplane structure.",
        "An aircraft with two Pratt & Whitney Canada PT6A-42 turboprop engines.",
        "An aircraft with a retractable tricycle landing gear.",
        "An aircraft with a length of approximately 43 feet.",
        "An aircraft with a wingspan of approximately 54 feet.",
        "An aircraft with a maximum takeoff weight of around 12,500 pounds.",
        "An aircraft with a maximum speed of 339 knots.",
        "An aircraft with a range of approximately 2,075 nautical miles.",
        "An aircraft with a service ceiling of 35,000 feet.",
        "An aircraft with a pressurized cabin that can accommodate up to 13 passengers.",
        "An aircraft with a distinctive oval-shaped fuselage cross-section.",
        "An aircraft with four-bladed propellers.",
        "An aircraft with a swept-back vertical stabilizer.",
        "An aircraft with a cockpit that accommodates two crew members.",
        "An aircraft with a large, rectangular cabin door on the left side of the fuselage.",
        "An aircraft with a high-mounted horizontal stabilizer.",
        "An aircraft with a relatively flat nose profile.",
        "An aircraft with a single pilot windshield design.",
        "An aircraft with exhaust ports located on the lower sides of the engine nacelles."
    ],
    "PA-28": [
        "An aircraft with a low-wing, tricycle landing gear configuration.",
        "An aircraft with a single piston engine mounted in the nose.",
        "An aircraft with a tapered wing with a slight dihedral.",
        "An aircraft with a stabilator, a one-piece horizontal stabilizer and elevator.",
        "An aircraft with a rectangular or tapered wing depending on the model.",
        "An aircraft with a two or four-seat cabin, depending on the model.",
        "An aircraft with a single door on the co-pilot side, which is entered by stepping on the wing.",
        "An aircraft with a distinctive \"hershey bar\" wing shape in earlier models.",
        "An aircraft with a constant-chord wing in earlier models.",
        "An aircraft with a swept tailfin and rudder.",
        "An aircraft with a clear, bubble-shaped canopy for maximum visibility.",
        "An aircraft with a propeller in the front.",
        "An aircraft with a small, rounded vertical stabilizer.",
        "An aircraft with a relatively short and broad fuselage.",
        "An aircraft with a fixed pitch, two-blade propeller.",
        "An aircraft with a nose wheel that is smaller than the main landing gear wheels.",
        "An aircraft with a relatively flat bottomed fuselage.",
        "An aircraft with a small exhaust pipe on the right side of the engine cowling.",
        "An aircraft with a single, centrally located fuel tank filler cap on each wing.",
        "An aircraft with a small, rounded horizontal stabilizer at the tail."
    ],
    "SR-20": [
        "An aircraft with a single engine located at the front.",
        "An aircraft with a low-wing monoplane design.",
        "An aircraft with a sleek, streamlined shape.",
        "An aircraft with a three-blade propeller.",
        "An aircraft with a tricycle landing gear.",
        "An aircraft with a large, bubble-like canopy that provides a panoramic view.",
        "An aircraft with a T-tail configuration.",
        "An aircraft with a side-stick flight controller on the right side of the cockpit.",
        "An aircraft with a seating arrangement for three to four people.",
        "An aircraft with a Cirrus Airframe Parachute System (CAPS) - a parachute capable of lowering the entire plane safely to the ground in an emergency.",
        "An aircraft with a distinctive \"Cirrus\" logo on the tail.",
        "An aircraft with a relatively short nose compared to other similar-sized aircraft.",
        "An aircraft with a white or light-colored body, often with a stripe or two running along the side.",
        "An aircraft with a relatively wide wingspan compared to its body length.",
        "An aircraft with a high-performance, composite construction."
    ],
    "Saab 2000": [
        "An aircraft with a high-wing, twin-engine design.",
        "An aircraft with a long, slender fuselage.",
        "An aircraft with a T-tail configuration.",
        "An aircraft with five-blade propellers.",
        "An aircraft with a length of approximately 27 meters.",
        "An aircraft with a wingspan of approximately 25 meters.",
        "An aircraft with a capacity to seat around 50-58 passengers.",
        "An aircraft with a distinctive nose shape, similar to a dolphin's snout.",
        "An aircraft with a large, rounded cockpit window.",
        "An aircraft with a relatively high ground clearance.",
        "An aircraft with a landing gear configuration of two main wheels and a nose wheel.",
        "An aircraft with a relatively flat underside.",
        "An aircraft with a small winglet at the tip of each wing.",
        "An aircraft with a small exhaust port located at the rear of each engine nacelle.",
        "An aircraft with a relatively large distance between the two engines.",
        "An aircraft with a small horizontal stabilizer located at the top of the vertical stabilizer.",
        "An aircraft with a relatively large vertical stabilizer.",
        "An aircraft with a small antenna located on the top of the fuselage, towards the rear.",
        "An aircraft with a small, rounded tail cone.",
        "An aircraft with a relatively large distance between the cockpit and the first passenger window."
    ],
    "Saab 340": [
        "An aircraft with a high-wing, twin-engine turboprop configuration.",
        "An aircraft with a T-tail design.",
        "An aircraft with a length of approximately 19.73 meters.",
        "An aircraft with a wingspan of approximately 21.44 meters.",
        "An aircraft with a capacity to seat between 30 to 36 passengers.",
        "An aircraft with a distinctive nose shape, slightly pointed and elongated.",
        "An aircraft with a circular fuselage cross-section.",
        "An aircraft with two large, round engines mounted on the wings.",
        "An aircraft with a tricycle landing gear configuration.",
        "An aircraft with a relatively short and wide body.",
        "An aircraft with a cockpit window layout of four panes per side, with the second and third panes being the largest.",
        "An aircraft with a single passenger door located at the front left side of the fuselage.",
        "An aircraft with a small cargo door located at the rear left side of the fuselage.",
        "An aircraft with a relatively flat underside of the fuselage.",
        "An aircraft with a small, rounded tail cone.",
        "An aircraft with ailerons located on the outer half of each wing.",
        "An aircraft with a relatively large vertical stabilizer compared to the overall size of the aircraft.",
        "An aircraft with a horizontal stabilizer located at the top of the vertical stabilizer.",
        "An aircraft with winglets at the tip of each wing.",
        "An aircraft with a relatively high ground clearance."
    ],
    "Spitfire": [
        "An aircraft with an elliptical wing shape.",
        "An aircraft with a single propeller at the front.",
        "An aircraft with a long, pointed nose.",
        "An aircraft with a large, bubble-shaped cockpit canopy.",
        "An aircraft with a tail wheel landing gear.",
        "An aircraft with two exhaust stacks on each side of the engine cowling.",
        "An aircraft with a distinctive, rounded vertical stabilizer.",
        "An aircraft with a Rolls-Royce Merlin or Griffon engine, identifiable by the specific arrangement of exhausts.",
        "An aircraft with a thin, streamlined fuselage.",
        "An aircraft with a relatively small horizontal stabilizer compared to the size of the wings.",
        "An aircraft with a four-bladed propeller, especially in later models.",
        "An aircraft with a radiator under each wing in a characteristic rectangular shape.",
        "An aircraft with a retractable landing gear.",
        "An aircraft with a relatively short wingspan compared to its length.",
        "An aircraft with a distinctive 'kink' in the leading edge of the wing, near the wingtip.",
        "An aircraft with a large spinner covering the hub of the propeller.",
        "An aircraft with a relatively high-set cockpit, giving the pilot a good view.",
        "An aircraft with a narrow track undercarriage.",
        "An aircraft with a single pilot seat.",
        "An aircraft with a distinctive, rounded tailplane."
    ],
    "Tornado": [
        "An aircraft with a twin-engine, variable-sweep wing multirole design.",
        "An aircraft with a distinctive 'double bubble' canopy, providing excellent all-round visibility for the two crew members.",
        "An aircraft with a long, slender fuselage and a sharply pointed nose.",
        "An aircraft with two vertical tail fins, positioned at the ends of a horizontal stabilizer.",
        "An aircraft with wings that can be swept back and forth to optimize performance at different speeds.",
        "An aircraft with a pair of Turbo-Union RB199 engines, each with two exhaust nozzles.",
        "An aircraft with a large air intake on each side of the fuselage, just below the cockpit.",
        "An aircraft with a refueling probe extending from the right side of the nose.",
        "An aircraft with a distinctive 'bump' on the top of the fuselage, just behind the cockpit, which houses radar and other equipment.",
        "An aircraft with a tricycle landing gear configuration, with two main wheels retracting into the fuselage and a single nose wheel.",
        "An aircraft with hardpoints under the fuselage and wings for carrying a variety of weapons and other payloads.",
        "An aircraft with a maximum speed of around Mach 2.2, indicating a high-performance design.",
        "An aircraft with a characteristic blue and grey camouflage pattern, often used by the Royal Air Force.",
        "An aircraft with a length of approximately 16.7 meters and a wingspan of about 8.6 meters when fully swept back.",
        "An aircraft with a distinctive 'recessed' area under the tail, which can house a parachute for short landings."
    ],
    "Tu-134": [
        "An aircraft with a glazed-nose design.",
        "An aircraft with two engines mounted at the rear of the fuselage.",
        "An aircraft with a swept-wing design.",
        "An aircraft with a T-tail configuration.",
        "An aircraft with a circular cross-section fuselage.",
        "An aircraft with a single-aisle cabin layout.",
        "An aircraft with a capacity of around 80 passengers.",
        "An aircraft with a dorsal air intake for the auxiliary power unit.",
        "An aircraft with a retractable tail-wheel undercarriage.",
        "An aircraft with a noticeable anhedral angle on the wings.",
        "An aircraft with a length of approximately 37 meters.",
        "An aircraft with a wingspan of approximately 29 meters.",
        "An aircraft with a distinctive circular engine exhaust at the rear.",
        "An aircraft with a high-speed cruise of around 900 km/h.",
        "An aircraft with a range of approximately 3,600 kilometers.",
        "An aircraft with a service ceiling of around 12,000 meters.",
        "An aircraft with a distinctive Soviet-era design and aesthetics.",
        "An aircraft with a relatively short and stubby fuselage compared to other jet airliners.",
        "An aircraft with a lack of winglets or wingtip devices.",
        "An aircraft with a relatively loud engine noise due to older turbojet technology."
    ],
    "Tu-154": [
        "An aircraft with a T-tail and rear-mounted engines.",
        "An aircraft with three jet engines, two on the sides and one in the center.",
        "An aircraft with a narrow-body fuselage design.",
        "An aircraft with a swept-wing design.",
        "An aircraft with a noticeable bulge under the tail, which houses the third engine.",
        "An aircraft with a four-wheel bogie on each of its main landing gears.",
        "An aircraft with a slightly drooped nose.",
        "An aircraft with a high-mounted horizontal stabilizer on the tail.",
        "An aircraft with a single-aisle cabin layout.",
        "An aircraft with a glass cockpit that lacks a flight engineer station.",
        "An aircraft with a relatively long fuselage compared to its wingspan.",
        "An aircraft with a circular cross-section of the fuselage.",
        "An aircraft with a noticeable lack of winglets or sharklets on the wingtips.",
        "An aircraft with a relatively high ground clearance due to the design of its landing gear.",
        "An aircraft with a small dorsal fin extending from the top of the fuselage to the tail."
    ],
    "Yak-42": [
        "An aircraft with a T-tail and rear-mounted engines.",
        "An aircraft with three jet engines, one on each side of the rear fuselage and one in the tail.",
        "An aircraft with a narrow-body fuselage design.",
        "An aircraft with a low-wing configuration.",
        "An aircraft with a tricycle landing gear system.",
        "An aircraft with a slightly swept wing design.",
        "An aircraft with a circular cross-section of the fuselage.",
        "An aircraft with a cockpit that accommodates two pilots.",
        "An aircraft with a capacity of around 120 passengers in a two-class layout.",
        "An aircraft with a length of approximately 36 meters.",
        "An aircraft with a wingspan of approximately 34.88 meters.",
        "An aircraft with a distinctive hump on the upper rear fuselage for the third engine.",
        "An aircraft with four cabin doors, two on each side of the fuselage.",
        "An aircraft with a high-speed cruise of around 810 km/h.",
        "An aircraft with a range of approximately 4,000 kilometers.",
        "An aircraft with a service ceiling of around 9,600 meters.",
        "An aircraft with a distinctive Soviet-era design and aesthetics."
    ]
}